#ifndef GLOAM_VK_H
#define GLOAM_VK_H

#ifdef VULKAN_H_
  #error Vulkan (vulkan.h) header already included (API: vulkan), remove previous include!
#endif
#define VULKAN_H_ 1
#ifdef VULKAN_CORE_H_
  #error Vulkan (vulkan_core.h) header already included (API: vulkan), remove previous include!
#endif
#define VULKAN_CORE_H_ 1

/* ---- Platform detection ------------------------------------------------ */
#ifndef GLOAM_PLATFORM_DETECTED_
#define GLOAM_PLATFORM_DETECTED_
#if defined(__CYGWIN__) || defined(_WIN32)
#  define GLOAM_PLATFORM_WINDOWS 1
#endif
#if defined(__linux)
#  define GLOAM_PLATFORM_LINUX 1
#endif
#endif /* GLOAM_PLATFORM_DETECTED_ */

#ifndef GLOAM_HAS_ENUM_BASE_TYPE
#if defined(__cplusplus) || (defined(__STDC_VERSION__) && __STDC_VERSION__ >= 202311L)
#  define GLOAM_HAS_ENUM_BASE_TYPE 1
#else
#  define GLOAM_HAS_ENUM_BASE_TYPE 0
#endif
#endif

#ifndef GLOAM_FORCE_INLINE
#if defined(_MSC_VER)
#  define GLOAM_FORCE_INLINE static __forceinline
#elif defined(__GNUC__) || defined(__clang__)
#  define GLOAM_FORCE_INLINE static inline __attribute__((always_inline))
#else
#  define GLOAM_FORCE_INLINE static inline
#endif
#endif

#include <stddef.h>
#include <stdint.h>

#include "vulkan/vk_platform.h"

#ifdef __cplusplus
extern "C" {
#endif

/* ---- Version feature guards ----------------------------------------------
 * These mirror the upstream vulkan_core.h / gl.h definitions so that code
 * guarded by e.g. #ifdef GL_VERSION_3_3 compiles correctly against this

} VkDataGraphPipelineNodeConnectionTypeARM;

typedef enum VkDataGraphPipelineNodeTypeARM {
    VK_DATA_GRAPH_PIPELINE_NODE_TYPE_OPTICAL_FLOW_ARM = 1000631000,
    VK_DATA_GRAPH_PIPELINE_NODE_TYPE_ARM_MAX_ENUM = 0x7FFFFFFF
} VkDataGraphPipelineNodeTypeARM;

typedef enum VkDataGraphOpticalFlowCreateFlagBitsARM {
    VK_DATA_GRAPH_OPTICAL_FLOW_CREATE_ENABLE_HINT_BIT_ARM = 0x0000000000000001,
    VK_DATA_GRAPH_OPTICAL_FLOW_CREATE_ENABLE_COST_BIT_ARM = 0x0000000000000002,
    VK_DATA_GRAPH_OPTICAL_FLOW_CREATE_RESERVED_30_BIT_ARM = 0x0000000040000000,
    VK_DATA_GRAPH_OPTICAL_FLOW_CREATE_FLAG_BITS_ARM_MAX_ENUM = 0x7FFFFFFF
} VkDataGraphOpticalFlowCreateFlagBitsARM;

typedef enum VkDataGraphOpticalFlowExecuteFlagBitsARM {
    VK_DATA_GRAPH_OPTICAL_FLOW_EXECUTE_DISABLE_TEMPORAL_HINTS_BIT_ARM = 0x0000000000000001,
    VK_DATA_GRAPH_OPTICAL_FLOW_EXECUTE_INPUT_UNCHANGED_BIT_ARM = 0x0000000000000002,
    VK_DATA_GRAPH_OPTICAL_FLOW_EXECUTE_REFERENCE_UNCHANGED_BIT_ARM = 0x0000000000000004,
    VK_DATA_GRAPH_OPTICAL_FLOW_EXECUTE_INPUT_IS_PREVIOUS_REFERENCE_BIT_ARM = 0x0000000000000008,
    VK_DATA_GRAPH_OPTICAL_FLOW_EXECUTE_REFERENCE_IS_PREVIOUS_INPUT_BIT_ARM = 0x0000000000000010,
    VK_DATA_GRAPH_OPTICAL_FLOW_EXECUTE_FLAG_BITS_ARM_MAX_ENUM = 0x7FFFFFFF
} VkDataGraphOpticalFlowExecuteFlagBitsARM;

typedef enum VkNeuralAcceleratorStatisticsModeARM {
    VK_NEURAL_ACCELERATOR_STATISTICS_MODE_DISABLED_ARM = 0,
    VK_NEURAL_ACCELERATOR_STATISTICS_MODE_STATISTICS0_ARM = 1,
    VK_NEURAL_ACCELERATOR_STATISTICS_MODE_STATISTICS1_ARM = 2,
    VK_NEURAL_ACCELERATOR_STATISTICS_MODE_ARM_MAX_ENUM = 0x7FFFFFFF
} VkNeuralAcceleratorStatisticsModeARM;

/* ---- Types ----------------------------------------------------------------
 * Emitted in topological dependency order. Consecutive types sharing the
 * same platform guard are coalesced into a single #ifdef/#endif block.
 */
/* Version of this file */
#define VK_HEADER_VERSION 357

#define VK_DEFINE_HANDLE(object) typedef struct object##_T* object;

#ifndef VK_USE_64_BIT_PTR_DEFINES
    #if defined(__LP64__) || defined(_WIN64) || (defined(__x86_64__) && !defined(__ILP32__) ) || defined(_M_X64) || defined(__ia64) || defined (_M_IA64) || defined(__aarch64__) || defined(__powerpc64__) || (defined(__riscv) && __riscv_xlen == 64)
        #define VK_USE_64_BIT_PTR_DEFINES 1
    #else
        #define VK_USE_64_BIT_PTR_DEFINES 0
    #endif
#endif

#if defined(VK_USE_PLATFORM_ANDROID_KHR)
struct ANativeWindow;

struct AHardwareBuffer;
#endif

#if defined(VK_USE_PLATFORM_METAL_EXT)
typedef struct __IOSurface* IOSurfaceRef;
#endif

#if defined(VK_USE_PLATFORM_OHOS)
typedef struct NativeWindow OHNativeWindow;
#endif

struct OHBufferHandle;

#if defined(VK_USE_PLATFORM_OHOS)
struct OH_NativeBuffer;
#endif

/* Vulkan SC variant number */
#define VKSC_API_VARIANT 1

VK_DEFINE_HANDLE(VkInstance)

VK_DEFINE_HANDLE(VkPhysicalDevice)

VK_DEFINE_HANDLE(VkDevice)

VK_DEFINE_HANDLE(VkQueue)

VK_DEFINE_HANDLE(VkCommandBuffer)

VK_DEFINE_HANDLE(VkExternalComputeQueueNV)

typedef struct VkComponentMapping {
    VkComponentSwizzle r;
    VkComponentSwizzle g;
    VkComponentSwizzle b;
    VkComponentSwizzle a;
} VkComponentMapping;

typedef struct VkBaseOutStructure {
    VkStructureType sType;
    struct VkBaseOutStructure* pNext;
} VkBaseOutStructure;

typedef struct VkBaseInStructure {
    VkStructureType sType;
    const struct VkBaseInStructure* pNext;
} VkBaseInStructure;

typedef VkRayTracingInvocationReorderModeEXT VkRayTracingInvocationReorderModeNV;

typedef VkPrivateDataSlotCreateFlagBits VkPrivateDataSlotCreateFlagBitsEXT;

typedef VkDescriptorUpdateTemplateType VkDescriptorUpdateTemplateTypeKHR;

typedef VkPointClippingBehavior VkPointClippingBehaviorKHR;

typedef VkQueueGlobalPriority VkQueueGlobalPriorityKHR;

typedef VkQueueGlobalPriority VkQueueGlobalPriorityEXT;

typedef VkTimeDomainKHR VkTimeDomainEXT;

typedef VkResolveModeFlagBits VkResolveModeFlagBitsKHR;

typedef VkDescriptorBindingFlagBits VkDescriptorBindingFlagBitsEXT;

typedef VkSemaphoreType VkSemaphoreTypeKHR;

typedef VkGeometryFlagBitsKHR VkGeometryFlagBitsNV;

typedef VkGeometryInstanceFlagBitsKHR VkGeometryInstanceFlagBitsNV;

typedef VkBuildAccelerationStructureFlagBitsKHR VkBuildAccelerationStructureFlagBitsNV;

typedef VkCopyAccelerationStructureModeKHR VkCopyAccelerationStructureModeNV;

typedef VkAccelerationStructureTypeKHR VkAccelerationStructureTypeNV;

typedef VkGeometryTypeKHR VkGeometryTypeNV;

typedef VkRayTracingShaderGroupTypeKHR VkRayTracingShaderGroupTypeNV;

typedef VkPipelineCreationFeedbackFlagBits VkPipelineCreationFeedbackFlagBitsEXT;

typedef VkSemaphoreWaitFlagBits VkSemaphoreWaitFlagBitsKHR;

typedef VkLineRasterizationMode VkLineRasterizationModeKHR;

typedef VkLineRasterizationMode VkLineRasterizationModeEXT;

typedef VkToolPurposeFlagBits VkToolPurposeFlagBitsEXT;

typedef VkAccessFlagBits2 VkAccessFlagBits2KHR;

typedef VkPipelineStageFlagBits2 VkPipelineStageFlagBits2KHR;

typedef VkHostImageCopyFlagBits VkHostImageCopyFlagBitsEXT;

typedef VkFormatFeatureFlagBits2 VkFormatFeatureFlagBits2KHR;

typedef VkRenderingFlagBits VkRenderingFlagBitsKHR;

typedef VkPipelineRobustnessBufferBehavior VkPipelineRobustnessBufferBehaviorEXT;

typedef VkPipelineRobustnessImageBehavior VkPipelineRobustnessImageBehaviorEXT;

typedef VkOpacityMicromapFormatKHR VkOpacityMicromapFormatEXT;

typedef VkOpacityMicromapSpecialIndexKHR VkOpacityMicromapSpecialIndexEXT;

typedef VkDeviceFaultVendorBinaryHeaderVersionKHR VkDeviceFaultVendorBinaryHeaderVersionEXT;

typedef VkMemoryDecompressionMethodFlagBitsEXT VkMemoryDecompressionMethodFlagBitsNV;

typedef VkPipelineCreateFlagBits2 VkPipelineCreateFlagBits2KHR;

typedef VkBufferUsageFlagBits2 VkBufferUsageFlagBits2KHR;

typedef VkScopeKHR VkScopeNV;

typedef VkComponentTypeKHR VkComponentTypeNV;

typedef VkExternalMemoryHandleTypeFlagBits VkExternalMemoryHandleTypeFlagBitsKHR;

typedef VkExternalMemoryFeatureFlagBits VkExternalMemoryFeatureFlagBitsKHR;

typedef VkExternalSemaphoreHandleTypeFlagBits VkExternalSemaphoreHandleTypeFlagBitsKHR;

typedef VkExternalSemaphoreFeatureFlagBits VkExternalSemaphoreFeatureFlagBitsKHR;

typedef VkSemaphoreImportFlagBits VkSemaphoreImportFlagBitsKHR;

typedef VkExternalFenceHandleTypeFlagBits VkExternalFenceHandleTypeFlagBitsKHR;

typedef VkExternalFenceFeatureFlagBits VkExternalFenceFeatureFlagBitsKHR;

typedef VkFenceImportFlagBits VkFenceImportFlagBitsKHR;

typedef VkPeerMemoryFeatureFlagBits VkPeerMemoryFeatureFlagBitsKHR;

typedef VkMemoryAllocateFlagBits VkMemoryAllocateFlagBitsKHR;

typedef VkTessellationDomainOrigin VkTessellationDomainOriginKHR;

typedef VkSamplerYcbcrModelConversion VkSamplerYcbcrModelConversionKHR;

typedef VkSamplerYcbcrRange VkSamplerYcbcrRangeKHR;

typedef VkChromaLocation VkChromaLocationKHR;

typedef VkSamplerReductionMode VkSamplerReductionModeEXT;

typedef VkShaderFloatControlsIndependence VkShaderFloatControlsIndependenceKHR;

typedef VkSubmitFlagBits VkSubmitFlagBitsKHR;

typedef VkDeviceFaultAddressTypeKHR VkDeviceFaultAddressTypeEXT;

typedef VkPresentScalingFlagBitsKHR VkPresentScalingFlagBitsEXT;

typedef VkPresentGravityFlagBitsKHR VkPresentGravityFlagBitsEXT;

typedef VkMemoryUnmapFlagBits VkMemoryUnmapFlagBitsKHR;

typedef VkDriverId VkDriverIdKHR;

#if defined(VK_USE_PLATFORM_METAL_EXT)
#ifdef __OBJC__
@class CAMetalLayer;
#else
typedef void CAMetalLayer;
#endif

#ifdef __OBJC__
@protocol MTLDevice;
typedef __unsafe_unretained id<MTLDevice> MTLDevice_id;
#else
typedef void* MTLDevice_id;
#endif

#ifdef __OBJC__
@protocol MTLCommandQueue;
typedef __unsafe_unretained id<MTLCommandQueue> MTLCommandQueue_id;
#else
typedef void* MTLCommandQueue_id;
#endif

#ifdef __OBJC__
@protocol MTLBuffer;
typedef __unsafe_unretained id<MTLBuffer> MTLBuffer_id;
#else
typedef void* MTLBuffer_id;
#endif

#ifdef __OBJC__
@protocol MTLTexture;
typedef __unsafe_unretained id<MTLTexture> MTLTexture_id;
#else
typedef void* MTLTexture_id;
#endif

#ifdef __OBJC__
@protocol MTLSharedEvent;
typedef __unsafe_unretained id<MTLSharedEvent> MTLSharedEvent_id;
#else
typedef void* MTLSharedEvent_id;
#endif
#endif

typedef void (VKAPI_PTR *PFN_vkFreeFunction)(void*                       pUserData, void*                       pMemory);

typedef void (VKAPI_PTR *PFN_vkVoidFunction)(void);

typedef struct VkFaultData {
    VkStructureType sType;
    void* pNext;
    VkFaultLevel                    faultLevel;
    VkFaultType                     faultType;
} VkFaultData;

typedef void* VkRemoteAddressNV;

typedef struct VkViewport {
    float x;
    float y;
    float width;
    float height;
    float                       minDepth;
    float                       maxDepth;
} VkViewport;

typedef struct VkDebugUtilsLabelEXT {
    VkStructureType sType;
    const void*                            pNext;
    const char*      pLabelName;
    float                  color[4];
} VkDebugUtilsLabelEXT;

#define VK_MAKE_VERSION(major, minor, patch) \
    ((((uint32_t)(major)) << 22U) | (((uint32_t)(minor)) << 12U) | ((uint32_t)(patch)))

#define VK_VERSION_MAJOR(version) ((uint32_t)(version) >> 22U)

#define VK_VERSION_MINOR(version) (((uint32_t)(version) >> 12U) & 0x3FFU)

#define VK_VERSION_PATCH(version) ((uint32_t)(version) & 0xFFFU)

#define VK_MAKE_API_VERSION(variant, major, minor, patch) \
    ((((uint32_t)(variant)) << 29U) | (((uint32_t)(major)) << 22U) | (((uint32_t)(minor)) << 12U) | ((uint32_t)(patch)))

#define VK_API_VERSION_VARIANT(version) ((uint32_t)(version) >> 29U)

#define VK_API_VERSION_MAJOR(version) (((uint32_t)(version) >> 22U) & 0x7FU)

#define VK_API_VERSION_MINOR(version) (((uint32_t)(version) >> 12U) & 0x3FFU)

#define VK_API_VERSION_PATCH(version) ((uint32_t)(version) & 0xFFFU)

typedef uint32_t VkSampleMask;

typedef uint32_t VkBool32;

typedef uint32_t VkFlags;

typedef struct VkExtent2D {
    uint32_t        width;
    uint32_t        height;
} VkExtent2D;

typedef struct VkExtent3D {
    uint32_t        width;
    uint32_t        height;
    uint32_t        depth;
} VkExtent3D;

typedef struct VkExtensionProperties {
    char extensionName[VK_MAX_EXTENSION_NAME_SIZE];
    uint32_t                   specVersion;
} VkExtensionProperties;

typedef struct VkLayerProperties {
    char layerName[VK_MAX_EXTENSION_NAME_SIZE];
    uint32_t                   specVersion;
    uint32_t                   implementationVersion;
    char description[VK_MAX_DESCRIPTION_SIZE];
} VkLayerProperties;

typedef struct VkApplicationInfo {
    VkStructureType sType;
    const void*     pNext;
    const char*     pApplicationName;
    uint32_t        applicationVersion;
    const char*     pEngineName;
    uint32_t        engineVersion;
    uint32_t        apiVersion;
} VkApplicationInfo;

typedef struct VkDescriptorPoolSize {
    VkDescriptorType       type;
    uint32_t               descriptorCount;
} VkDescriptorPoolSize;

typedef struct VkVertexInputBindingDescription {
    uint32_t               binding;
    uint32_t               stride;
    VkVertexInputRate      inputRate;
} VkVertexInputBindingDescription;

typedef struct VkVertexInputAttributeDescription {
    uint32_t               location;
    uint32_t               binding;
    VkFormat               format;
    uint32_t               offset;
} VkVertexInputAttributeDescription;

typedef struct VkStencilOpState {
    VkStencilOp            failOp;
    VkStencilOp            passOp;
    VkStencilOp            depthFailOp;
    VkCompareOp            compareOp;
    uint32_t               compareMask;
    uint32_t               writeMask;
    uint32_t               reference;
} VkStencilOpState;

typedef struct VkPipelineCacheHeaderVersionOne {
    uint32_t               headerSize;
    VkPipelineCacheHeaderVersion headerVersion;
    uint32_t               vendorID;
    uint32_t               deviceID;
    uint8_t                pipelineCacheUUID[VK_UUID_SIZE];
} VkPipelineCacheHeaderVersionOne;

typedef struct VkClearDepthStencilValue {
    float                  depth;
    uint32_t               stencil;
} VkClearDepthStencilValue;

typedef struct VkAttachmentReference {
    uint32_t               attachment;
    VkImageLayout          layout;
} VkAttachmentReference;

typedef struct VkDrawIndirectCommand {
    uint32_t                       vertexCount;
    uint32_t                       instanceCount;
    uint32_t                       firstVertex;
    uint32_t firstInstance;
} VkDrawIndirectCommand;

typedef struct VkDispatchIndirectCommand {
    uint32_t x;
    uint32_t y;
    uint32_t z;
} VkDispatchIndirectCommand;

typedef uint64_t VkFlags64;

typedef uint64_t VkDeviceSize;

typedef uint64_t VkDeviceAddress;

typedef struct VkDebugUtilsObjectNameInfoEXT {
    VkStructureType sType;
    const void*                                            pNext;
    VkObjectType                                           objectType;
    uint64_t                       objectHandle;
    const char*      pObjectName;
} VkDebugUtilsObjectNameInfoEXT;

typedef struct VkOffset2D {
    int32_t        x;
    int32_t        y;
} VkOffset2D;

typedef struct VkOffset3D {
    int32_t        x;
    int32_t        y;
    int32_t        z;
} VkOffset3D;

typedef union VkClearColorValue {
    float                  float32[4];
    int32_t                int32[4];
    uint32_t               uint32[4];
} VkClearColorValue;

typedef struct VkDrawIndexedIndirectCommand {
    uint32_t                       indexCount;
    uint32_t                       instanceCount;
    uint32_t                       firstIndex;
    int32_t                        vertexOffset;
    uint32_t firstInstance;
} VkDrawIndexedIndirectCommand;

typedef void (VKAPI_PTR *PFN_vkInternalAllocationNotification)(void*                       pUserData, size_t                      size, VkInternalAllocationType    allocationType, VkSystemAllocationScope     allocationScope);

typedef void (VKAPI_PTR *PFN_vkInternalFreeNotification)(void*                       pUserData, size_t                      size, VkInternalAllocationType    allocationType, VkSystemAllocationScope     allocationScope);

typedef void* (VKAPI_PTR *PFN_vkReallocationFunction)(void*                       pUserData, void*                       pOriginal, size_t                      size, size_t                      alignment, VkSystemAllocationScope     allocationScope);

typedef void* (VKAPI_PTR *PFN_vkAllocationFunction)(void*                       pUserData, size_t                      size, size_t                      alignment, VkSystemAllocationScope     allocationScope);

typedef struct VkSpecializationMapEntry {
    uint32_t                     constantID;
    uint32_t                     offset;
    size_t size;
} VkSpecializationMapEntry;

/* #define VK_API_VERSION VK_MAKE_API_VERSION(0, 1, 0, 0) // Patch version should always be set to 0 */

/* Vulkan 1.0 version number */
#define VK_API_VERSION_1_0 VK_MAKE_API_VERSION(0, 1, 0, 0)/* Patch version should always be set to 0 */

/* Vulkan 1.1 version number */
#define VK_API_VERSION_1_1 VK_MAKE_API_VERSION(0, 1, 1, 0)/* Patch version should always be set to 0 */

/* Vulkan 1.2 version number */
#define VK_API_VERSION_1_2 VK_MAKE_API_VERSION(0, 1, 2, 0)/* Patch version should always be set to 0 */

/* Vulkan 1.3 version number */
#define VK_API_VERSION_1_3 VK_MAKE_API_VERSION(0, 1, 3, 0)/* Patch version should always be set to 0 */

/* Vulkan 1.4 version number */
#define VK_API_VERSION_1_4 VK_MAKE_API_VERSION(0, 1, 4, 0)/* Patch version should always be set to 0 */

/* Vulkan SC 1.0 version number */
#define VKSC_API_VERSION_1_0 VK_MAKE_API_VERSION(VKSC_API_VARIANT, 1, 0, 0)/* Patch version should always be set to 0 */

/* Complete version of this file */
#define VK_HEADER_VERSION_COMPLETE VK_MAKE_API_VERSION(0, 1, 4, VK_HEADER_VERSION)

typedef VkFlags VkFramebufferCreateFlags;

typedef VkFlags VkQueryPoolCreateFlags;

typedef VkFlags VkRenderPassCreateFlags;

typedef VkFlags VkSamplerCreateFlags;

typedef VkFlags VkPipelineLayoutCreateFlags;

typedef VkFlags VkPipelineCacheCreateFlags;

typedef VkFlags VkPipelineDepthStencilStateCreateFlags;

typedef VkFlags VkPipelineDynamicStateCreateFlags;

typedef VkFlags VkPipelineColorBlendStateCreateFlags;

typedef VkFlags VkPipelineMultisampleStateCreateFlags;

typedef VkFlags VkPipelineRasterizationStateCreateFlags;

typedef VkFlags VkPipelineViewportStateCreateFlags;

typedef VkFlags VkPipelineTessellationStateCreateFlags;

typedef VkFlags VkPipelineInputAssemblyStateCreateFlags;

typedef VkFlags VkPipelineVertexInputStateCreateFlags;

typedef VkFlags VkPipelineShaderStageCreateFlags;

typedef VkFlags VkDescriptorSetLayoutCreateFlags;

typedef VkFlags VkBufferViewCreateFlags;

typedef VkFlags VkInstanceCreateFlags;

typedef VkFlags VkDeviceCreateFlags;

typedef VkFlags VkDeviceQueueCreateFlags;

typedef VkFlags VkQueueFlags;

typedef VkFlags VkMemoryPropertyFlags;

typedef VkFlags VkMemoryHeapFlags;

typedef VkFlags VkAccessFlags;

typedef VkFlags VkBufferUsageFlags;

typedef VkFlags VkBufferCreateFlags;

typedef VkFlags VkShaderStageFlags;

typedef VkFlags VkImageUsageFlags;

typedef VkFlags VkImageCreateFlags;

typedef VkFlags VkImageViewCreateFlags;

typedef VkFlags VkPipelineCreateFlags;

typedef VkFlags VkColorComponentFlags;

typedef VkFlags VkFenceCreateFlags;

typedef VkFlags VkSemaphoreCreateFlags;

typedef VkFlags VkFormatFeatureFlags;

typedef VkFlags VkQueryControlFlags;

typedef VkFlags VkQueryResultFlags;

typedef VkFlags VkShaderModuleCreateFlags;

typedef VkFlags VkEventCreateFlags;

typedef VkFlags VkCommandPoolCreateFlags;

typedef VkFlags VkCommandPoolResetFlags;

typedef VkFlags VkCommandBufferResetFlags;

typedef VkFlags VkCommandBufferUsageFlags;

typedef VkFlags VkQueryPipelineStatisticFlags;

typedef VkFlags VkMemoryMapFlags;

typedef VkFlags VkMemoryUnmapFlags;

typedef VkFlags VkImageAspectFlags;

typedef VkFlags VkSparseMemoryBindFlags;

typedef VkFlags VkSparseImageFormatFlags;

typedef VkFlags VkSubpassDescriptionFlags;

typedef VkFlags VkPipelineStageFlags;

typedef VkFlags VkSampleCountFlags;

typedef VkFlags VkAttachmentDescriptionFlags;

typedef VkFlags VkStencilFaceFlags;

typedef VkFlags VkCullModeFlags;

typedef VkFlags VkDescriptorPoolCreateFlags;

typedef VkFlags VkDescriptorPoolResetFlags;

typedef VkFlags VkDependencyFlags;

typedef VkFlags VkSubgroupFeatureFlags;

typedef VkFlags VkIndirectCommandsLayoutUsageFlagsNV;

typedef VkFlags VkIndirectStateFlagsNV;

typedef VkFlags VkGeometryFlagsKHR;

typedef VkFlags VkGeometryInstanceFlagsKHR;

typedef VkFlags VkClusterAccelerationStructureGeometryFlagsNV;

typedef VkFlags VkClusterAccelerationStructureClusterFlagsNV;

typedef VkFlags VkClusterAccelerationStructureAddressResolutionFlagsNV;

typedef VkFlags VkBuildAccelerationStructureFlagsKHR;

typedef VkFlags VkPrivateDataSlotCreateFlags;

typedef VkFlags VkAccelerationStructureCreateFlagsKHR;

typedef VkFlags VkDescriptorUpdateTemplateCreateFlags;

typedef VkFlags VkPipelineCreationFeedbackFlags;

typedef VkFlags VkPerformanceCounterDescriptionFlagsKHR;

typedef VkFlags VkAcquireProfilingLockFlagsKHR;

typedef VkFlags VkSemaphoreWaitFlags;

typedef VkFlags VkPipelineCompilerControlFlagsAMD;

typedef VkFlags VkShaderCorePropertiesFlagsAMD;

typedef VkFlags VkDeviceDiagnosticsConfigFlagsNV;

typedef VkFlags VkRefreshObjectFlagsKHR;

typedef VkFlags VkAccelerationStructureMotionInfoFlagsNV;

typedef VkFlags VkAccelerationStructureMotionInstanceFlagsNV;

typedef VkFlags VkRenderingFlags;

typedef VkFlags VkDeviceFaultFlagsKHR;

typedef VkFlags VkBuildMicromapFlagsEXT;

typedef VkFlags VkMicromapCreateFlagsEXT;

typedef VkFlags VkIndirectCommandsLayoutUsageFlagsEXT;

typedef VkFlags VkIndirectCommandsInputModeFlagsEXT;

typedef VkFlags VkDirectDriverLoadingFlagsLUNARG;

typedef VkFlags VkAddressCopyFlagsKHR;

typedef VkFlags VkVideoEncodeRgbModelConversionFlagsVALVE;

typedef VkFlags VkVideoEncodeRgbRangeCompressionFlagsVALVE;

typedef VkFlags VkVideoEncodeRgbChromaOffsetFlagsVALVE;

typedef VkFlags VkSpirvResourceTypeFlagsEXT;

typedef VkFlags VkGpaSqShaderStageFlagsAMD;

typedef VkFlags VkGpaPerfBlockPropertiesFlagsAMD;

typedef VkFlags VkPhysicalDeviceGpaPropertiesFlagsAMD;

typedef VkFlags VkAddressCommandFlagsKHR;

typedef VkFlags VkCompositeAlphaFlagsKHR;

typedef VkFlags VkDisplayPlaneAlphaFlagsKHR;

typedef VkFlags VkSurfaceTransformFlagsKHR;

typedef VkFlags VkSwapchainCreateFlagsKHR;

typedef VkFlags VkDisplayModeCreateFlagsKHR;

typedef VkFlags VkDisplaySurfaceCreateFlagsKHR;

#if defined(VK_USE_PLATFORM_ANDROID_KHR)
typedef VkFlags VkAndroidSurfaceCreateFlagsKHR;
#endif

#if defined(VK_USE_PLATFORM_VI_NN)
typedef VkFlags VkViSurfaceCreateFlagsNN;
#endif

#if defined(VK_USE_PLATFORM_WAYLAND_KHR)
typedef VkFlags VkWaylandSurfaceCreateFlagsKHR;
#endif

#if defined(VK_USE_PLATFORM_UBM_SEC)
typedef VkFlags VkUbmSurfaceCreateFlagsSEC;
#endif

#if defined(VK_USE_PLATFORM_WIN32_KHR)
typedef VkFlags VkWin32SurfaceCreateFlagsKHR;
#endif

#if defined(VK_USE_PLATFORM_XLIB_KHR)
typedef VkFlags VkXlibSurfaceCreateFlagsKHR;
#endif

#if defined(VK_USE_PLATFORM_XCB_KHR)
typedef VkFlags VkXcbSurfaceCreateFlagsKHR;
#endif

#if defined(VK_USE_PLATFORM_DIRECTFB_EXT)
typedef VkFlags VkDirectFBSurfaceCreateFlagsEXT;
#endif

#if defined(VK_USE_PLATFORM_IOS_MVK)
typedef VkFlags VkIOSSurfaceCreateFlagsMVK;
#endif

#if defined(VK_USE_PLATFORM_MACOS_MVK)
typedef VkFlags VkMacOSSurfaceCreateFlagsMVK;
#endif

#if defined(VK_USE_PLATFORM_METAL_EXT)
typedef VkFlags VkMetalSurfaceCreateFlagsEXT;
#endif

#if defined(VK_USE_PLATFORM_FUCHSIA)
typedef VkFlags VkImagePipeSurfaceCreateFlagsFUCHSIA;
#endif

#if defined(VK_USE_PLATFORM_GGP)
typedef VkFlags VkStreamDescriptorSurfaceCreateFlagsGGP;
#endif

typedef VkFlags VkHeadlessSurfaceCreateFlagsEXT;

#if defined(VK_USE_PLATFORM_SCREEN_QNX)
typedef VkFlags VkScreenSurfaceCreateFlagsQNX;
#endif

typedef VkFlags VkPeerMemoryFeatureFlags;

typedef VkFlags VkMemoryAllocateFlags;

typedef VkFlags VkDeviceGroupPresentModeFlagsKHR;

typedef VkFlags VkDebugReportFlagsEXT;

typedef VkFlags VkCommandPoolTrimFlags;

typedef VkFlags VkExternalMemoryHandleTypeFlagsNV;

typedef VkFlags VkClusterAccelerationStructureIndexFormatFlagsNV;

typedef VkFlags VkExternalMemoryFeatureFlagsNV;

typedef VkFlags VkExternalMemoryHandleTypeFlags;

typedef VkFlags VkExternalMemoryFeatureFlags;

typedef VkFlags VkExternalSemaphoreHandleTypeFlags;

typedef VkFlags VkExternalSemaphoreFeatureFlags;

typedef VkFlags VkSemaphoreImportFlags;

typedef VkFlags VkExternalFenceHandleTypeFlags;

typedef VkFlags VkExternalFenceFeatureFlags;

typedef VkFlags VkFenceImportFlags;

typedef VkFlags VkSurfaceCounterFlagsEXT;

typedef VkFlags VkPipelineViewportSwizzleStateCreateFlagsNV;

typedef VkFlags VkPipelineDiscardRectangleStateCreateFlagsEXT;

typedef VkFlags VkPipelineCoverageToColorStateCreateFlagsNV;

typedef VkFlags VkPipelineCoverageModulationStateCreateFlagsNV;

typedef VkFlags VkPipelineCoverageReductionStateCreateFlagsNV;

typedef VkFlags VkValidationCacheCreateFlagsEXT;

typedef VkFlags VkDebugUtilsMessageSeverityFlagsEXT;

typedef VkFlags VkDebugUtilsMessageTypeFlagsEXT;

typedef VkFlags VkDebugUtilsMessengerCreateFlagsEXT;

typedef VkFlags VkDebugUtilsMessengerCallbackDataFlagsEXT;

typedef VkFlags VkDeviceMemoryReportFlagsEXT;

typedef VkFlags VkPipelineRasterizationConservativeStateCreateFlagsEXT;

typedef VkFlags VkDescriptorBindingFlags;

typedef VkFlags VkConditionalRenderingFlagsEXT;

typedef VkFlags VkResolveModeFlags;

typedef VkFlags VkPipelineRasterizationStateStreamCreateFlagsEXT;

typedef VkFlags VkPipelineRasterizationDepthClipStateCreateFlagsEXT;

typedef VkFlags VkSwapchainImageUsageFlagsANDROID;

typedef VkFlags VkToolPurposeFlags;

typedef VkFlags VkSubmitFlags;

#if defined(VK_USE_PLATFORM_FUCHSIA)
typedef VkFlags VkImageFormatConstraintsFlagsFUCHSIA;
#endif

typedef VkFlags VkHostImageCopyFlags;

typedef VkFlags VkPartitionedAccelerationStructureInstanceFlagsNV;

#if defined(VK_USE_PLATFORM_FUCHSIA)
typedef VkFlags VkImageConstraintsInfoFlagsFUCHSIA;
#endif

typedef VkFlags VkGraphicsPipelineLibraryFlagsEXT;

typedef VkFlags VkImageCompressionFlagsEXT;

typedef VkFlags VkImageCompressionFixedRateFlagsEXT;

#if defined(VK_USE_PLATFORM_METAL_EXT)
typedef VkFlags VkExportMetalObjectTypeFlagsEXT;
#endif

typedef VkFlags VkRenderingAttachmentFlagsKHR;

typedef VkFlags VkResolveImageFlagsKHR;

typedef VkFlags VkDeviceAddressBindingFlagsEXT;

typedef VkFlags   VkOpticalFlowGridSizeFlagsNV;

typedef VkFlags   VkOpticalFlowUsageFlagsNV;

typedef VkFlags   VkOpticalFlowSessionCreateFlagsNV;

typedef VkFlags   VkOpticalFlowExecuteFlagsNV;

typedef VkFlags VkFrameBoundaryFlagsEXT;

typedef VkFlags VkPresentScalingFlagsKHR;

typedef VkFlags VkPresentGravityFlagsKHR;

typedef VkFlags VkShaderCreateFlagsEXT;

typedef VkFlags VkTileShadingRenderPassFlagsQCOM;

#if defined(VK_USE_PLATFORM_OHOS)
typedef VkFlags VkSurfaceCreateFlagsOHOS;
#endif

typedef VkFlags VkPresentStageFlagsEXT;

typedef VkFlags VkPastPresentationTimingFlagsEXT;

typedef VkFlags VkPresentTimingInfoFlagsEXT;

typedef VkFlags VkSwapchainImageUsageFlagsOHOS;

typedef VkFlags VkPerformanceCounterDescriptionFlagsARM;

typedef VkFlags VkShaderInstrumentationValuesFlagsARM;

typedef VkFlags   VkDataGraphTOSAQualityFlagsARM;

typedef VkFlags   VkDataGraphOpticalFlowGridSizeFlagsARM;

typedef VkFlags   VkDataGraphOpticalFlowImageUsageFlagsARM;

typedef VkFlags   VkDataGraphOpticalFlowCreateFlagsARM;

typedef VkFlags   VkDataGraphOpticalFlowExecuteFlagsARM;

typedef VkFlags VkVideoCodecOperationFlagsKHR;

typedef VkFlags VkVideoCapabilityFlagsKHR;

typedef VkFlags VkVideoSessionCreateFlagsKHR;

typedef VkFlags VkVideoSessionParametersCreateFlagsKHR;

typedef VkFlags VkVideoBeginCodingFlagsKHR;

typedef VkFlags VkVideoEndCodingFlagsKHR;

typedef VkFlags VkVideoCodingControlFlagsKHR;

typedef VkFlags VkVideoDecodeUsageFlagsKHR;

typedef VkFlags VkVideoDecodeCapabilityFlagsKHR;

typedef VkFlags VkVideoDecodeFlagsKHR;

typedef VkFlags VkVideoDecodeH264PictureLayoutFlagsKHR;

typedef VkFlags VkVideoEncodeFlagsKHR;

typedef VkFlags VkVideoEncodeUsageFlagsKHR;

typedef VkFlags VkVideoEncodeContentFlagsKHR;

typedef VkFlags VkVideoEncodeCapabilityFlagsKHR;

typedef VkFlags VkVideoEncodeFeedbackFlagsKHR;

typedef VkFlags VkVideoEncodePerPartitionFeedbackFlagsKHR;

typedef VkFlags VkVideoEncodeRateControlFlagsKHR;

typedef VkFlags VkVideoEncodeRateControlModeFlagsKHR;

typedef VkFlags VkVideoEncodeIntraRefreshModeFlagsKHR;

typedef VkFlags VkVideoChromaSubsamplingFlagsKHR;

typedef VkFlags VkVideoComponentBitDepthFlagsKHR;

typedef VkFlags VkVideoEncodeH264CapabilityFlagsKHR;

typedef VkFlags VkVideoEncodeH264StdFlagsKHR;

typedef VkFlags VkVideoEncodeH264RateControlFlagsKHR;

typedef VkFlags VkVideoEncodeH265CapabilityFlagsKHR;

typedef VkFlags VkVideoEncodeH265StdFlagsKHR;

typedef VkFlags VkVideoEncodeH265RateControlFlagsKHR;

typedef VkFlags VkVideoEncodeH265CtbSizeFlagsKHR;

typedef VkFlags VkVideoEncodeH265TransformBlockSizeFlagsKHR;

typedef VkFlags VkVideoEncodeAV1CapabilityFlagsKHR;

typedef VkFlags VkVideoEncodeAV1StdFlagsKHR;

typedef VkFlags VkVideoEncodeAV1RateControlFlagsKHR;

typedef VkFlags VkVideoEncodeAV1SuperblockSizeFlagsKHR;

typedef VkFlags64 VkAccessFlags2;

typedef VkFlags64 VkPipelineStageFlags2;

typedef VkFlags64 VkFormatFeatureFlags2;

typedef VkFlags64 VkFormatFeatureFlags4KHR;

typedef VkFlags64 VkMemoryDecompressionMethodFlagsEXT;

typedef VkFlags64 VkPipelineCreateFlags2;

typedef VkFlags64 VkBufferUsageFlags2;

typedef VkFlags64 VkImageUsageFlags2KHR;

typedef VkFlags64 VkImageCreateFlags2KHR;

typedef VkFlags64 VkTensorCreateFlagsARM;

typedef VkFlags64 VkTensorUsageFlagsARM;

typedef VkFlags64 VkTensorViewCreateFlagsARM;

typedef VkFlags64 VkDataGraphPipelineSessionCreateFlagsARM;

typedef VkFlags64 VkDataGraphPipelineDispatchFlagsARM;

typedef VkFlags64 VkPhysicalDeviceSchedulingControlsFlagsARM;

typedef VkFlags64 VkAccessFlags3KHR;

#define VkMemoryUnmapFlagsKHR VkMemoryUnmapFlags

#define VkGeometryFlagsNV VkGeometryFlagsKHR

#define VkGeometryInstanceFlagsNV VkGeometryInstanceFlagsKHR

#define VkBuildAccelerationStructureFlagsNV VkBuildAccelerationStructureFlagsKHR

#define VkPrivateDataSlotCreateFlagsEXT VkPrivateDataSlotCreateFlags

#define VkDescriptorUpdateTemplateCreateFlagsKHR VkDescriptorUpdateTemplateCreateFlags

#define VkPipelineCreationFeedbackFlagsEXT VkPipelineCreationFeedbackFlags

#define VkSemaphoreWaitFlagsKHR VkSemaphoreWaitFlags

#define VkRenderingFlagsKHR VkRenderingFlags

#define VkPeerMemoryFeatureFlagsKHR VkPeerMemoryFeatureFlags

#define VkMemoryAllocateFlagsKHR VkMemoryAllocateFlags

#define VkCommandPoolTrimFlagsKHR VkCommandPoolTrimFlags

#define VkExternalMemoryHandleTypeFlagsKHR VkExternalMemoryHandleTypeFlags

#define VkExternalMemoryFeatureFlagsKHR VkExternalMemoryFeatureFlags

#define VkExternalSemaphoreHandleTypeFlagsKHR VkExternalSemaphoreHandleTypeFlags

#define VkExternalSemaphoreFeatureFlagsKHR VkExternalSemaphoreFeatureFlags

#define VkSemaphoreImportFlagsKHR VkSemaphoreImportFlags

#define VkExternalFenceHandleTypeFlagsKHR VkExternalFenceHandleTypeFlags

#define VkExternalFenceFeatureFlagsKHR VkExternalFenceFeatureFlags

#define VkFenceImportFlagsKHR VkFenceImportFlags

#define VkDescriptorBindingFlagsEXT VkDescriptorBindingFlags

#define VkResolveModeFlagsKHR VkResolveModeFlags

#define VkToolPurposeFlagsEXT VkToolPurposeFlags

#define VkSubmitFlagsKHR VkSubmitFlags

#define VkHostImageCopyFlagsEXT VkHostImageCopyFlags

#define VkPresentScalingFlagsEXT VkPresentScalingFlagsKHR

#define VkPresentGravityFlagsEXT VkPresentGravityFlagsKHR

#define VkAccessFlags2KHR VkAccessFlags2

#define VkPipelineStageFlags2KHR VkPipelineStageFlags2

#define VkFormatFeatureFlags2KHR VkFormatFeatureFlags2

#define VkMemoryDecompressionMethodFlagsNV VkMemoryDecompressionMethodFlagsEXT

#define VkPipelineCreateFlags2KHR VkPipelineCreateFlags2

#define VkBufferUsageFlags2KHR VkBufferUsageFlags2

#ifndef VK_DEFINE_NON_DISPATCHABLE_HANDLE
    #if (VK_USE_64_BIT_PTR_DEFINES==1)
        #if (defined(__cplusplus) && (__cplusplus >= 201103L)) || (defined(_MSVC_LANG) && (_MSVC_LANG >= 201103L))
            #define VK_NULL_HANDLE nullptr
        #else
            #define VK_NULL_HANDLE ((void*)0)
        #endif
    #else
        #define VK_NULL_HANDLE 0ULL
    #endif
#endif
#ifndef VK_NULL_HANDLE
    #define VK_NULL_HANDLE 0
#endif

#ifndef VK_DEFINE_NON_DISPATCHABLE_HANDLE
    #if (VK_USE_64_BIT_PTR_DEFINES==1)
        #define VK_DEFINE_NON_DISPATCHABLE_HANDLE(object) typedef struct object##_T *object;
    #else
        #define VK_DEFINE_NON_DISPATCHABLE_HANDLE(object) typedef uint64_t object;
    #endif
#endif

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDeviceMemory)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkCommandPool)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkBuffer)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkBufferView)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkImage)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkImageView)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkShaderModule)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkPipeline)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkPipelineLayout)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkSampler)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDescriptorSet)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDescriptorSetLayout)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDescriptorPool)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkFence)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkSemaphore)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkEvent)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkQueryPool)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkFramebuffer)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkRenderPass)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkPipelineCache)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkPipelineBinaryKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkIndirectCommandsLayoutNV)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkIndirectCommandsLayoutEXT)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkIndirectExecutionSetEXT)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDescriptorUpdateTemplate)

#define VkDescriptorUpdateTemplateKHR VkDescriptorUpdateTemplate

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkSamplerYcbcrConversion)

#define VkSamplerYcbcrConversionKHR VkSamplerYcbcrConversion

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkValidationCacheEXT)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkAccelerationStructureKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkAccelerationStructureNV)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkPerformanceConfigurationINTEL)

#if defined(VK_USE_PLATFORM_FUCHSIA)
VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkBufferCollectionFUCHSIA)
#endif

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDeferredOperationKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkPrivateDataSlot)

#define VkPrivateDataSlotEXT VkPrivateDataSlot

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkCuModuleNVX)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkCuFunctionNVX)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkOpticalFlowSessionNV)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkMicromapEXT)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkShaderEXT)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkTensorARM)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkTensorViewARM)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDataGraphPipelineSessionARM)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkShaderInstrumentationARM)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkGpaSessionAMD)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDisplayKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDisplayModeKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkSurfaceKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkSwapchainKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDebugReportCallbackEXT)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkDebugUtilsMessengerEXT)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkVideoSessionKHR)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkVideoSessionParametersKHR)

#if defined(VK_USE_PLATFORM_SCI)
VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkSemaphoreSciSyncPoolNV)
#endif

#if defined(VK_ENABLE_BETA_EXTENSIONS)
VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkCudaModuleNV)

VK_DEFINE_NON_DISPATCHABLE_HANDLE(VkCudaFunctionNV)
#endif

typedef PFN_vkVoidFunction (VKAPI_PTR *PFN_vkGetInstanceProcAddrLUNARG)(VkInstance                  instance, const char*                 pName);

typedef void (VKAPI_PTR *PFN_vkFaultCallbackFunction)(VkBool32                    unrecordedFaults, uint32_t                    faultCount, const VkFaultData*          pFaults);

typedef struct VkPhysicalDeviceFeatures {
    VkBool32               robustBufferAccess;
    VkBool32               fullDrawIndexUint32;
    VkBool32               imageCubeArray;
    VkBool32               independentBlend;
    VkBool32               geometryShader;
    VkBool32               tessellationShader;
    VkBool32               sampleRateShading;
    VkBool32               dualSrcBlend;
    VkBool32               logicOp;
    VkBool32               multiDrawIndirect;
    VkBool32               drawIndirectFirstInstance;
    VkBool32               depthClamp;
    VkBool32               depthBiasClamp;
    VkBool32               fillModeNonSolid;
    VkBool32               depthBounds;
    VkBool32               wideLines;
    VkBool32               largePoints;
    VkBool32               alphaToOne;
    VkBool32               multiViewport;
    VkBool32               samplerAnisotropy;
    VkBool32               textureCompressionETC2;
    VkBool32               textureCompressionASTC_LDR;
    VkBool32               textureCompressionBC;
    VkBool32               occlusionQueryPrecise;
    VkBool32               pipelineStatisticsQuery;
    VkBool32               vertexPipelineStoresAndAtomics;
    VkBool32               fragmentStoresAndAtomics;
    VkBool32               shaderTessellationAndGeometryPointSize;
    VkBool32               shaderImageGatherExtended;
    VkBool32               shaderStorageImageExtendedFormats;
    VkBool32               shaderStorageImageMultisample;
    VkBool32               shaderStorageImageReadWithoutFormat;
    VkBool32               shaderStorageImageWriteWithoutFormat;
    VkBool32               shaderUniformBufferArrayDynamicIndexing;
    VkBool32               shaderSampledImageArrayDynamicIndexing;
    VkBool32               shaderStorageBufferArrayDynamicIndexing;
    VkBool32               shaderStorageImageArrayDynamicIndexing;
    VkBool32               shaderClipDistance;
    VkBool32               shaderCullDistance;
    VkBool32               shaderFloat64;
    VkBool32               shaderInt64;
    VkBool32               shaderInt16;
    VkBool32               shaderResourceResidency;
    VkBool32               shaderResourceMinLod;
    VkBool32               sparseBinding;
    VkBool32               sparseResidencyBuffer;
    VkBool32               sparseResidencyImage2D;
    VkBool32               sparseResidencyImage3D;
    VkBool32               sparseResidency2Samples;
    VkBool32               sparseResidency4Samples;
    VkBool32               sparseResidency8Samples;
    VkBool32               sparseResidency16Samples;
    VkBool32               sparseResidencyAliased;
    VkBool32               variableMultisampleRate;
    VkBool32               inheritedQueries;
} VkPhysicalDeviceFeatures;

typedef struct VkPhysicalDeviceSparseProperties {
    VkBool32             residencyStandard2DBlockShape;
    VkBool32             residencyStandard2DMultisampleBlockShape;
    VkBool32             residencyStandard3DBlockShape;
    VkBool32             residencyAlignedMipSize;
    VkBool32             residencyNonResidentStrict;
} VkPhysicalDeviceSparseProperties;

typedef struct VkMemoryAllocateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkDeviceSize           allocationSize;
    uint32_t               memoryTypeIndex;
} VkMemoryAllocateInfo;

typedef struct VkMemoryRequirements {
    VkDeviceSize           size;
    VkDeviceSize           alignment;
    uint32_t               memoryTypeBits;
} VkMemoryRequirements;

typedef struct VkSubresourceLayout {
    VkDeviceSize           offset;
    VkDeviceSize           size;
    VkDeviceSize           rowPitch;
    VkDeviceSize           arrayPitch;
    VkDeviceSize           depthPitch;
} VkSubresourceLayout;

typedef struct VkBufferCopy {
    VkDeviceSize                       srcOffset;
    VkDeviceSize                       dstOffset;
    VkDeviceSize size;
} VkBufferCopy;

typedef struct VkRect2D {
    VkOffset2D     offset;
    VkExtent2D     extent;
} VkRect2D;

typedef union VkClearValue {
    VkClearColorValue      color;
    VkClearDepthStencilValue depthStencil;
} VkClearValue;

typedef struct VkAllocationCallbacks {
    void*           pUserData;
    PFN_vkAllocationFunction   pfnAllocation;
    PFN_vkReallocationFunction pfnReallocation;
    PFN_vkFreeFunction    pfnFree;
    PFN_vkInternalAllocationNotification pfnInternalAllocation;
    PFN_vkInternalFreeNotification pfnInternalFree;
} VkAllocationCallbacks;

typedef struct VkSpecializationInfo {
    uint32_t               mapEntryCount;
    const VkSpecializationMapEntry* pMapEntries;
    size_t                 dataSize;
    const void*            pData;
} VkSpecializationInfo;

typedef struct VkSamplerCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkSamplerCreateFlags   flags;
    VkFilter               magFilter;
    VkFilter               minFilter;
    VkSamplerMipmapMode    mipmapMode;
    VkSamplerAddressMode   addressModeU;
    VkSamplerAddressMode   addressModeV;
    VkSamplerAddressMode   addressModeW;
    float                  mipLodBias;
    VkBool32               anisotropyEnable;
    float                  maxAnisotropy;
    VkBool32               compareEnable;
    VkCompareOp            compareOp;
    float                  minLod;
    float                  maxLod;
    VkBorderColor          borderColor;
    VkBool32               unnormalizedCoordinates;
} VkSamplerCreateInfo;

typedef struct VkPipelineCacheCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineCacheCreateFlags    flags;
    size_t           initialDataSize;
    const void*            pInitialData;
} VkPipelineCacheCreateInfo;

typedef struct VkPipelineDepthStencilStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineDepthStencilStateCreateFlags    flags;
    VkBool32               depthTestEnable;
    VkBool32               depthWriteEnable;
    VkCompareOp            depthCompareOp;
    VkBool32               depthBoundsTestEnable;
    VkBool32               stencilTestEnable;
    VkStencilOpState       front;
    VkStencilOpState       back;
    float                  minDepthBounds;
    float                  maxDepthBounds;
} VkPipelineDepthStencilStateCreateInfo;

typedef struct VkPipelineDynamicStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineDynamicStateCreateFlags    flags;
    uint32_t               dynamicStateCount;
    const VkDynamicState*  pDynamicStates;
} VkPipelineDynamicStateCreateInfo;

typedef struct VkPipelineMultisampleStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineMultisampleStateCreateFlags    flags;
    VkSampleCountFlagBits  rasterizationSamples;
    VkBool32               sampleShadingEnable;
    float                  minSampleShading;
    const VkSampleMask*    pSampleMask;
    VkBool32               alphaToCoverageEnable;
    VkBool32               alphaToOneEnable;
} VkPipelineMultisampleStateCreateInfo;

typedef struct VkPipelineTessellationStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineTessellationStateCreateFlags    flags;
    uint32_t               patchControlPoints;
} VkPipelineTessellationStateCreateInfo;

typedef struct VkPipelineInputAssemblyStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineInputAssemblyStateCreateFlags    flags;
    VkPrimitiveTopology    topology;
    VkBool32               primitiveRestartEnable;
} VkPipelineInputAssemblyStateCreateInfo;

typedef struct VkPipelineVertexInputStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineVertexInputStateCreateFlags    flags;
    uint32_t               vertexBindingDescriptionCount;
    const VkVertexInputBindingDescription* pVertexBindingDescriptions;
    uint32_t               vertexAttributeDescriptionCount;
    const VkVertexInputAttributeDescription* pVertexAttributeDescriptions;
} VkPipelineVertexInputStateCreateInfo;

typedef struct VkInstanceCreateInfo {
    VkStructureType sType;
    const void*     pNext;
    VkInstanceCreateFlags  flags;
    const VkApplicationInfo* pApplicationInfo;
    uint32_t               enabledLayerCount;
    const char* const*      ppEnabledLayerNames;
    uint32_t               enabledExtensionCount;
    const char* const*      ppEnabledExtensionNames;
} VkInstanceCreateInfo;

typedef struct VkDeviceQueueCreateInfo {
    VkStructureType sType;
    const void*     pNext;
    VkDeviceQueueCreateFlags    flags;
    uint32_t        queueFamilyIndex;
    uint32_t        queueCount;
    const float*    pQueuePriorities;
} VkDeviceQueueCreateInfo;

typedef struct VkQueueFamilyProperties {
    VkQueueFlags           queueFlags;
    uint32_t               queueCount;
    uint32_t               timestampValidBits;
    VkExtent3D             minImageTransferGranularity;
} VkQueueFamilyProperties;

typedef struct VkMemoryType {
    VkMemoryPropertyFlags  propertyFlags;
    uint32_t               heapIndex;
} VkMemoryType;

typedef struct VkMemoryHeap {
    VkDeviceSize           size;
    VkMemoryHeapFlags      flags;
} VkMemoryHeap;

typedef struct VkMemoryBarrier {
    VkStructureType sType;
    const void*            pNext;
    VkAccessFlags          srcAccessMask;
    VkAccessFlags          dstAccessMask;
} VkMemoryBarrier;

typedef struct VkBufferCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkBufferCreateFlags    flags;
    VkDeviceSize           size;
    VkBufferUsageFlags usage;
    VkSharingMode          sharingMode;
    uint32_t               queueFamilyIndexCount;
    const uint32_t*        pQueueFamilyIndices;
} VkBufferCreateInfo;

typedef struct VkPushConstantRange {
    VkShaderStageFlags     stageFlags;
    uint32_t               offset;
    uint32_t               size;
} VkPushConstantRange;

typedef struct VkImageCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkImageCreateFlags flags;
    VkImageType            imageType;
    VkFormat               format;
    VkExtent3D             extent;
    uint32_t               mipLevels;
    uint32_t               arrayLayers;
    VkSampleCountFlagBits  samples;
    VkImageTiling          tiling;
    VkImageUsageFlags usage;
    VkSharingMode          sharingMode;
    uint32_t               queueFamilyIndexCount;
    const uint32_t*        pQueueFamilyIndices;
    VkImageLayout          initialLayout;
} VkImageCreateInfo;

typedef struct VkPipelineColorBlendAttachmentState {
    VkBool32               blendEnable;
    VkBlendFactor          srcColorBlendFactor;
    VkBlendFactor          dstColorBlendFactor;
    VkBlendOp              colorBlendOp;
    VkBlendFactor          srcAlphaBlendFactor;
    VkBlendFactor          dstAlphaBlendFactor;
    VkBlendOp              alphaBlendOp;
    VkColorComponentFlags  colorWriteMask;
} VkPipelineColorBlendAttachmentState;

typedef struct VkFenceCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkFenceCreateFlags     flags;
} VkFenceCreateInfo;

typedef struct VkSemaphoreCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkSemaphoreCreateFlags flags;
} VkSemaphoreCreateInfo;

typedef struct VkFormatProperties {
    VkFormatFeatureFlags   linearTilingFeatures;
    VkFormatFeatureFlags   optimalTilingFeatures;
    VkFormatFeatureFlags   bufferFeatures;
} VkFormatProperties;

typedef struct VkShaderModuleCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkShaderModuleCreateFlags flags;
    size_t                 codeSize;
    const uint32_t*            pCode;
} VkShaderModuleCreateInfo;

typedef struct VkEventCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkEventCreateFlags     flags;
} VkEventCreateInfo;

typedef struct VkCommandPoolCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkCommandPoolCreateFlags   flags;
    uint32_t               queueFamilyIndex;
} VkCommandPoolCreateInfo;

typedef struct VkQueryPoolCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkQueryPoolCreateFlags flags;
    VkQueryType            queryType;
    uint32_t               queryCount;
    VkQueryPipelineStatisticFlags pipelineStatistics;
} VkQueryPoolCreateInfo;

typedef struct VkImageSubresource {
    VkImageAspectFlags     aspectMask;
    uint32_t               mipLevel;
    uint32_t               arrayLayer;
} VkImageSubresource;

typedef struct VkImageSubresourceLayers {
    VkImageAspectFlags     aspectMask;
    uint32_t               mipLevel;
    uint32_t               baseArrayLayer;
    uint32_t               layerCount;
} VkImageSubresourceLayers;

typedef struct VkImageSubresourceRange {
    VkImageAspectFlags     aspectMask;
    uint32_t               baseMipLevel;
    uint32_t               levelCount;
    uint32_t               baseArrayLayer;
    uint32_t               layerCount;
} VkImageSubresourceRange;

typedef struct VkSparseImageFormatProperties {
    VkImageAspectFlags       aspectMask;
    VkExtent3D                                imageGranularity;
    VkSparseImageFormatFlags flags;
} VkSparseImageFormatProperties;

typedef struct VkSubpassDescription {
    VkSubpassDescriptionFlags flags;
    VkPipelineBindPoint    pipelineBindPoint;
    uint32_t               inputAttachmentCount;
    const VkAttachmentReference* pInputAttachments;
    uint32_t               colorAttachmentCount;
    const VkAttachmentReference* pColorAttachments;
    const VkAttachmentReference* pResolveAttachments;
    const VkAttachmentReference* pDepthStencilAttachment;
    uint32_t               preserveAttachmentCount;
    const uint32_t* pPreserveAttachments;
} VkSubpassDescription;

typedef struct VkImageFormatProperties {
    VkExtent3D             maxExtent;
    uint32_t               maxMipLevels;
    uint32_t               maxArrayLayers;
    VkSampleCountFlags     sampleCounts;
    VkDeviceSize           maxResourceSize;
} VkImageFormatProperties;

typedef struct VkPhysicalDeviceLimits {
    uint32_t               maxImageDimension1D;
    uint32_t               maxImageDimension2D;
    uint32_t               maxImageDimension3D;
    uint32_t               maxImageDimensionCube;
    uint32_t               maxImageArrayLayers;
    uint32_t               maxTexelBufferElements;
    uint32_t               maxUniformBufferRange;
    uint32_t               maxStorageBufferRange;
    uint32_t               maxPushConstantsSize;
    uint32_t               maxMemoryAllocationCount;
    uint32_t               maxSamplerAllocationCount;
    VkDeviceSize           bufferImageGranularity;
    VkDeviceSize           sparseAddressSpaceSize;
    uint32_t               maxBoundDescriptorSets;
    uint32_t               maxPerStageDescriptorSamplers;
    uint32_t               maxPerStageDescriptorUniformBuffers;
    uint32_t               maxPerStageDescriptorStorageBuffers;
    uint32_t               maxPerStageDescriptorSampledImages;
    uint32_t               maxPerStageDescriptorStorageImages;
    uint32_t               maxPerStageDescriptorInputAttachments;
    uint32_t               maxPerStageResources;
    uint32_t               maxDescriptorSetSamplers;
    uint32_t               maxDescriptorSetUniformBuffers;
    uint32_t               maxDescriptorSetUniformBuffersDynamic;
    uint32_t               maxDescriptorSetStorageBuffers;
    uint32_t               maxDescriptorSetStorageBuffersDynamic;
    uint32_t               maxDescriptorSetSampledImages;
    uint32_t               maxDescriptorSetStorageImages;
    uint32_t               maxDescriptorSetInputAttachments;
    uint32_t               maxVertexInputAttributes;
    uint32_t               maxVertexInputBindings;
    uint32_t               maxVertexInputAttributeOffset;
    uint32_t               maxVertexInputBindingStride;
    uint32_t               maxVertexOutputComponents;
    uint32_t               maxTessellationGenerationLevel;
    uint32_t               maxTessellationPatchSize;
    uint32_t               maxTessellationControlPerVertexInputComponents;
    uint32_t               maxTessellationControlPerVertexOutputComponents;
    uint32_t               maxTessellationControlPerPatchOutputComponents;
    uint32_t               maxTessellationControlTotalOutputComponents;
    uint32_t               maxTessellationEvaluationInputComponents;
    uint32_t               maxTessellationEvaluationOutputComponents;
    uint32_t               maxGeometryShaderInvocations;
    uint32_t               maxGeometryInputComponents;
    uint32_t               maxGeometryOutputComponents;
    uint32_t               maxGeometryOutputVertices;
    uint32_t               maxGeometryTotalOutputComponents;
    uint32_t               maxFragmentInputComponents;
    uint32_t               maxFragmentOutputAttachments;
    uint32_t               maxFragmentDualSrcAttachments;
    uint32_t               maxFragmentCombinedOutputResources;
    uint32_t               maxComputeSharedMemorySize;
    uint32_t               maxComputeWorkGroupCount[3];
    uint32_t               maxComputeWorkGroupInvocations;
    uint32_t               maxComputeWorkGroupSize[3];
    uint32_t              subPixelPrecisionBits;
    uint32_t              subTexelPrecisionBits;
    uint32_t              mipmapPrecisionBits;
    uint32_t               maxDrawIndexedIndexValue;
    uint32_t               maxDrawIndirectCount;
    float                  maxSamplerLodBias;
    float                  maxSamplerAnisotropy;
    uint32_t               maxViewports;
    uint32_t               maxViewportDimensions[2];
    float                viewportBoundsRange[2];
    uint32_t              viewportSubPixelBits;
    size_t             minMemoryMapAlignment;
    VkDeviceSize       minTexelBufferOffsetAlignment;
    VkDeviceSize       minUniformBufferOffsetAlignment;
    VkDeviceSize       minStorageBufferOffsetAlignment;
    int32_t                minTexelOffset;
    uint32_t               maxTexelOffset;
    int32_t                minTexelGatherOffset;
    uint32_t               maxTexelGatherOffset;
    float                  minInterpolationOffset;
    float                  maxInterpolationOffset;
    uint32_t              subPixelInterpolationOffsetBits;
    uint32_t               maxFramebufferWidth;
    uint32_t               maxFramebufferHeight;
    uint32_t               maxFramebufferLayers;
    VkSampleCountFlags     framebufferColorSampleCounts;
    VkSampleCountFlags     framebufferDepthSampleCounts;
    VkSampleCountFlags     framebufferStencilSampleCounts;
    VkSampleCountFlags     framebufferNoAttachmentsSampleCounts;
    uint32_t               maxColorAttachments;
    VkSampleCountFlags     sampledImageColorSampleCounts;
    VkSampleCountFlags     sampledImageIntegerSampleCounts;
    VkSampleCountFlags     sampledImageDepthSampleCounts;
    VkSampleCountFlags     sampledImageStencilSampleCounts;
    VkSampleCountFlags     storageImageSampleCounts;
    uint32_t               maxSampleMaskWords;
    VkBool32               timestampComputeAndGraphics;
    float              timestampPeriod;
    uint32_t               maxClipDistances;
    uint32_t               maxCullDistances;
    uint32_t               maxCombinedClipAndCullDistances;
    uint32_t               discreteQueuePriorities;
    float                pointSizeRange[2];
    float                lineWidthRange[2];
    float              pointSizeGranularity;
    float              lineWidthGranularity;
    VkBool32               strictLines;
    VkBool32               standardSampleLocations;
    VkDeviceSize       optimalBufferCopyOffsetAlignment;
    VkDeviceSize       optimalBufferCopyRowPitchAlignment;
    VkDeviceSize       nonCoherentAtomSize;
} VkPhysicalDeviceLimits;

typedef struct VkAttachmentDescription {
    VkAttachmentDescriptionFlags flags;
    VkFormat               format;
    VkSampleCountFlagBits  samples;
    VkAttachmentLoadOp     loadOp;
    VkAttachmentStoreOp    storeOp;
    VkAttachmentLoadOp     stencilLoadOp;
    VkAttachmentStoreOp    stencilStoreOp;
    VkImageLayout          initialLayout;
    VkImageLayout          finalLayout;
} VkAttachmentDescription;

typedef struct VkPipelineRasterizationStateCreateInfo {
    VkStructureType sType;
    const void* pNext;
    VkPipelineRasterizationStateCreateFlags    flags;
    VkBool32               depthClampEnable;
    VkBool32               rasterizerDiscardEnable;
    VkPolygonMode          polygonMode;
    VkCullModeFlags        cullMode;
    VkFrontFace            frontFace;
    VkBool32               depthBiasEnable;
    float                  depthBiasConstantFactor;
    float                  depthBiasClamp;
    float                  depthBiasSlopeFactor;
    float                  lineWidth;
} VkPipelineRasterizationStateCreateInfo;

typedef struct VkDescriptorPoolCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkDescriptorPoolCreateFlags  flags;
    uint32_t               maxSets;
    uint32_t               poolSizeCount;
    const VkDescriptorPoolSize* pPoolSizes;
} VkDescriptorPoolCreateInfo;

typedef struct VkSubpassDependency {
    uint32_t               srcSubpass;
    uint32_t               dstSubpass;
    VkPipelineStageFlags   srcStageMask;
    VkPipelineStageFlags   dstStageMask;
    VkAccessFlags          srcAccessMask;
    VkAccessFlags          dstAccessMask;
    VkDependencyFlags      dependencyFlags;
} VkSubpassDependency;

typedef VkBool32 (VKAPI_PTR *PFN_vkDebugReportCallbackEXT)(VkDebugReportFlagsEXT       flags, VkDebugReportObjectTypeEXT  objectType, uint64_t                    object, size_t                      location, int32_t                     messageCode, const char*                 pLayerPrefix, const char*                 pMessage, void*                       pUserData);

typedef struct VkDebugUtilsMessengerCallbackDataEXT {
    VkStructureType sType;
    const void*                                                        pNext;
    VkDebugUtilsMessengerCallbackDataFlagsEXT                          flags;
    const char*                                  pMessageIdName;
    int32_t                                                            messageIdNumber;
    const char*                                  pMessage;
    uint32_t                                                           queueLabelCount;
    const VkDebugUtilsLabelEXT*                  pQueueLabels;
    uint32_t                                                           cmdBufLabelCount;
    const VkDebugUtilsLabelEXT*                 pCmdBufLabels;
    uint32_t                                                           objectCount;
    const VkDebugUtilsObjectNameInfoEXT*             pObjects;
} VkDebugUtilsMessengerCallbackDataEXT;

typedef struct VkDeviceMemoryReportCallbackDataEXT {
    VkStructureType sType;
    void*            pNext;
    VkDeviceMemoryReportFlagsEXT     flags;
    VkDeviceMemoryReportEventTypeEXT type;
    uint64_t                         memoryObjectId;
    VkDeviceSize                     size;
    VkObjectType                     objectType;
    uint64_t objectHandle;
    uint32_t                         heapIndex;
} VkDeviceMemoryReportCallbackDataEXT;

typedef struct VkMappedMemoryRange {
    VkStructureType sType;
    const void*            pNext;
    VkDeviceMemory         memory;
    VkDeviceSize           offset;
    VkDeviceSize           size;
} VkMappedMemoryRange;

typedef struct VkSparseMemoryBind {
    VkDeviceSize           resourceOffset;
    VkDeviceSize           size;
    VkDeviceMemory         memory;
    VkDeviceSize           memoryOffset;
    VkSparseMemoryBindFlags flags;
} VkSparseMemoryBind;

typedef struct VkCommandBufferAllocateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkCommandPool          commandPool;
    VkCommandBufferLevel   level;
    uint32_t               commandBufferCount;
} VkCommandBufferAllocateInfo;

typedef struct VkDescriptorBufferInfo {
    VkBuffer               buffer;
    VkDeviceSize           offset;
    VkDeviceSize           range;
} VkDescriptorBufferInfo;

typedef struct VkBufferViewCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkBufferViewCreateFlags flags;
    VkBuffer               buffer;
    VkFormat               format;
    VkDeviceSize           offset;
    VkDeviceSize           range;
} VkBufferViewCreateInfo;

typedef struct VkBufferMemoryBarrier {
    VkStructureType sType;
    const void*            pNext;
    VkAccessFlags          srcAccessMask;
    VkAccessFlags          dstAccessMask;
    uint32_t               srcQueueFamilyIndex;
    uint32_t               dstQueueFamilyIndex;
    VkBuffer               buffer;
    VkDeviceSize           offset;
    VkDeviceSize           size;
} VkBufferMemoryBarrier;

typedef struct VkDescriptorImageInfo {
    VkSampler       sampler;
    VkImageView     imageView;
    VkImageLayout   imageLayout;
} VkDescriptorImageInfo;

typedef struct VkDescriptorSetLayoutBinding {
    uint32_t               binding;
    VkDescriptorType       descriptorType;
    uint32_t descriptorCount;
    VkShaderStageFlags     stageFlags;
    const VkSampler*       pImmutableSamplers;
} VkDescriptorSetLayoutBinding;

typedef struct VkCopyDescriptorSet {
    VkStructureType sType;
    const void*            pNext;
    VkDescriptorSet        srcSet;
    uint32_t               srcBinding;
    uint32_t               srcArrayElement;
    VkDescriptorSet        dstSet;
    uint32_t               dstBinding;
    uint32_t               dstArrayElement;
    uint32_t               descriptorCount;
} VkCopyDescriptorSet;

typedef struct VkDescriptorSetAllocateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkDescriptorPool       descriptorPool;
    uint32_t               descriptorSetCount;
    const VkDescriptorSetLayout* pSetLayouts;
} VkDescriptorSetAllocateInfo;

typedef struct VkSubmitInfo {
    VkStructureType sType;
    const void* pNext;
    uint32_t       waitSemaphoreCount;
    const VkSemaphore*     pWaitSemaphores;
    const VkPipelineStageFlags*           pWaitDstStageMask;
    uint32_t       commandBufferCount;
    const VkCommandBuffer*     pCommandBuffers;
    uint32_t       signalSemaphoreCount;
    const VkSemaphore*     pSignalSemaphores;
} VkSubmitInfo;

typedef struct VkCommandBufferInheritanceInfo {
    VkStructureType sType;
    const void*            pNext;
    VkRenderPass    renderPass;
    uint32_t               subpass;
    VkFramebuffer   framebuffer;
    VkBool32               occlusionQueryEnable;
    VkQueryControlFlags    queryFlags;
    VkQueryPipelineStatisticFlags pipelineStatistics;
} VkCommandBufferInheritanceInfo;

typedef struct VkFramebufferCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkFramebufferCreateFlags    flags;
    VkRenderPass                           renderPass;
    uint32_t               attachmentCount;
    const VkImageView*     pAttachments;
    uint32_t               width;
    uint32_t               height;
    uint32_t               layers;
} VkFramebufferCreateInfo;

typedef struct VkClearRect {
    VkRect2D       rect;
    uint32_t       baseArrayLayer;
    uint32_t       layerCount;
} VkClearRect;

typedef struct VkPipelineViewportStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineViewportStateCreateFlags    flags;
    uint32_t               viewportCount;
    const VkViewport*      pViewports;
    uint32_t               scissorCount;
    const VkRect2D*        pScissors;
} VkPipelineViewportStateCreateInfo;

typedef struct VkClearAttachment {
    VkImageAspectFlags     aspectMask;
    uint32_t               colorAttachment;
    VkClearValue           clearValue;
} VkClearAttachment;

typedef struct VkRenderPassBeginInfo {
    VkStructureType sType;
    const void*            pNext;
    VkRenderPass           renderPass;
    VkFramebuffer          framebuffer;
    VkRect2D               renderArea;
    uint32_t               clearValueCount;
    const VkClearValue*    pClearValues;
} VkRenderPassBeginInfo;

typedef struct VkPipelineShaderStageCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineShaderStageCreateFlags    flags;
    VkShaderStageFlagBits  stage;
    VkShaderModule module;
    const char* pName;
    const VkSpecializationInfo* pSpecializationInfo;
} VkPipelineShaderStageCreateInfo;

typedef struct VkDeviceCreateInfo {
    VkStructureType sType;
    const void*     pNext;
    VkDeviceCreateFlags    flags;
    uint32_t        queueCreateInfoCount;
    const VkDeviceQueueCreateInfo* pQueueCreateInfos;
    uint32_t               enabledLayerCount;
    const char* const*      ppEnabledLayerNames;
    uint32_t               enabledExtensionCount;
    const char* const*      ppEnabledExtensionNames;
    const VkPhysicalDeviceFeatures* pEnabledFeatures;
} VkDeviceCreateInfo;

typedef struct VkPhysicalDeviceMemoryProperties {
    uint32_t                                     memoryTypeCount;
    VkMemoryType           memoryTypes[VK_MAX_MEMORY_TYPES];
    uint32_t                                     memoryHeapCount;
    VkMemoryHeap           memoryHeaps[VK_MAX_MEMORY_HEAPS];
} VkPhysicalDeviceMemoryProperties;

typedef struct VkPipelineLayoutCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineLayoutCreateFlags    flags;
    uint32_t               setLayoutCount;
    const VkDescriptorSetLayout* pSetLayouts;
    uint32_t               pushConstantRangeCount;
    const VkPushConstantRange* pPushConstantRanges;
} VkPipelineLayoutCreateInfo;

typedef struct VkPipelineColorBlendStateCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineColorBlendStateCreateFlags    flags;
    VkBool32               logicOpEnable;
    VkLogicOp              logicOp;
    uint32_t               attachmentCount;
    const VkPipelineColorBlendAttachmentState* pAttachments;
    float                  blendConstants[4];
} VkPipelineColorBlendStateCreateInfo;

typedef struct VkSparseImageMemoryBind {
    VkImageSubresource     subresource;
    VkOffset3D             offset;
    VkExtent3D             extent;
    VkDeviceMemory         memory;
    VkDeviceSize           memoryOffset;
    VkSparseMemoryBindFlags flags;
} VkSparseImageMemoryBind;

typedef struct VkImageCopy {
    VkImageSubresourceLayers srcSubresource;
    VkOffset3D             srcOffset;
    VkImageSubresourceLayers dstSubresource;
    VkOffset3D             dstOffset;
    VkExtent3D             extent;
} VkImageCopy;

typedef struct VkImageBlit {
    VkImageSubresourceLayers srcSubresource;
    VkOffset3D             srcOffsets[2];
    VkImageSubresourceLayers dstSubresource;
    VkOffset3D             dstOffsets[2];
} VkImageBlit;

typedef struct VkBufferImageCopy {
    VkDeviceSize           bufferOffset;
    uint32_t               bufferRowLength;
    uint32_t               bufferImageHeight;
    VkImageSubresourceLayers imageSubresource;
    VkOffset3D             imageOffset;
    VkExtent3D             imageExtent;
} VkBufferImageCopy;

typedef struct VkImageResolve {
    VkImageSubresourceLayers srcSubresource;
    VkOffset3D             srcOffset;
    VkImageSubresourceLayers dstSubresource;
    VkOffset3D             dstOffset;
    VkExtent3D             extent;
} VkImageResolve;

typedef struct VkImageMemoryBarrier {
    VkStructureType sType;
    const void*            pNext;
    VkAccessFlags          srcAccessMask;
    VkAccessFlags          dstAccessMask;
    VkImageLayout          oldLayout;
    VkImageLayout          newLayout;
    uint32_t               srcQueueFamilyIndex;
    uint32_t               dstQueueFamilyIndex;
    VkImage                image;
    VkImageSubresourceRange subresourceRange;
} VkImageMemoryBarrier;

typedef struct VkImageViewCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkImageViewCreateFlags flags;
    VkImage                image;
    VkImageViewType        viewType;
    VkFormat               format;
    VkComponentMapping     components;
    VkImageSubresourceRange subresourceRange;
} VkImageViewCreateInfo;

typedef struct VkSparseImageMemoryRequirements {
    VkSparseImageFormatProperties formatProperties;
    uint32_t               imageMipTailFirstLod;
    VkDeviceSize           imageMipTailSize;
    VkDeviceSize           imageMipTailOffset;
    VkDeviceSize           imageMipTailStride;
} VkSparseImageMemoryRequirements;

typedef struct VkPhysicalDeviceProperties {
    uint32_t       apiVersion;
    uint32_t       driverVersion;
    uint32_t       vendorID;
    uint32_t       deviceID;
    VkPhysicalDeviceType deviceType;
    char           deviceName[VK_MAX_PHYSICAL_DEVICE_NAME_SIZE];
    uint8_t        pipelineCacheUUID[VK_UUID_SIZE];
    VkPhysicalDeviceLimits limits;
    VkPhysicalDeviceSparseProperties sparseProperties;
} VkPhysicalDeviceProperties;

typedef struct VkRenderPassCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkRenderPassCreateFlags flags;
    uint32_t   attachmentCount;
    const VkAttachmentDescription* pAttachments;
    uint32_t               subpassCount;
    const VkSubpassDescription* pSubpasses;
    uint32_t       dependencyCount;
    const VkSubpassDependency* pDependencies;
} VkRenderPassCreateInfo;

typedef VkBool32 (VKAPI_PTR *PFN_vkDebugUtilsMessengerCallbackEXT)(VkDebugUtilsMessageSeverityFlagBitsEXT      messageSeverity, VkDebugUtilsMessageTypeFlagsEXT             messageTypes, const VkDebugUtilsMessengerCallbackDataEXT* pCallbackData, void*                                       pUserData);

typedef void (VKAPI_PTR *PFN_vkDeviceMemoryReportCallbackEXT)(const VkDeviceMemoryReportCallbackDataEXT*  pCallbackData, void*                                       pUserData);

typedef struct VkSparseBufferMemoryBindInfo {
    VkBuffer buffer;
    uint32_t               bindCount;
    const VkSparseMemoryBind* pBinds;
} VkSparseBufferMemoryBindInfo;

typedef struct VkSparseImageOpaqueMemoryBindInfo {
    VkImage image;
    uint32_t               bindCount;
    const VkSparseMemoryBind* pBinds;
} VkSparseImageOpaqueMemoryBindInfo;

typedef struct VkWriteDescriptorSet {
    VkStructureType sType;
    const void*            pNext;
    VkDescriptorSet        dstSet;
    uint32_t               dstBinding;
    uint32_t               dstArrayElement;
    uint32_t               descriptorCount;
    VkDescriptorType       descriptorType;
    const VkDescriptorImageInfo* pImageInfo;
    const VkDescriptorBufferInfo* pBufferInfo;
    const VkBufferView*    pTexelBufferView;
} VkWriteDescriptorSet;

typedef struct VkDescriptorSetLayoutCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkDescriptorSetLayoutCreateFlags    flags;
    uint32_t               bindingCount;
    const VkDescriptorSetLayoutBinding* pBindings;
} VkDescriptorSetLayoutCreateInfo;

typedef struct VkCommandBufferBeginInfo {
    VkStructureType sType;
    const void*            pNext;
    VkCommandBufferUsageFlags  flags;
    const VkCommandBufferInheritanceInfo*       pInheritanceInfo;
} VkCommandBufferBeginInfo;

typedef struct VkComputePipelineCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineCreateFlags flags;
    VkPipelineShaderStageCreateInfo stage;
    VkPipelineLayout       layout;
    VkPipeline      basePipelineHandle;
    int32_t                basePipelineIndex;
} VkComputePipelineCreateInfo;

typedef struct VkGraphicsPipelineCreateInfo {
    VkStructureType sType;
    const void*            pNext;
    VkPipelineCreateFlags flags;
    uint32_t stageCount;
    const VkPipelineShaderStageCreateInfo* pStages;
    const VkPipelineVertexInputStateCreateInfo* pVertexInputState;
    const VkPipelineInputAssemblyStateCreateInfo* pInputAssemblyState;
    const VkPipelineTessellationStateCreateInfo* pTessellationState;
    const VkPipelineViewportStateCreateInfo* pViewportState;
    const VkPipelineRasterizationStateCreateInfo* pRasterizationState;
    const VkPipelineMultisampleStateCreateInfo* pMultisampleState;
    const VkPipelineDepthStencilStateCreateInfo* pDepthStencilState;
    const VkPipelineColorBlendStateCreateInfo* pColorBlendState;
    const VkPipelineDynamicStateCreateInfo* pDynamicState;
    VkPipelineLayout       layout;
    VkRenderPass           renderPass;
    uint32_t               subpass;
    VkPipeline      basePipelineHandle;
    int32_t                basePipelineIndex;
} VkGraphicsPipelineCreateInfo;

typedef struct VkSparseImageMemoryBindInfo {
    VkImage image;
    uint32_t               bindCount;
    const VkSparseImageMemoryBind* pBinds;
} VkSparseImageMemoryBindInfo;

typedef struct VkBindSparseInfo {
    VkStructureType sType;
    const void*            pNext;
    uint32_t               waitSemaphoreCount;
    const VkSemaphore*     pWaitSemaphores;
    uint32_t               bufferBindCount;
    const VkSparseBufferMemoryBindInfo* pBufferBinds;
    uint32_t               imageOpaqueBindCount;
    const VkSparseImageOpaqueMemoryBindInfo* pImageOpaqueBinds;
    uint32_t               imageBindCount;
    const VkSparseImageMemoryBindInfo* pImageBinds;
    uint32_t               signalSemaphoreCount;
    const VkSemaphore*     pSignalSemaphores;
} VkBindSparseInfo;


/* ---- PFN typedefs -------------------------------------------------------- */

typedef VkResult (VKAPI_PTR *PFN_vkAllocateCommandBuffers)(VkDevice device, const VkCommandBufferAllocateInfo* pAllocateInfo, VkCommandBuffer* pCommandBuffers);
typedef VkResult (VKAPI_PTR *PFN_vkAllocateDescriptorSets)(VkDevice device, const VkDescriptorSetAllocateInfo* pAllocateInfo, VkDescriptorSet* pDescriptorSets);
typedef VkResult (VKAPI_PTR *PFN_vkAllocateMemory)(VkDevice device, const VkMemoryAllocateInfo* pAllocateInfo, const VkAllocationCallbacks* pAllocator, VkDeviceMemory* pMemory);
typedef VkResult (VKAPI_PTR *PFN_vkBeginCommandBuffer)(VkCommandBuffer commandBuffer, const VkCommandBufferBeginInfo* pBeginInfo);
typedef VkResult (VKAPI_PTR *PFN_vkBindBufferMemory)(VkDevice device, VkBuffer buffer, VkDeviceMemory memory, VkDeviceSize memoryOffset);
typedef VkResult (VKAPI_PTR *PFN_vkBindImageMemory)(VkDevice device, VkImage image, VkDeviceMemory memory, VkDeviceSize memoryOffset);
typedef void (VKAPI_PTR *PFN_vkCmdBeginQuery)(VkCommandBuffer commandBuffer, VkQueryPool queryPool, uint32_t query, VkQueryControlFlags flags);
typedef void (VKAPI_PTR *PFN_vkCmdBeginRenderPass)(VkCommandBuffer commandBuffer, const VkRenderPassBeginInfo* pRenderPassBegin, VkSubpassContents contents);
typedef void (VKAPI_PTR *PFN_vkCmdBindDescriptorSets)(VkCommandBuffer commandBuffer, VkPipelineBindPoint pipelineBindPoint, VkPipelineLayout layout, uint32_t firstSet, uint32_t descriptorSetCount, const VkDescriptorSet* pDescriptorSets, uint32_t dynamicOffsetCount, const uint32_t* pDynamicOffsets);
typedef void (VKAPI_PTR *PFN_vkCmdBindIndexBuffer)(VkCommandBuffer commandBuffer, VkBuffer buffer, VkDeviceSize offset, VkIndexType indexType);
typedef void (VKAPI_PTR *PFN_vkCmdBindPipeline)(VkCommandBuffer commandBuffer, VkPipelineBindPoint pipelineBindPoint, VkPipeline pipeline);
typedef void (VKAPI_PTR *PFN_vkCmdBindVertexBuffers)(VkCommandBuffer commandBuffer, uint32_t firstBinding, uint32_t bindingCount, const VkBuffer* pBuffers, const VkDeviceSize* pOffsets);
typedef void (VKAPI_PTR *PFN_vkCmdBlitImage)(VkCommandBuffer commandBuffer, VkImage srcImage, VkImageLayout srcImageLayout, VkImage dstImage, VkImageLayout dstImageLayout, uint32_t regionCount, const VkImageBlit* pRegions, VkFilter filter);
typedef void (VKAPI_PTR *PFN_vkCmdClearAttachments)(VkCommandBuffer commandBuffer, uint32_t attachmentCount, const VkClearAttachment* pAttachments, uint32_t rectCount, const VkClearRect* pRects);
typedef void (VKAPI_PTR *PFN_vkCmdClearColorImage)(VkCommandBuffer commandBuffer, VkImage image, VkImageLayout imageLayout, const VkClearColorValue* pColor, uint32_t rangeCount, const VkImageSubresourceRange* pRanges);
typedef void (VKAPI_PTR *PFN_vkCmdClearDepthStencilImage)(VkCommandBuffer commandBuffer, VkImage image, VkImageLayout imageLayout, const VkClearDepthStencilValue* pDepthStencil, uint32_t rangeCount, const VkImageSubresourceRange* pRanges);
typedef void (VKAPI_PTR *PFN_vkCmdCopyBuffer)(VkCommandBuffer commandBuffer, VkBuffer srcBuffer, VkBuffer dstBuffer, uint32_t regionCount, const VkBufferCopy* pRegions);
typedef void (VKAPI_PTR *PFN_vkCmdCopyBufferToImage)(VkCommandBuffer commandBuffer, VkBuffer srcBuffer, VkImage dstImage, VkImageLayout dstImageLayout, uint32_t regionCount, const VkBufferImageCopy* pRegions);
typedef void (VKAPI_PTR *PFN_vkCmdCopyImage)(VkCommandBuffer commandBuffer, VkImage srcImage, VkImageLayout srcImageLayout, VkImage dstImage, VkImageLayout dstImageLayout, uint32_t regionCount, const VkImageCopy* pRegions);
typedef void (VKAPI_PTR *PFN_vkCmdCopyImageToBuffer)(VkCommandBuffer commandBuffer, VkImage srcImage, VkImageLayout srcImageLayout, VkBuffer dstBuffer, uint32_t regionCount, const VkBufferImageCopy* pRegions);
typedef void (VKAPI_PTR *PFN_vkCmdCopyQueryPoolResults)(VkCommandBuffer commandBuffer, VkQueryPool queryPool, uint32_t firstQuery, uint32_t queryCount, VkBuffer dstBuffer, VkDeviceSize dstOffset, VkDeviceSize stride, VkQueryResultFlags flags);
typedef void (VKAPI_PTR *PFN_vkCmdDispatch)(VkCommandBuffer commandBuffer, uint32_t groupCountX, uint32_t groupCountY, uint32_t groupCountZ);
typedef void (VKAPI_PTR *PFN_vkCmdDispatchIndirect)(VkCommandBuffer commandBuffer, VkBuffer buffer, VkDeviceSize offset);
typedef void (VKAPI_PTR *PFN_vkCmdDraw)(VkCommandBuffer commandBuffer, uint32_t vertexCount, uint32_t instanceCount, uint32_t firstVertex, uint32_t firstInstance);
typedef void (VKAPI_PTR *PFN_vkCmdDrawIndexed)(VkCommandBuffer commandBuffer, uint32_t indexCount, uint32_t instanceCount, uint32_t firstIndex, int32_t vertexOffset, uint32_t firstInstance);
typedef void (VKAPI_PTR *PFN_vkCmdDrawIndexedIndirect)(VkCommandBuffer commandBuffer, VkBuffer buffer, VkDeviceSize offset, uint32_t drawCount, uint32_t stride);
typedef void (VKAPI_PTR *PFN_vkCmdDrawIndirect)(VkCommandBuffer commandBuffer, VkBuffer buffer, VkDeviceSize offset, uint32_t drawCount, uint32_t stride);
typedef void (VKAPI_PTR *PFN_vkCmdEndQuery)(VkCommandBuffer commandBuffer, VkQueryPool queryPool, uint32_t query);
typedef void (VKAPI_PTR *PFN_vkCmdEndRenderPass)(VkCommandBuffer commandBuffer);
typedef void (VKAPI_PTR *PFN_vkCmdExecuteCommands)(VkCommandBuffer commandBuffer, uint32_t commandBufferCount, const VkCommandBuffer* pCommandBuffers);
typedef void (VKAPI_PTR *PFN_vkCmdFillBuffer)(VkCommandBuffer commandBuffer, VkBuffer dstBuffer, VkDeviceSize dstOffset, VkDeviceSize size, uint32_t data);
typedef void (VKAPI_PTR *PFN_vkCmdNextSubpass)(VkCommandBuffer commandBuffer, VkSubpassContents contents);
typedef void (VKAPI_PTR *PFN_vkCmdPipelineBarrier)(VkCommandBuffer commandBuffer, VkPipelineStageFlags srcStageMask, VkPipelineStageFlags dstStageMask, VkDependencyFlags dependencyFlags, uint32_t memoryBarrierCount, const VkMemoryBarrier* pMemoryBarriers, uint32_t bufferMemoryBarrierCount, const VkBufferMemoryBarrier* pBufferMemoryBarriers, uint32_t imageMemoryBarrierCount, const VkImageMemoryBarrier* pImageMemoryBarriers);
typedef void (VKAPI_PTR *PFN_vkCmdPushConstants)(VkCommandBuffer commandBuffer, VkPipelineLayout layout, VkShaderStageFlags stageFlags, uint32_t offset, uint32_t size, const void* pValues);
typedef void (VKAPI_PTR *PFN_vkCmdResetEvent)(VkCommandBuffer commandBuffer, VkEvent event, VkPipelineStageFlags stageMask);
typedef void (VKAPI_PTR *PFN_vkCmdResetQueryPool)(VkCommandBuffer commandBuffer, VkQueryPool queryPool, uint32_t firstQuery, uint32_t queryCount);
typedef void (VKAPI_PTR *PFN_vkCmdResolveImage)(VkCommandBuffer commandBuffer, VkImage srcImage, VkImageLayout srcImageLayout, VkImage dstImage, VkImageLayout dstImageLayout, uint32_t regionCount, const VkImageResolve* pRegions);
typedef void (VKAPI_PTR *PFN_vkCmdSetBlendConstants)(VkCommandBuffer commandBuffer, const float blendConstants[4]);
typedef void (VKAPI_PTR *PFN_vkCmdSetDepthBias)(VkCommandBuffer commandBuffer, float depthBiasConstantFactor, float depthBiasClamp, float depthBiasSlopeFactor);
typedef void (VKAPI_PTR *PFN_vkCmdSetDepthBounds)(VkCommandBuffer commandBuffer, float minDepthBounds, float maxDepthBounds);
typedef void (VKAPI_PTR *PFN_vkCmdSetEvent)(VkCommandBuffer commandBuffer, VkEvent event, VkPipelineStageFlags stageMask);
typedef void (VKAPI_PTR *PFN_vkCmdSetLineWidth)(VkCommandBuffer commandBuffer, float lineWidth);
typedef void (VKAPI_PTR *PFN_vkCmdSetScissor)(VkCommandBuffer commandBuffer, uint32_t firstScissor, uint32_t scissorCount, const VkRect2D* pScissors);
typedef void (VKAPI_PTR *PFN_vkCmdSetStencilCompareMask)(VkCommandBuffer commandBuffer, VkStencilFaceFlags faceMask, uint32_t compareMask);
typedef void (VKAPI_PTR *PFN_vkCmdSetStencilReference)(VkCommandBuffer commandBuffer, VkStencilFaceFlags faceMask, uint32_t reference);
typedef void (VKAPI_PTR *PFN_vkCmdSetStencilWriteMask)(VkCommandBuffer commandBuffer, VkStencilFaceFlags faceMask, uint32_t writeMask);
typedef void (VKAPI_PTR *PFN_vkCmdSetViewport)(VkCommandBuffer commandBuffer, uint32_t firstViewport, uint32_t viewportCount, const VkViewport* pViewports);
typedef void (VKAPI_PTR *PFN_vkCmdUpdateBuffer)(VkCommandBuffer commandBuffer, VkBuffer dstBuffer, VkDeviceSize dstOffset, VkDeviceSize dataSize, const void* pData);
typedef void (VKAPI_PTR *PFN_vkCmdWaitEvents)(VkCommandBuffer commandBuffer, uint32_t eventCount, const VkEvent* pEvents, VkPipelineStageFlags srcStageMask, VkPipelineStageFlags dstStageMask, uint32_t memoryBarrierCount, const VkMemoryBarrier* pMemoryBarriers, uint32_t bufferMemoryBarrierCount, const VkBufferMemoryBarrier* pBufferMemoryBarriers, uint32_t imageMemoryBarrierCount, const VkImageMemoryBarrier* pImageMemoryBarriers);
typedef void (VKAPI_PTR *PFN_vkCmdWriteTimestamp)(VkCommandBuffer commandBuffer, VkPipelineStageFlagBits pipelineStage, VkQueryPool queryPool, uint32_t query);
typedef VkResult (VKAPI_PTR *PFN_vkCreateBuffer)(VkDevice device, const VkBufferCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkBuffer* pBuffer);
typedef VkResult (VKAPI_PTR *PFN_vkCreateBufferView)(VkDevice device, const VkBufferViewCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkBufferView* pView);
typedef VkResult (VKAPI_PTR *PFN_vkCreateCommandPool)(VkDevice device, const VkCommandPoolCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkCommandPool* pCommandPool);
typedef VkResult (VKAPI_PTR *PFN_vkCreateComputePipelines)(VkDevice device, VkPipelineCache pipelineCache, uint32_t createInfoCount, const VkComputePipelineCreateInfo* pCreateInfos, const VkAllocationCallbacks* pAllocator, VkPipeline* pPipelines);
typedef VkResult (VKAPI_PTR *PFN_vkCreateDescriptorPool)(VkDevice device, const VkDescriptorPoolCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkDescriptorPool* pDescriptorPool);
typedef VkResult (VKAPI_PTR *PFN_vkCreateDescriptorSetLayout)(VkDevice device, const VkDescriptorSetLayoutCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkDescriptorSetLayout* pSetLayout);
typedef VkResult (VKAPI_PTR *PFN_vkCreateDevice)(VkPhysicalDevice physicalDevice, const VkDeviceCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkDevice* pDevice);
typedef VkResult (VKAPI_PTR *PFN_vkCreateEvent)(VkDevice device, const VkEventCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkEvent* pEvent);
typedef VkResult (VKAPI_PTR *PFN_vkCreateFence)(VkDevice device, const VkFenceCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkFence* pFence);
typedef VkResult (VKAPI_PTR *PFN_vkCreateFramebuffer)(VkDevice device, const VkFramebufferCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkFramebuffer* pFramebuffer);
typedef VkResult (VKAPI_PTR *PFN_vkCreateGraphicsPipelines)(VkDevice device, VkPipelineCache pipelineCache, uint32_t createInfoCount, const VkGraphicsPipelineCreateInfo* pCreateInfos, const VkAllocationCallbacks* pAllocator, VkPipeline* pPipelines);
typedef VkResult (VKAPI_PTR *PFN_vkCreateImage)(VkDevice device, const VkImageCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkImage* pImage);
typedef VkResult (VKAPI_PTR *PFN_vkCreateImageView)(VkDevice device, const VkImageViewCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkImageView* pView);
typedef VkResult (VKAPI_PTR *PFN_vkCreateInstance)(const VkInstanceCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkInstance* pInstance);
typedef VkResult (VKAPI_PTR *PFN_vkCreatePipelineCache)(VkDevice device, const VkPipelineCacheCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkPipelineCache* pPipelineCache);
typedef VkResult (VKAPI_PTR *PFN_vkCreatePipelineLayout)(VkDevice device, const VkPipelineLayoutCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkPipelineLayout* pPipelineLayout);
typedef VkResult (VKAPI_PTR *PFN_vkCreateQueryPool)(VkDevice device, const VkQueryPoolCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkQueryPool* pQueryPool);
typedef VkResult (VKAPI_PTR *PFN_vkCreateRenderPass)(VkDevice device, const VkRenderPassCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkRenderPass* pRenderPass);
typedef VkResult (VKAPI_PTR *PFN_vkCreateSampler)(VkDevice device, const VkSamplerCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkSampler* pSampler);
typedef VkResult (VKAPI_PTR *PFN_vkCreateSemaphore)(VkDevice device, const VkSemaphoreCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkSemaphore* pSemaphore);
typedef VkResult (VKAPI_PTR *PFN_vkCreateShaderModule)(VkDevice device, const VkShaderModuleCreateInfo* pCreateInfo, const VkAllocationCallbacks* pAllocator, VkShaderModule* pShaderModule);
typedef void (VKAPI_PTR *PFN_vkDestroyBuffer)(VkDevice device, VkBuffer buffer, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyBufferView)(VkDevice device, VkBufferView bufferView, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyCommandPool)(VkDevice device, VkCommandPool commandPool, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyDescriptorPool)(VkDevice device, VkDescriptorPool descriptorPool, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyDescriptorSetLayout)(VkDevice device, VkDescriptorSetLayout descriptorSetLayout, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyDevice)(VkDevice device, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyEvent)(VkDevice device, VkEvent event, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyFence)(VkDevice device, VkFence fence, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyFramebuffer)(VkDevice device, VkFramebuffer framebuffer, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyImage)(VkDevice device, VkImage image, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyImageView)(VkDevice device, VkImageView imageView, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyInstance)(VkInstance instance, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyPipeline)(VkDevice device, VkPipeline pipeline, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyPipelineCache)(VkDevice device, VkPipelineCache pipelineCache, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyPipelineLayout)(VkDevice device, VkPipelineLayout pipelineLayout, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyQueryPool)(VkDevice device, VkQueryPool queryPool, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyRenderPass)(VkDevice device, VkRenderPass renderPass, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroySampler)(VkDevice device, VkSampler sampler, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroySemaphore)(VkDevice device, VkSemaphore semaphore, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkDestroyShaderModule)(VkDevice device, VkShaderModule shaderModule, const VkAllocationCallbacks* pAllocator);
typedef VkResult (VKAPI_PTR *PFN_vkDeviceWaitIdle)(VkDevice device);
typedef VkResult (VKAPI_PTR *PFN_vkEndCommandBuffer)(VkCommandBuffer commandBuffer);
typedef VkResult (VKAPI_PTR *PFN_vkEnumerateDeviceExtensionProperties)(VkPhysicalDevice physicalDevice, const char* pLayerName, uint32_t* pPropertyCount, VkExtensionProperties* pProperties);
typedef VkResult (VKAPI_PTR *PFN_vkEnumerateDeviceLayerProperties)(VkPhysicalDevice physicalDevice, uint32_t* pPropertyCount, VkLayerProperties* pProperties);
typedef VkResult (VKAPI_PTR *PFN_vkEnumerateInstanceExtensionProperties)(const char* pLayerName, uint32_t* pPropertyCount, VkExtensionProperties* pProperties);
typedef VkResult (VKAPI_PTR *PFN_vkEnumerateInstanceLayerProperties)(uint32_t* pPropertyCount, VkLayerProperties* pProperties);
typedef VkResult (VKAPI_PTR *PFN_vkEnumeratePhysicalDevices)(VkInstance instance, uint32_t* pPhysicalDeviceCount, VkPhysicalDevice* pPhysicalDevices);
typedef VkResult (VKAPI_PTR *PFN_vkFlushMappedMemoryRanges)(VkDevice device, uint32_t memoryRangeCount, const VkMappedMemoryRange* pMemoryRanges);
typedef void (VKAPI_PTR *PFN_vkFreeCommandBuffers)(VkDevice device, VkCommandPool commandPool, uint32_t commandBufferCount, const VkCommandBuffer* pCommandBuffers);
typedef VkResult (VKAPI_PTR *PFN_vkFreeDescriptorSets)(VkDevice device, VkDescriptorPool descriptorPool, uint32_t descriptorSetCount, const VkDescriptorSet* pDescriptorSets);
typedef void (VKAPI_PTR *PFN_vkFreeMemory)(VkDevice device, VkDeviceMemory memory, const VkAllocationCallbacks* pAllocator);
typedef void (VKAPI_PTR *PFN_vkGetBufferMemoryRequirements)(VkDevice device, VkBuffer buffer, VkMemoryRequirements* pMemoryRequirements);
typedef void (VKAPI_PTR *PFN_vkGetDeviceMemoryCommitment)(VkDevice device, VkDeviceMemory memory, VkDeviceSize* pCommittedMemoryInBytes);
typedef PFN_vkVoidFunction (VKAPI_PTR *PFN_vkGetDeviceProcAddr)(VkDevice device, const char* pName);
typedef void (VKAPI_PTR *PFN_vkGetDeviceQueue)(VkDevice device, uint32_t queueFamilyIndex, uint32_t queueIndex, VkQueue* pQueue);
typedef VkResult (VKAPI_PTR *PFN_vkGetEventStatus)(VkDevice device, VkEvent event);
typedef VkResult (VKAPI_PTR *PFN_vkGetFenceStatus)(VkDevice device, VkFence fence);
typedef void (VKAPI_PTR *PFN_vkGetImageMemoryRequirements)(VkDevice device, VkImage image, VkMemoryRequirements* pMemoryRequirements);
typedef void (VKAPI_PTR *PFN_vkGetImageSparseMemoryRequirements)(VkDevice device, VkImage image, uint32_t* pSparseMemoryRequirementCount, VkSparseImageMemoryRequirements* pSparseMemoryRequirements);
typedef void (VKAPI_PTR *PFN_vkGetImageSubresourceLayout)(VkDevice device, VkImage image, const VkImageSubresource* pSubresource, VkSubresourceLayout* pLayout);
typedef PFN_vkVoidFunction (VKAPI_PTR *PFN_vkGetInstanceProcAddr)(VkInstance instance, const char* pName);
typedef void (VKAPI_PTR *PFN_vkGetPhysicalDeviceFeatures)(VkPhysicalDevice physicalDevice, VkPhysicalDeviceFeatures* pFeatures);
typedef void (VKAPI_PTR *PFN_vkGetPhysicalDeviceFormatProperties)(VkPhysicalDevice physicalDevice, VkFormat format, VkFormatProperties* pFormatProperties);
typedef VkResult (VKAPI_PTR *PFN_vkGetPhysicalDeviceImageFormatProperties)(VkPhysicalDevice physicalDevice, VkFormat format, VkImageType type, VkImageTiling tiling, VkImageUsageFlags usage, VkImageCreateFlags flags, VkImageFormatProperties* pImageFormatProperties);
typedef void (VKAPI_PTR *PFN_vkGetPhysicalDeviceMemoryProperties)(VkPhysicalDevice physicalDevice, VkPhysicalDeviceMemoryProperties* pMemoryProperties);
typedef void (VKAPI_PTR *PFN_vkGetPhysicalDeviceProperties)(VkPhysicalDevice physicalDevice, VkPhysicalDeviceProperties* pProperties);
typedef void (VKAPI_PTR *PFN_vkGetPhysicalDeviceQueueFamilyProperties)(VkPhysicalDevice physicalDevice, uint32_t* pQueueFamilyPropertyCount, VkQueueFamilyProperties* pQueueFamilyProperties);
typedef void (VKAPI_PTR *PFN_vkGetPhysicalDeviceSparseImageFormatProperties)(VkPhysicalDevice physicalDevice, VkFormat format, VkImageType type, VkSampleCountFlagBits samples, VkImageUsageFlags usage, VkImageTiling tiling, uint32_t* pPropertyCount, VkSparseImageFormatProperties* pProperties);
typedef VkResult (VKAPI_PTR *PFN_vkGetPipelineCacheData)(VkDevice device, VkPipelineCache pipelineCache, size_t* pDataSize, void* pData);
typedef VkResult (VKAPI_PTR *PFN_vkGetQueryPoolResults)(VkDevice device, VkQueryPool queryPool, uint32_t firstQuery, uint32_t queryCount, size_t dataSize, void* pData, VkDeviceSize stride, VkQueryResultFlags flags);
typedef void (VKAPI_PTR *PFN_vkGetRenderAreaGranularity)(VkDevice device, VkRenderPass renderPass, VkExtent2D* pGranularity);
typedef VkResult (VKAPI_PTR *PFN_vkInvalidateMappedMemoryRanges)(VkDevice device, uint32_t memoryRangeCount, const VkMappedMemoryRange* pMemoryRanges);
typedef VkResult (VKAPI_PTR *PFN_vkMapMemory)(VkDevice device, VkDeviceMemory memory, VkDeviceSize offset, VkDeviceSize size, VkMemoryMapFlags flags, void** ppData);
typedef VkResult (VKAPI_PTR *PFN_vkMergePipelineCaches)(VkDevice device, VkPipelineCache dstCache, uint32_t srcCacheCount, const VkPipelineCache* pSrcCaches);
typedef VkResult (VKAPI_PTR *PFN_vkQueueBindSparse)(VkQueue queue, uint32_t bindInfoCount, const VkBindSparseInfo* pBindInfo, VkFence fence);
typedef VkResult (VKAPI_PTR *PFN_vkQueueSubmit)(VkQueue queue, uint32_t submitCount, const VkSubmitInfo* pSubmits, VkFence fence);
typedef VkResult (VKAPI_PTR *PFN_vkQueueWaitIdle)(VkQueue queue);
typedef VkResult (VKAPI_PTR *PFN_vkResetCommandBuffer)(VkCommandBuffer commandBuffer, VkCommandBufferResetFlags flags);
typedef VkResult (VKAPI_PTR *PFN_vkResetCommandPool)(VkDevice device, VkCommandPool commandPool, VkCommandPoolResetFlags flags);
typedef VkResult (VKAPI_PTR *PFN_vkResetDescriptorPool)(VkDevice device, VkDescriptorPool descriptorPool, VkDescriptorPoolResetFlags flags);
typedef VkResult (VKAPI_PTR *PFN_vkResetEvent)(VkDevice device, VkEvent event);
typedef VkResult (VKAPI_PTR *PFN_vkResetFences)(VkDevice device, uint32_t fenceCount, const VkFence* pFences);
typedef VkResult (VKAPI_PTR *PFN_vkSetEvent)(VkDevice device, VkEvent event);
typedef void (VKAPI_PTR *PFN_vkUnmapMemory)(VkDevice device, VkDeviceMemory memory);
typedef void (VKAPI_PTR *PFN_vkUpdateDescriptorSets)(VkDevice device, uint32_t descriptorWriteCount, const VkWriteDescriptorSet* pDescriptorWrites, uint32_t descriptorCopyCount, const VkCopyDescriptorSet* pDescriptorCopies);
typedef VkResult (VKAPI_PTR *PFN_vkWaitForFences)(VkDevice device, uint32_t fenceCount, const VkFence* pFences, VkBool32 waitAll, uint64_t timeout);


/* ---- Context struct ------------------------------------------------------
 * Three anonymous unions give both indexed (array) and named (struct member)
 * access to the same memory, at zero runtime cost.
 *
 * featArray / extArray: unsigned char flags, one per feature / extension.
 * pfnArray: function pointer slots, one per command.
 *
 * Anonymous structs inside the unions are a C11 / GCC extension; they are
 * universally supported on our target compilers.
 */
typedef struct GloamVulkanContext {
    union {
        unsigned char featArray[1];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        };
    };

    union {
        void *pfnArray[137];
        struct {
        /*    0 */ PFN_vkAllocateCommandBuffers AllocateCommandBuffers;
        /*    1 */ PFN_vkAllocateDescriptorSets AllocateDescriptorSets;
        /*    2 */ PFN_vkAllocateMemory AllocateMemory;
        /*    3 */ PFN_vkBeginCommandBuffer BeginCommandBuffer;
        /*    4 */ PFN_vkBindBufferMemory BindBufferMemory;
        /*    5 */ PFN_vkBindImageMemory BindImageMemory;
        /*    6 */ PFN_vkCmdBeginQuery CmdBeginQuery;
        /*    7 */ PFN_vkCmdBeginRenderPass CmdBeginRenderPass;
        /*    8 */ PFN_vkCmdBindDescriptorSets CmdBindDescriptorSets;
        /*    9 */ PFN_vkCmdBindIndexBuffer CmdBindIndexBuffer;
        /*   10 */ PFN_vkCmdBindPipeline CmdBindPipeline;
        /*   11 */ PFN_vkCmdBindVertexBuffers CmdBindVertexBuffers;
        /*   12 */ PFN_vkCmdBlitImage CmdBlitImage;
        /*   13 */ PFN_vkCmdClearAttachments CmdClearAttachments;
        /*   14 */ PFN_vkCmdClearColorImage CmdClearColorImage;
        /*   15 */ PFN_vkCmdClearDepthStencilImage CmdClearDepthStencilImage;
        /*   16 */ PFN_vkCmdCopyBuffer CmdCopyBuffer;
        /*   17 */ PFN_vkCmdCopyBufferToImage CmdCopyBufferToImage;
        /*   18 */ PFN_vkCmdCopyImage CmdCopyImage;
        /*   19 */ PFN_vkCmdCopyImageToBuffer CmdCopyImageToBuffer;
        /*   20 */ PFN_vkCmdCopyQueryPoolResults CmdCopyQueryPoolResults;
        /*   21 */ PFN_vkCmdDispatch CmdDispatch;
        /*   22 */ PFN_vkCmdDispatchIndirect CmdDispatchIndirect;
        /*   23 */ PFN_vkCmdDraw CmdDraw;
        /*   24 */ PFN_vkCmdDrawIndexed CmdDrawIndexed;
        /*   25 */ PFN_vkCmdDrawIndexedIndirect CmdDrawIndexedIndirect;
        /*   26 */ PFN_vkCmdDrawIndirect CmdDrawIndirect;
        /*   27 */ PFN_vkCmdEndQuery CmdEndQuery;
        /*   28 */ PFN_vkCmdEndRenderPass CmdEndRenderPass;
        /*   29 */ PFN_vkCmdExecuteCommands CmdExecuteCommands;
        /*   30 */ PFN_vkCmdFillBuffer CmdFillBuffer;
        /*   31 */ PFN_vkCmdNextSubpass CmdNextSubpass;
        /*   32 */ PFN_vkCmdPipelineBarrier CmdPipelineBarrier;
        /*   33 */ PFN_vkCmdPushConstants CmdPushConstants;
        /*   34 */ PFN_vkCmdResetEvent CmdResetEvent;
        /*   35 */ PFN_vkCmdResetQueryPool CmdResetQueryPool;
        /*   36 */ PFN_vkCmdResolveImage CmdResolveImage;
        /*   37 */ PFN_vkCmdSetBlendConstants CmdSetBlendConstants;
        /*   38 */ PFN_vkCmdSetDepthBias CmdSetDepthBias;
        /*   39 */ PFN_vkCmdSetDepthBounds CmdSetDepthBounds;
        /*   40 */ PFN_vkCmdSetEvent CmdSetEvent;
        /*   41 */ PFN_vkCmdSetLineWidth CmdSetLineWidth;
        /*   42 */ PFN_vkCmdSetScissor CmdSetScissor;
        /*   43 */ PFN_vkCmdSetStencilCompareMask CmdSetStencilCompareMask;
        /*   44 */ PFN_vkCmdSetStencilReference CmdSetStencilReference;
        /*   45 */ PFN_vkCmdSetStencilWriteMask CmdSetStencilWriteMask;
        /*   46 */ PFN_vkCmdSetViewport CmdSetViewport;
        /*   47 */ PFN_vkCmdUpdateBuffer CmdUpdateBuffer;
        /*   48 */ PFN_vkCmdWaitEvents CmdWaitEvents;
        /*   49 */ PFN_vkCmdWriteTimestamp CmdWriteTimestamp;
        /*   50 */ PFN_vkCreateBuffer CreateBuffer;
        /*   51 */ PFN_vkCreateBufferView CreateBufferView;
        /*   52 */ PFN_vkCreateCommandPool CreateCommandPool;
        /*   53 */ PFN_vkCreateComputePipelines CreateComputePipelines;
        /*   54 */ PFN_vkCreateDescriptorPool CreateDescriptorPool;
        /*   55 */ PFN_vkCreateDescriptorSetLayout CreateDescriptorSetLayout;
        /*   56 */ PFN_vkCreateDevice CreateDevice;
        /*   57 */ PFN_vkCreateEvent CreateEvent;
        /*   58 */ PFN_vkCreateFence CreateFence;
        /*   59 */ PFN_vkCreateFramebuffer CreateFramebuffer;
        /*   60 */ PFN_vkCreateGraphicsPipelines CreateGraphicsPipelines;
        /*   61 */ PFN_vkCreateImage CreateImage;
        /*   62 */ PFN_vkCreateImageView CreateImageView;
        /*   63 */ PFN_vkCreateInstance CreateInstance;
        /*   64 */ PFN_vkCreatePipelineCache CreatePipelineCache;
        /*   65 */ PFN_vkCreatePipelineLayout CreatePipelineLayout;
        /*   66 */ PFN_vkCreateQueryPool CreateQueryPool;
        /*   67 */ PFN_vkCreateRenderPass CreateRenderPass;
        /*   68 */ PFN_vkCreateSampler CreateSampler;
        /*   69 */ PFN_vkCreateSemaphore CreateSemaphore;
        /*   70 */ PFN_vkCreateShaderModule CreateShaderModule;
        /*   71 */ PFN_vkDestroyBuffer DestroyBuffer;
        /*   72 */ PFN_vkDestroyBufferView DestroyBufferView;
        /*   73 */ PFN_vkDestroyCommandPool DestroyCommandPool;
        /*   74 */ PFN_vkDestroyDescriptorPool DestroyDescriptorPool;
        /*   75 */ PFN_vkDestroyDescriptorSetLayout DestroyDescriptorSetLayout;
        /*   76 */ PFN_vkDestroyDevice DestroyDevice;
        /*   77 */ PFN_vkDestroyEvent DestroyEvent;
        /*   78 */ PFN_vkDestroyFence DestroyFence;
        /*   79 */ PFN_vkDestroyFramebuffer DestroyFramebuffer;
        /*   80 */ PFN_vkDestroyImage DestroyImage;
        /*   81 */ PFN_vkDestroyImageView DestroyImageView;
        /*   82 */ PFN_vkDestroyInstance DestroyInstance;
        /*   83 */ PFN_vkDestroyPipeline DestroyPipeline;
        /*   84 */ PFN_vkDestroyPipelineCache DestroyPipelineCache;
        /*   85 */ PFN_vkDestroyPipelineLayout DestroyPipelineLayout;
        /*   86 */ PFN_vkDestroyQueryPool DestroyQueryPool;
        /*   87 */ PFN_vkDestroyRenderPass DestroyRenderPass;
        /*   88 */ PFN_vkDestroySampler DestroySampler;
        /*   89 */ PFN_vkDestroySemaphore DestroySemaphore;
        /*   90 */ PFN_vkDestroyShaderModule DestroyShaderModule;
        /*   91 */ PFN_vkDeviceWaitIdle DeviceWaitIdle;
        /*   92 */ PFN_vkEndCommandBuffer EndCommandBuffer;
        /*   93 */ PFN_vkEnumerateDeviceExtensionProperties EnumerateDeviceExtensionProperties;
        /*   94 */ PFN_vkEnumerateDeviceLayerProperties EnumerateDeviceLayerProperties;
        /*   95 */ PFN_vkEnumerateInstanceExtensionProperties EnumerateInstanceExtensionProperties;
        /*   96 */ PFN_vkEnumerateInstanceLayerProperties EnumerateInstanceLayerProperties;
        /*   97 */ PFN_vkEnumeratePhysicalDevices EnumeratePhysicalDevices;
        /*   98 */ PFN_vkFlushMappedMemoryRanges FlushMappedMemoryRanges;
        /*   99 */ PFN_vkFreeCommandBuffers FreeCommandBuffers;
        /*  100 */ PFN_vkFreeDescriptorSets FreeDescriptorSets;
        /*  101 */ PFN_vkFreeMemory FreeMemory;
        /*  102 */ PFN_vkGetBufferMemoryRequirements GetBufferMemoryRequirements;
        /*  103 */ PFN_vkGetDeviceMemoryCommitment GetDeviceMemoryCommitment;
        /*  104 */ PFN_vkGetDeviceProcAddr GetDeviceProcAddr;
        /*  105 */ PFN_vkGetDeviceQueue GetDeviceQueue;
        /*  106 */ PFN_vkGetEventStatus GetEventStatus;
        /*  107 */ PFN_vkGetFenceStatus GetFenceStatus;
        /*  108 */ PFN_vkGetImageMemoryRequirements GetImageMemoryRequirements;
        /*  109 */ PFN_vkGetImageSparseMemoryRequirements GetImageSparseMemoryRequirements;
        /*  110 */ PFN_vkGetImageSubresourceLayout GetImageSubresourceLayout;
        /*  111 */ PFN_vkGetInstanceProcAddr GetInstanceProcAddr;
        /*  112 */ PFN_vkGetPhysicalDeviceFeatures GetPhysicalDeviceFeatures;
        /*  113 */ PFN_vkGetPhysicalDeviceFormatProperties GetPhysicalDeviceFormatProperties;
        /*  114 */ PFN_vkGetPhysicalDeviceImageFormatProperties GetPhysicalDeviceImageFormatProperties;
        /*  115 */ PFN_vkGetPhysicalDeviceMemoryProperties GetPhysicalDeviceMemoryProperties;
        /*  116 */ PFN_vkGetPhysicalDeviceProperties GetPhysicalDeviceProperties;
        /*  117 */ PFN_vkGetPhysicalDeviceQueueFamilyProperties GetPhysicalDeviceQueueFamilyProperties;
        /*  118 */ PFN_vkGetPhysicalDeviceSparseImageFormatProperties GetPhysicalDeviceSparseImageFormatProperties;
        /*  119 */ PFN_vkGetPipelineCacheData GetPipelineCacheData;
        /*  120 */ PFN_vkGetQueryPoolResults GetQueryPoolResults;
        /*  121 */ PFN_vkGetRenderAreaGranularity GetRenderAreaGranularity;
        /*  122 */ PFN_vkInvalidateMappedMemoryRanges InvalidateMappedMemoryRanges;
        /*  123 */ PFN_vkMapMemory MapMemory;
        /*  124 */ PFN_vkMergePipelineCaches MergePipelineCaches;
        /*  125 */ PFN_vkQueueBindSparse QueueBindSparse;
        /*  126 */ PFN_vkQueueSubmit QueueSubmit;
        /*  127 */ PFN_vkQueueWaitIdle QueueWaitIdle;
        /*  128 */ PFN_vkResetCommandBuffer ResetCommandBuffer;
        /*  129 */ PFN_vkResetCommandPool ResetCommandPool;
        /*  130 */ PFN_vkResetDescriptorPool ResetDescriptorPool;
        /*  131 */ PFN_vkResetEvent ResetEvent;
        /*  132 */ PFN_vkResetFences ResetFences;
        /*  133 */ PFN_vkSetEvent SetEvent;
        /*  134 */ PFN_vkUnmapMemory UnmapMemory;
        /*  135 */ PFN_vkUpdateDescriptorSets UpdateDescriptorSets;
        /*  136 */ PFN_vkWaitForFences WaitForFences;
        };
    };

    /* Built-in loader library handle. Set by gloamVulkanInitialize*Context /
     * gloamLoaderLoad*Context when it opens the platform library. If the
     * caller pre-populates this field, the open is skipped and ownership is
     * NOT taken (gloam will not close it). Present on all context types so
     * user code can use a single field name regardless of API.
     */
    void *gloam_loader_handle;

    /* Non-zero if gloam opened the library handle itself and is responsible
     * for closing it in gloamVulkanFinalize / gloamLoaderUnload.
     */
    uint8_t gloam_loader_owns_handle;

    /* The last VkInstance this context loaded entry points from */
    VkInstance vk_loaded_instance;
    /* The last VkDevice this context loaded entry points from */
    VkDevice vk_loaded_device;
    /* Vulkan discovery-path metadata — used by gloamLoaderLoadVulkanContext to make
