#ifndef GLOAM_GLES1_H
#define GLOAM_GLES1_H

#ifdef __clang__
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#endif
#ifdef __gl_h_
  #error OpenGL ES 1 (gl.h) header already included (API: gles1), remove previous include!
#endif
#define __gl_h_ 1
#ifdef __gles1_gl_h_
  #error OpenGL ES 1 header already included (API: gles1), remove previous include!
#endif
#define __gles1_gl_h_ 1
#ifdef __clang__
#pragma clang diagnostic pop
#endif

/* ---- Platform detection ------------------------------------------------ */
#ifndef GLOAM_PLATFORM_DETECTED_
#define GLOAM_PLATFORM_DETECTED_
#if defined(__CYGWIN__) || defined(_WIN32)
#  define GLOAM_PLATFORM_WINDOWS 1
#endif
#if defined(__linux)
#  define GLOAM_PLATFORM_LINUX 1
#endif
#endif /* GLOAM_PLATFORM_DETECTED_ */

#ifndef GLOAM_HAS_ENUM_BASE_TYPE
#if defined(__cplusplus) || (defined(__STDC_VERSION__) && __STDC_VERSION__ >= 202311L)
#  define GLOAM_HAS_ENUM_BASE_TYPE 1
#else
#  define GLOAM_HAS_ENUM_BASE_TYPE 0
#endif
#endif

#include <stddef.h>
#include <stdint.h>

#include "KHR/khrplatform.h"

#ifdef __cplusplus
extern "C" {
#endif

/* Calling convention */
#ifndef APIENTRY
#  if defined(GLOAM_PLATFORM_WINDOWS)
#    define APIENTRY __stdcall
#  else
#    define APIENTRY
#  endif
#endif
#ifndef APIENTRYP
#  define APIENTRYP APIENTRY *
#endif
#ifndef GLAPI
#  define GLAPI extern
#endif

/* Calling convention for GL callback function pointers (e.g. debug callbacks,

typedef void (APIENTRYP PFNGLTEXPARAMETERFVPROC)(GLenum target, GLenum pname, const GLfloat * params);
typedef void (APIENTRYP PFNGLTEXPARAMETERIPROC)(GLenum target, GLenum pname, GLint param);
typedef void (APIENTRYP PFNGLTEXPARAMETERIVPROC)(GLenum target, GLenum pname, const GLint * params);
typedef void (APIENTRYP PFNGLTEXPARAMETERXPROC)(GLenum target, GLenum pname, GLfixed param);
typedef void (APIENTRYP PFNGLTEXPARAMETERXVPROC)(GLenum target, GLenum pname, const GLfixed * params);
typedef void (APIENTRYP PFNGLTEXSUBIMAGE2DPROC)(GLenum target, GLint level, GLint xoffset, GLint yoffset, GLsizei width, GLsizei height, GLenum format, GLenum type, const void * pixels);
typedef void (APIENTRYP PFNGLTRANSLATEFPROC)(GLfloat x, GLfloat y, GLfloat z);
typedef void (APIENTRYP PFNGLTRANSLATEXPROC)(GLfixed x, GLfixed y, GLfixed z);
typedef void (APIENTRYP PFNGLVERTEXPOINTERPROC)(GLint size, GLenum type, GLsizei stride, const void * pointer);
typedef void (APIENTRYP PFNGLVIEWPORTPROC)(GLint x, GLint y, GLsizei width, GLsizei height);
typedef void (APIENTRYP PFNGLBINDFRAMEBUFFEROESPROC)(GLenum target, GLuint framebuffer);
typedef void (APIENTRYP PFNGLBINDRENDERBUFFEROESPROC)(GLenum target, GLuint renderbuffer);
typedef GLenum (APIENTRYP PFNGLCHECKFRAMEBUFFERSTATUSOESPROC)(GLenum target);
typedef void (APIENTRYP PFNGLDELETEFRAMEBUFFERSOESPROC)(GLsizei n, const GLuint * framebuffers);
typedef void (APIENTRYP PFNGLDELETERENDERBUFFERSOESPROC)(GLsizei n, const GLuint * renderbuffers);
typedef void (APIENTRYP PFNGLFRAMEBUFFERRENDERBUFFEROESPROC)(GLenum target, GLenum attachment, GLenum renderbuffertarget, GLuint renderbuffer);
typedef void (APIENTRYP PFNGLFRAMEBUFFERTEXTURE2DOESPROC)(GLenum target, GLenum attachment, GLenum textarget, GLuint texture, GLint level);
typedef void (APIENTRYP PFNGLGENFRAMEBUFFERSOESPROC)(GLsizei n, GLuint * framebuffers);
typedef void (APIENTRYP PFNGLGENRENDERBUFFERSOESPROC)(GLsizei n, GLuint * renderbuffers);
typedef void (APIENTRYP PFNGLGENERATEMIPMAPOESPROC)(GLenum target);
typedef void (APIENTRYP PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVOESPROC)(GLenum target, GLenum attachment, GLenum pname, GLint * params);
typedef void (APIENTRYP PFNGLGETRENDERBUFFERPARAMETERIVOESPROC)(GLenum target, GLenum pname, GLint * params);
typedef GLboolean (APIENTRYP PFNGLISFRAMEBUFFEROESPROC)(GLuint framebuffer);
typedef GLboolean (APIENTRYP PFNGLISRENDERBUFFEROESPROC)(GLuint renderbuffer);
typedef void (APIENTRYP PFNGLRENDERBUFFERSTORAGEOESPROC)(GLenum target, GLenum internalformat, GLsizei width, GLsizei height);


/* ---- Context struct ------------------------------------------------------
 * Three anonymous unions give both indexed (array) and named (struct member)
 * access to the same memory, at zero runtime cost.
 *
 * featArray / extArray: unsigned char flags, one per feature / extension.
 * pfnArray: function pointer slots, one per command.
 *
 * Anonymous structs inside the unions are a C11 / GCC extension; they are
 * universally supported on our target compilers.
 */
typedef struct GloamGLContext {
    union {
        unsigned char featArray[1];
        struct {
        /*    0 */ unsigned char VERSION_ES_CM_1_0;
        };
    };

    union {
        unsigned char extArray[1];
        struct {
        /*    0 */ unsigned char OES_framebuffer_object;
        };
    };

    union {
        void *pfnArray[159];
        struct {
        /*    0 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*    1 */ PFNGLALPHAFUNCPROC AlphaFunc;
        /*    2 */ PFNGLALPHAFUNCXPROC AlphaFuncx;
        /*    3 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*    4 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*    5 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*    6 */ PFNGLBUFFERDATAPROC BufferData;
        /*    7 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*    8 */ PFNGLCLEARPROC Clear;
        /*    9 */ PFNGLCLEARCOLORPROC ClearColor;
        /*   10 */ PFNGLCLEARCOLORXPROC ClearColorx;
        /*   11 */ PFNGLCLEARDEPTHFPROC ClearDepthf;
        /*   12 */ PFNGLCLEARDEPTHXPROC ClearDepthx;
        /*   13 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*   14 */ PFNGLCLIENTACTIVETEXTUREPROC ClientActiveTexture;
        /*   15 */ PFNGLCLIPPLANEFPROC ClipPlanef;
        /*   16 */ PFNGLCLIPPLANEXPROC ClipPlanex;
        /*   17 */ PFNGLCOLOR4FPROC Color4f;
        /*   18 */ PFNGLCOLOR4UBPROC Color4ub;
        /*   19 */ PFNGLCOLOR4XPROC Color4x;
        /*   20 */ PFNGLCOLORMASKPROC ColorMask;
        /*   21 */ PFNGLCOLORPOINTERPROC ColorPointer;
        /*   22 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*   23 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*   24 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*   25 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*   26 */ PFNGLCULLFACEPROC CullFace;
        /*   27 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*   28 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*   29 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*   30 */ PFNGLDEPTHMASKPROC DepthMask;
        /*   31 */ PFNGLDEPTHRANGEFPROC DepthRangef;
        /*   32 */ PFNGLDEPTHRANGEXPROC DepthRangex;
        /*   33 */ PFNGLDISABLEPROC Disable;
        /*   34 */ PFNGLDISABLECLIENTSTATEPROC DisableClientState;
        /*   35 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*   36 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*   37 */ PFNGLENABLEPROC Enable;
        /*   38 */ PFNGLENABLECLIENTSTATEPROC EnableClientState;
        /*   39 */ PFNGLFINISHPROC Finish;
        /*   40 */ PFNGLFLUSHPROC Flush;
        /*   41 */ PFNGLFOGFPROC Fogf;
        /*   42 */ PFNGLFOGFVPROC Fogfv;
        /*   43 */ PFNGLFOGXPROC Fogx;
        /*   44 */ PFNGLFOGXVPROC Fogxv;
        /*   45 */ PFNGLFRONTFACEPROC FrontFace;
        /*   46 */ PFNGLFRUSTUMFPROC Frustumf;
        /*   47 */ PFNGLFRUSTUMXPROC Frustumx;
        /*   48 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*   49 */ PFNGLGENTEXTURESPROC GenTextures;
        /*   50 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*   51 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*   52 */ PFNGLGETCLIPPLANEFPROC GetClipPlanef;
        /*   53 */ PFNGLGETCLIPPLANEXPROC GetClipPlanex;
        /*   54 */ PFNGLGETERRORPROC GetError;
        /*   55 */ PFNGLGETFIXEDVPROC GetFixedv;
        /*   56 */ PFNGLGETFLOATVPROC GetFloatv;
        /*   57 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*   58 */ PFNGLGETLIGHTFVPROC GetLightfv;
        /*   59 */ PFNGLGETLIGHTXVPROC GetLightxv;
        /*   60 */ PFNGLGETMATERIALFVPROC GetMaterialfv;
        /*   61 */ PFNGLGETMATERIALXVPROC GetMaterialxv;
        /*   62 */ PFNGLGETPOINTERVPROC GetPointerv;
        /*   63 */ PFNGLGETSTRINGPROC GetString;
        /*   64 */ PFNGLGETTEXENVFVPROC GetTexEnvfv;
        /*   65 */ PFNGLGETTEXENVIVPROC GetTexEnviv;
        /*   66 */ PFNGLGETTEXENVXVPROC GetTexEnvxv;
        /*   67 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*   68 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*   69 */ PFNGLGETTEXPARAMETERXVPROC GetTexParameterxv;
        /*   70 */ PFNGLHINTPROC Hint;
        /*   71 */ PFNGLISBUFFERPROC IsBuffer;
        /*   72 */ PFNGLISENABLEDPROC IsEnabled;
        /*   73 */ PFNGLISTEXTUREPROC IsTexture;
        /*   74 */ PFNGLLIGHTMODELFPROC LightModelf;
        /*   75 */ PFNGLLIGHTMODELFVPROC LightModelfv;
        /*   76 */ PFNGLLIGHTMODELXPROC LightModelx;
        /*   77 */ PFNGLLIGHTMODELXVPROC LightModelxv;
        /*   78 */ PFNGLLIGHTFPROC Lightf;
        /*   79 */ PFNGLLIGHTFVPROC Lightfv;
        /*   80 */ PFNGLLIGHTXPROC Lightx;
        /*   81 */ PFNGLLIGHTXVPROC Lightxv;
        /*   82 */ PFNGLLINEWIDTHPROC LineWidth;
        /*   83 */ PFNGLLINEWIDTHXPROC LineWidthx;
        /*   84 */ PFNGLLOADIDENTITYPROC LoadIdentity;
        /*   85 */ PFNGLLOADMATRIXFPROC LoadMatrixf;
        /*   86 */ PFNGLLOADMATRIXXPROC LoadMatrixx;
        /*   87 */ PFNGLLOGICOPPROC LogicOp;
        /*   88 */ PFNGLMATERIALFPROC Materialf;
        /*   89 */ PFNGLMATERIALFVPROC Materialfv;
        /*   90 */ PFNGLMATERIALXPROC Materialx;
        /*   91 */ PFNGLMATERIALXVPROC Materialxv;
        /*   92 */ PFNGLMATRIXMODEPROC MatrixMode;
        /*   93 */ PFNGLMULTMATRIXFPROC MultMatrixf;
        /*   94 */ PFNGLMULTMATRIXXPROC MultMatrixx;
        /*   95 */ PFNGLMULTITEXCOORD4FPROC MultiTexCoord4f;
        /*   96 */ PFNGLMULTITEXCOORD4XPROC MultiTexCoord4x;
        /*   97 */ PFNGLNORMAL3FPROC Normal3f;
        /*   98 */ PFNGLNORMAL3XPROC Normal3x;
        /*   99 */ PFNGLNORMALPOINTERPROC NormalPointer;
        /*  100 */ PFNGLORTHOFPROC Orthof;
        /*  101 */ PFNGLORTHOXPROC Orthox;
        /*  102 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*  103 */ PFNGLPOINTPARAMETERFPROC PointParameterf;
        /*  104 */ PFNGLPOINTPARAMETERFVPROC PointParameterfv;
        /*  105 */ PFNGLPOINTPARAMETERXPROC PointParameterx;
        /*  106 */ PFNGLPOINTPARAMETERXVPROC PointParameterxv;
        /*  107 */ PFNGLPOINTSIZEPROC PointSize;
        /*  108 */ PFNGLPOINTSIZEXPROC PointSizex;
        /*  109 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*  110 */ PFNGLPOLYGONOFFSETXPROC PolygonOffsetx;
        /*  111 */ PFNGLPOPMATRIXPROC PopMatrix;
        /*  112 */ PFNGLPUSHMATRIXPROC PushMatrix;
        /*  113 */ PFNGLREADPIXELSPROC ReadPixels;
        /*  114 */ PFNGLROTATEFPROC Rotatef;
        /*  115 */ PFNGLROTATEXPROC Rotatex;
        /*  116 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*  117 */ PFNGLSAMPLECOVERAGEXPROC SampleCoveragex;
        /*  118 */ PFNGLSCALEFPROC Scalef;
        /*  119 */ PFNGLSCALEXPROC Scalex;
        /*  120 */ PFNGLSCISSORPROC Scissor;
        /*  121 */ PFNGLSHADEMODELPROC ShadeModel;
        /*  122 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*  123 */ PFNGLSTENCILMASKPROC StencilMask;
        /*  124 */ PFNGLSTENCILOPPROC StencilOp;
        /*  125 */ PFNGLTEXCOORDPOINTERPROC TexCoordPointer;
        /*  126 */ PFNGLTEXENVFPROC TexEnvf;
        /*  127 */ PFNGLTEXENVFVPROC TexEnvfv;
        /*  128 */ PFNGLTEXENVIPROC TexEnvi;
        /*  129 */ PFNGLTEXENVIVPROC TexEnviv;
        /*  130 */ PFNGLTEXENVXPROC TexEnvx;
        /*  131 */ PFNGLTEXENVXVPROC TexEnvxv;
        /*  132 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*  133 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*  134 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*  135 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*  136 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*  137 */ PFNGLTEXPARAMETERXPROC TexParameterx;
        /*  138 */ PFNGLTEXPARAMETERXVPROC TexParameterxv;
        /*  139 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*  140 */ PFNGLTRANSLATEFPROC Translatef;
        /*  141 */ PFNGLTRANSLATEXPROC Translatex;
        /*  142 */ PFNGLVERTEXPOINTERPROC VertexPointer;
        /*  143 */ PFNGLVIEWPORTPROC Viewport;
        /*  144 */ PFNGLBINDFRAMEBUFFEROESPROC BindFramebufferOES;
        /*  145 */ PFNGLBINDRENDERBUFFEROESPROC BindRenderbufferOES;
        /*  146 */ PFNGLCHECKFRAMEBUFFERSTATUSOESPROC CheckFramebufferStatusOES;
        /*  147 */ PFNGLDELETEFRAMEBUFFERSOESPROC DeleteFramebuffersOES;
        /*  148 */ PFNGLDELETERENDERBUFFERSOESPROC DeleteRenderbuffersOES;
        /*  149 */ PFNGLFRAMEBUFFERRENDERBUFFEROESPROC FramebufferRenderbufferOES;
        /*  150 */ PFNGLFRAMEBUFFERTEXTURE2DOESPROC FramebufferTexture2DOES;
        /*  151 */ PFNGLGENFRAMEBUFFERSOESPROC GenFramebuffersOES;
        /*  152 */ PFNGLGENRENDERBUFFERSOESPROC GenRenderbuffersOES;
        /*  153 */ PFNGLGENERATEMIPMAPOESPROC GenerateMipmapOES;
        /*  154 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVOESPROC GetFramebufferAttachmentParameterivOES;
        /*  155 */ PFNGLGETRENDERBUFFERPARAMETERIVOESPROC GetRenderbufferParameterivOES;
        /*  156 */ PFNGLISFRAMEBUFFEROESPROC IsFramebufferOES;
        /*  157 */ PFNGLISRENDERBUFFEROESPROC IsRenderbufferOES;
        /*  158 */ PFNGLRENDERBUFFERSTORAGEOESPROC RenderbufferStorageOES;
        };
    };

    /* Built-in loader library handle. Set by gloamVulkanInitialize*Context /
     * gloamLoaderLoad*Context when it opens the platform library. If the
     * caller pre-populates this field, the open is skipped and ownership is
     * NOT taken (gloam will not close it). Present on all context types so
     * user code can use a single field name regardless of API.
     */
    void *gloam_loader_handle;

    /* Non-zero if gloam opened the library handle itself and is responsible
     * for closing it in gloamVulkanFinalize / gloamLoaderUnload.
     */
    uint8_t gloam_loader_owns_handle;
} GloamGLContext;

/* Global context instance — a value, not a pointer, so the compiler knows
 * its address is fixed and does not re-load it on every access.
 */
extern GloamGLContext gloam_gl_context;

/* ---- Feature presence macros --------------------------------------------
