#ifndef GLOAM_GL_H
#define GLOAM_GL_H

#ifdef __clang__
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#endif
#ifdef __gl_h_
  #error OpenGL (gl.h) header already included (API: gl), remove previous include!
#endif
#define __gl_h_ 1
#ifdef __glext_h_
  #error OpenGL (glext.h) header already included (API: gl), remove previous include!
#endif
#define __glext_h_ 1
#ifdef __clang__
#pragma clang diagnostic pop
#endif

/* ---- Platform detection ------------------------------------------------ */
#ifndef GLOAM_PLATFORM_DETECTED_
#define GLOAM_PLATFORM_DETECTED_
#if defined(__CYGWIN__) || defined(_WIN32)
#  define GLOAM_PLATFORM_WINDOWS 1
#endif
#if defined(__linux)
#  define GLOAM_PLATFORM_LINUX 1
#endif
#endif /* GLOAM_PLATFORM_DETECTED_ */

#ifndef GLOAM_HAS_ENUM_BASE_TYPE
#if defined(__cplusplus) || (defined(__STDC_VERSION__) && __STDC_VERSION__ >= 202311L)
#  define GLOAM_HAS_ENUM_BASE_TYPE 1
#else
#  define GLOAM_HAS_ENUM_BASE_TYPE 0
#endif
#endif

#include <stddef.h>
#include <stdint.h>

#include "KHR/khrplatform.h"

#ifdef __cplusplus
extern "C" {
#endif

/* Calling convention */
#ifndef APIENTRY
#  if defined(GLOAM_PLATFORM_WINDOWS)
#    define APIENTRY __stdcall
#  else
#    define APIENTRY
#  endif
#endif
#ifndef APIENTRYP
#  define APIENTRYP APIENTRY *
#endif
#ifndef GLAPI
#  define GLAPI extern
#endif

/* Calling convention for GL callback function pointers (e.g. debug callbacks,

typedef void (APIENTRYP PFNGLGENSAMPLERSPROC)(GLsizei count, GLuint * samplers);
typedef GLint (APIENTRYP PFNGLGETFRAGDATAINDEXPROC)(GLuint program, const GLchar * name);
typedef void (APIENTRYP PFNGLGETQUERYOBJECTI64VPROC)(GLuint id, GLenum pname, GLint64 * params);
typedef void (APIENTRYP PFNGLGETQUERYOBJECTUI64VPROC)(GLuint id, GLenum pname, GLuint64 * params);
typedef void (APIENTRYP PFNGLGETSAMPLERPARAMETERIIVPROC)(GLuint sampler, GLenum pname, GLint * params);
typedef void (APIENTRYP PFNGLGETSAMPLERPARAMETERIUIVPROC)(GLuint sampler, GLenum pname, GLuint * params);
typedef void (APIENTRYP PFNGLGETSAMPLERPARAMETERFVPROC)(GLuint sampler, GLenum pname, GLfloat * params);
typedef void (APIENTRYP PFNGLGETSAMPLERPARAMETERIVPROC)(GLuint sampler, GLenum pname, GLint * params);
typedef GLboolean (APIENTRYP PFNGLISSAMPLERPROC)(GLuint sampler);
typedef void (APIENTRYP PFNGLQUERYCOUNTERPROC)(GLuint id, GLenum target);
typedef void (APIENTRYP PFNGLSAMPLERPARAMETERIIVPROC)(GLuint sampler, GLenum pname, const GLint * param);
typedef void (APIENTRYP PFNGLSAMPLERPARAMETERIUIVPROC)(GLuint sampler, GLenum pname, const GLuint * param);
typedef void (APIENTRYP PFNGLSAMPLERPARAMETERFPROC)(GLuint sampler, GLenum pname, GLfloat param);
typedef void (APIENTRYP PFNGLSAMPLERPARAMETERFVPROC)(GLuint sampler, GLenum pname, const GLfloat * param);
typedef void (APIENTRYP PFNGLSAMPLERPARAMETERIPROC)(GLuint sampler, GLenum pname, GLint param);
typedef void (APIENTRYP PFNGLSAMPLERPARAMETERIVPROC)(GLuint sampler, GLenum pname, const GLint * param);
typedef void (APIENTRYP PFNGLVERTEXATTRIBDIVISORPROC)(GLuint index, GLuint divisor);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP1UIPROC)(GLuint index, GLenum type, GLboolean normalized, GLuint value);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP1UIVPROC)(GLuint index, GLenum type, GLboolean normalized, const GLuint * value);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP2UIPROC)(GLuint index, GLenum type, GLboolean normalized, GLuint value);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP2UIVPROC)(GLuint index, GLenum type, GLboolean normalized, const GLuint * value);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP3UIPROC)(GLuint index, GLenum type, GLboolean normalized, GLuint value);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP3UIVPROC)(GLuint index, GLenum type, GLboolean normalized, const GLuint * value);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP4UIPROC)(GLuint index, GLenum type, GLboolean normalized, GLuint value);
typedef void (APIENTRYP PFNGLVERTEXATTRIBP4UIVPROC)(GLuint index, GLenum type, GLboolean normalized, const GLuint * value);


/* ---- Context struct ------------------------------------------------------
 * Three anonymous unions give both indexed (array) and named (struct member)
 * access to the same memory, at zero runtime cost.
 *
 * featArray / extArray: unsigned char flags, one per feature / extension.
 * pfnArray: function pointer slots, one per command.
 *
 * Anonymous structs inside the unions are a C11 / GCC extension; they are
 * universally supported on our target compilers.
 */
typedef struct GloamGLContext {
    union {
        unsigned char featArray[12];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        /*    4 */ unsigned char VERSION_1_4;
        /*    5 */ unsigned char VERSION_1_5;
        /*    6 */ unsigned char VERSION_2_0;
        /*    7 */ unsigned char VERSION_2_1;
        /*    8 */ unsigned char VERSION_3_0;
        /*    9 */ unsigned char VERSION_3_1;
        /*   10 */ unsigned char VERSION_3_2;
        /*   11 */ unsigned char VERSION_3_3;
        };
    };

    union {
        void *pfnArray[344];
        struct {
        /*    0 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*    1 */ PFNGLCLEARPROC Clear;
        /*    2 */ PFNGLCLEARCOLORPROC ClearColor;
        /*    3 */ PFNGLCLEARDEPTHPROC ClearDepth;
        /*    4 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*    5 */ PFNGLCOLORMASKPROC ColorMask;
        /*    6 */ PFNGLCULLFACEPROC CullFace;
        /*    7 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*    8 */ PFNGLDEPTHMASKPROC DepthMask;
        /*    9 */ PFNGLDEPTHRANGEPROC DepthRange;
        /*   10 */ PFNGLDISABLEPROC Disable;
        /*   11 */ PFNGLDRAWBUFFERPROC DrawBuffer;
        /*   12 */ PFNGLENABLEPROC Enable;
        /*   13 */ PFNGLFINISHPROC Finish;
        /*   14 */ PFNGLFLUSHPROC Flush;
        /*   15 */ PFNGLFRONTFACEPROC FrontFace;
        /*   16 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*   17 */ PFNGLGETDOUBLEVPROC GetDoublev;
        /*   18 */ PFNGLGETERRORPROC GetError;
        /*   19 */ PFNGLGETFLOATVPROC GetFloatv;
        /*   20 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*   21 */ PFNGLGETSTRINGPROC GetString;
        /*   22 */ PFNGLGETTEXIMAGEPROC GetTexImage;
        /*   23 */ PFNGLGETTEXLEVELPARAMETERFVPROC GetTexLevelParameterfv;
        /*   24 */ PFNGLGETTEXLEVELPARAMETERIVPROC GetTexLevelParameteriv;
        /*   25 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*   26 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*   27 */ PFNGLHINTPROC Hint;
        /*   28 */ PFNGLISENABLEDPROC IsEnabled;
        /*   29 */ PFNGLLINEWIDTHPROC LineWidth;
        /*   30 */ PFNGLLOGICOPPROC LogicOp;
        /*   31 */ PFNGLPIXELSTOREFPROC PixelStoref;
        /*   32 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*   33 */ PFNGLPOINTSIZEPROC PointSize;
        /*   34 */ PFNGLPOLYGONMODEPROC PolygonMode;
        /*   35 */ PFNGLREADBUFFERPROC ReadBuffer;
        /*   36 */ PFNGLREADPIXELSPROC ReadPixels;
        /*   37 */ PFNGLSCISSORPROC Scissor;
        /*   38 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*   39 */ PFNGLSTENCILMASKPROC StencilMask;
        /*   40 */ PFNGLSTENCILOPPROC StencilOp;
        /*   41 */ PFNGLTEXIMAGE1DPROC TexImage1D;
        /*   42 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*   43 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*   44 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*   45 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*   46 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*   47 */ PFNGLVIEWPORTPROC Viewport;
        /*   48 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*   49 */ PFNGLCOPYTEXIMAGE1DPROC CopyTexImage1D;
        /*   50 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*   51 */ PFNGLCOPYTEXSUBIMAGE1DPROC CopyTexSubImage1D;
        /*   52 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*   53 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*   54 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*   55 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*   56 */ PFNGLGENTEXTURESPROC GenTextures;
        /*   57 */ PFNGLISTEXTUREPROC IsTexture;
        /*   58 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*   59 */ PFNGLTEXSUBIMAGE1DPROC TexSubImage1D;
        /*   60 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*   61 */ PFNGLCOPYTEXSUBIMAGE3DPROC CopyTexSubImage3D;
        /*   62 */ PFNGLDRAWRANGEELEMENTSPROC DrawRangeElements;
        /*   63 */ PFNGLTEXIMAGE3DPROC TexImage3D;
        /*   64 */ PFNGLTEXSUBIMAGE3DPROC TexSubImage3D;
        /*   65 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*   66 */ PFNGLCOMPRESSEDTEXIMAGE1DPROC CompressedTexImage1D;
        /*   67 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*   68 */ PFNGLCOMPRESSEDTEXIMAGE3DPROC CompressedTexImage3D;
        /*   69 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DPROC CompressedTexSubImage1D;
        /*   70 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*   71 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC CompressedTexSubImage3D;
        /*   72 */ PFNGLGETCOMPRESSEDTEXIMAGEPROC GetCompressedTexImage;
        /*   73 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*   74 */ PFNGLBLENDCOLORPROC BlendColor;
        /*   75 */ PFNGLBLENDEQUATIONPROC BlendEquation;
        /*   76 */ PFNGLBLENDFUNCSEPARATEPROC BlendFuncSeparate;
        /*   77 */ PFNGLMULTIDRAWARRAYSPROC MultiDrawArrays;
        /*   78 */ PFNGLMULTIDRAWELEMENTSPROC MultiDrawElements;
        /*   79 */ PFNGLPOINTPARAMETERFPROC PointParameterf;
        /*   80 */ PFNGLPOINTPARAMETERFVPROC PointParameterfv;
        /*   81 */ PFNGLPOINTPARAMETERIPROC PointParameteri;
        /*   82 */ PFNGLPOINTPARAMETERIVPROC PointParameteriv;
        /*   83 */ PFNGLBEGINQUERYPROC BeginQuery;
        /*   84 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*   85 */ PFNGLBUFFERDATAPROC BufferData;
        /*   86 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*   87 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*   88 */ PFNGLDELETEQUERIESPROC DeleteQueries;
        /*   89 */ PFNGLENDQUERYPROC EndQuery;
        /*   90 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*   91 */ PFNGLGENQUERIESPROC GenQueries;
        /*   92 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*   93 */ PFNGLGETBUFFERPOINTERVPROC GetBufferPointerv;
        /*   94 */ PFNGLGETBUFFERSUBDATAPROC GetBufferSubData;
        /*   95 */ PFNGLGETQUERYOBJECTIVPROC GetQueryObjectiv;
        /*   96 */ PFNGLGETQUERYOBJECTUIVPROC GetQueryObjectuiv;
        /*   97 */ PFNGLGETQUERYIVPROC GetQueryiv;
        /*   98 */ PFNGLISBUFFERPROC IsBuffer;
        /*   99 */ PFNGLISQUERYPROC IsQuery;
        /*  100 */ PFNGLMAPBUFFERPROC MapBuffer;
        /*  101 */ PFNGLUNMAPBUFFERPROC UnmapBuffer;
        /*  102 */ PFNGLATTACHSHADERPROC AttachShader;
        /*  103 */ PFNGLBINDATTRIBLOCATIONPROC BindAttribLocation;
        /*  104 */ PFNGLBLENDEQUATIONSEPARATEPROC BlendEquationSeparate;
        /*  105 */ PFNGLCOMPILESHADERPROC CompileShader;
        /*  106 */ PFNGLCREATEPROGRAMPROC CreateProgram;
        /*  107 */ PFNGLCREATESHADERPROC CreateShader;
        /*  108 */ PFNGLDELETEPROGRAMPROC DeleteProgram;
        /*  109 */ PFNGLDELETESHADERPROC DeleteShader;
        /*  110 */ PFNGLDETACHSHADERPROC DetachShader;
        /*  111 */ PFNGLDISABLEVERTEXATTRIBARRAYPROC DisableVertexAttribArray;
        /*  112 */ PFNGLDRAWBUFFERSPROC DrawBuffers;
        /*  113 */ PFNGLENABLEVERTEXATTRIBARRAYPROC EnableVertexAttribArray;
        /*  114 */ PFNGLGETACTIVEATTRIBPROC GetActiveAttrib;
        /*  115 */ PFNGLGETACTIVEUNIFORMPROC GetActiveUniform;
        /*  116 */ PFNGLGETATTACHEDSHADERSPROC GetAttachedShaders;
        /*  117 */ PFNGLGETATTRIBLOCATIONPROC GetAttribLocation;
        /*  118 */ PFNGLGETPROGRAMINFOLOGPROC GetProgramInfoLog;
        /*  119 */ PFNGLGETPROGRAMIVPROC GetProgramiv;
        /*  120 */ PFNGLGETSHADERINFOLOGPROC GetShaderInfoLog;
        /*  121 */ PFNGLGETSHADERSOURCEPROC GetShaderSource;
        /*  122 */ PFNGLGETSHADERIVPROC GetShaderiv;
        /*  123 */ PFNGLGETUNIFORMLOCATIONPROC GetUniformLocation;
        /*  124 */ PFNGLGETUNIFORMFVPROC GetUniformfv;
        /*  125 */ PFNGLGETUNIFORMIVPROC GetUniformiv;
        /*  126 */ PFNGLGETVERTEXATTRIBPOINTERVPROC GetVertexAttribPointerv;
        /*  127 */ PFNGLGETVERTEXATTRIBDVPROC GetVertexAttribdv;
        /*  128 */ PFNGLGETVERTEXATTRIBFVPROC GetVertexAttribfv;
        /*  129 */ PFNGLGETVERTEXATTRIBIVPROC GetVertexAttribiv;
        /*  130 */ PFNGLISPROGRAMPROC IsProgram;
        /*  131 */ PFNGLISSHADERPROC IsShader;
        /*  132 */ PFNGLLINKPROGRAMPROC LinkProgram;
        /*  133 */ PFNGLSHADERSOURCEPROC ShaderSource;
        /*  134 */ PFNGLSTENCILFUNCSEPARATEPROC StencilFuncSeparate;
        /*  135 */ PFNGLSTENCILMASKSEPARATEPROC StencilMaskSeparate;
        /*  136 */ PFNGLSTENCILOPSEPARATEPROC StencilOpSeparate;
        /*  137 */ PFNGLUNIFORM1FPROC Uniform1f;
        /*  138 */ PFNGLUNIFORM1FVPROC Uniform1fv;
        /*  139 */ PFNGLUNIFORM1IPROC Uniform1i;
        /*  140 */ PFNGLUNIFORM1IVPROC Uniform1iv;
        /*  141 */ PFNGLUNIFORM2FPROC Uniform2f;
        /*  142 */ PFNGLUNIFORM2FVPROC Uniform2fv;
        /*  143 */ PFNGLUNIFORM2IPROC Uniform2i;
        /*  144 */ PFNGLUNIFORM2IVPROC Uniform2iv;
        /*  145 */ PFNGLUNIFORM3FPROC Uniform3f;
        /*  146 */ PFNGLUNIFORM3FVPROC Uniform3fv;
        /*  147 */ PFNGLUNIFORM3IPROC Uniform3i;
        /*  148 */ PFNGLUNIFORM3IVPROC Uniform3iv;
        /*  149 */ PFNGLUNIFORM4FPROC Uniform4f;
        /*  150 */ PFNGLUNIFORM4FVPROC Uniform4fv;
        /*  151 */ PFNGLUNIFORM4IPROC Uniform4i;
        /*  152 */ PFNGLUNIFORM4IVPROC Uniform4iv;
        /*  153 */ PFNGLUNIFORMMATRIX2FVPROC UniformMatrix2fv;
        /*  154 */ PFNGLUNIFORMMATRIX3FVPROC UniformMatrix3fv;
        /*  155 */ PFNGLUNIFORMMATRIX4FVPROC UniformMatrix4fv;
        /*  156 */ PFNGLUSEPROGRAMPROC UseProgram;
        /*  157 */ PFNGLVALIDATEPROGRAMPROC ValidateProgram;
        /*  158 */ PFNGLVERTEXATTRIB1DPROC VertexAttrib1d;
        /*  159 */ PFNGLVERTEXATTRIB1DVPROC VertexAttrib1dv;
        /*  160 */ PFNGLVERTEXATTRIB1FPROC VertexAttrib1f;
        /*  161 */ PFNGLVERTEXATTRIB1FVPROC VertexAttrib1fv;
        /*  162 */ PFNGLVERTEXATTRIB1SPROC VertexAttrib1s;
        /*  163 */ PFNGLVERTEXATTRIB1SVPROC VertexAttrib1sv;
        /*  164 */ PFNGLVERTEXATTRIB2DPROC VertexAttrib2d;
        /*  165 */ PFNGLVERTEXATTRIB2DVPROC VertexAttrib2dv;
        /*  166 */ PFNGLVERTEXATTRIB2FPROC VertexAttrib2f;
        /*  167 */ PFNGLVERTEXATTRIB2FVPROC VertexAttrib2fv;
        /*  168 */ PFNGLVERTEXATTRIB2SPROC VertexAttrib2s;
        /*  169 */ PFNGLVERTEXATTRIB2SVPROC VertexAttrib2sv;
        /*  170 */ PFNGLVERTEXATTRIB3DPROC VertexAttrib3d;
        /*  171 */ PFNGLVERTEXATTRIB3DVPROC VertexAttrib3dv;
        /*  172 */ PFNGLVERTEXATTRIB3FPROC VertexAttrib3f;
        /*  173 */ PFNGLVERTEXATTRIB3FVPROC VertexAttrib3fv;
        /*  174 */ PFNGLVERTEXATTRIB3SPROC VertexAttrib3s;
        /*  175 */ PFNGLVERTEXATTRIB3SVPROC VertexAttrib3sv;
        /*  176 */ PFNGLVERTEXATTRIB4NBVPROC VertexAttrib4Nbv;
        /*  177 */ PFNGLVERTEXATTRIB4NIVPROC VertexAttrib4Niv;
        /*  178 */ PFNGLVERTEXATTRIB4NSVPROC VertexAttrib4Nsv;
        /*  179 */ PFNGLVERTEXATTRIB4NUBPROC VertexAttrib4Nub;
        /*  180 */ PFNGLVERTEXATTRIB4NUBVPROC VertexAttrib4Nubv;
        /*  181 */ PFNGLVERTEXATTRIB4NUIVPROC VertexAttrib4Nuiv;
        /*  182 */ PFNGLVERTEXATTRIB4NUSVPROC VertexAttrib4Nusv;
        /*  183 */ PFNGLVERTEXATTRIB4BVPROC VertexAttrib4bv;
        /*  184 */ PFNGLVERTEXATTRIB4DPROC VertexAttrib4d;
        /*  185 */ PFNGLVERTEXATTRIB4DVPROC VertexAttrib4dv;
        /*  186 */ PFNGLVERTEXATTRIB4FPROC VertexAttrib4f;
        /*  187 */ PFNGLVERTEXATTRIB4FVPROC VertexAttrib4fv;
        /*  188 */ PFNGLVERTEXATTRIB4IVPROC VertexAttrib4iv;
        /*  189 */ PFNGLVERTEXATTRIB4SPROC VertexAttrib4s;
        /*  190 */ PFNGLVERTEXATTRIB4SVPROC VertexAttrib4sv;
        /*  191 */ PFNGLVERTEXATTRIB4UBVPROC VertexAttrib4ubv;
        /*  192 */ PFNGLVERTEXATTRIB4UIVPROC VertexAttrib4uiv;
        /*  193 */ PFNGLVERTEXATTRIB4USVPROC VertexAttrib4usv;
        /*  194 */ PFNGLVERTEXATTRIBPOINTERPROC VertexAttribPointer;
        /*  195 */ PFNGLUNIFORMMATRIX2X3FVPROC UniformMatrix2x3fv;
        /*  196 */ PFNGLUNIFORMMATRIX2X4FVPROC UniformMatrix2x4fv;
        /*  197 */ PFNGLUNIFORMMATRIX3X2FVPROC UniformMatrix3x2fv;
        /*  198 */ PFNGLUNIFORMMATRIX3X4FVPROC UniformMatrix3x4fv;
        /*  199 */ PFNGLUNIFORMMATRIX4X2FVPROC UniformMatrix4x2fv;
        /*  200 */ PFNGLUNIFORMMATRIX4X3FVPROC UniformMatrix4x3fv;
        /*  201 */ PFNGLBEGINCONDITIONALRENDERPROC BeginConditionalRender;
        /*  202 */ PFNGLBEGINTRANSFORMFEEDBACKPROC BeginTransformFeedback;
        /*  203 */ PFNGLBINDFRAGDATALOCATIONPROC BindFragDataLocation;
        /*  204 */ PFNGLBINDFRAMEBUFFERPROC BindFramebuffer;
        /*  205 */ PFNGLBINDRENDERBUFFERPROC BindRenderbuffer;
        /*  206 */ PFNGLBINDVERTEXARRAYPROC BindVertexArray;
        /*  207 */ PFNGLBLITFRAMEBUFFERPROC BlitFramebuffer;
        /*  208 */ PFNGLCHECKFRAMEBUFFERSTATUSPROC CheckFramebufferStatus;
        /*  209 */ PFNGLCLAMPCOLORPROC ClampColor;
        /*  210 */ PFNGLCLEARBUFFERFIPROC ClearBufferfi;
        /*  211 */ PFNGLCLEARBUFFERFVPROC ClearBufferfv;
        /*  212 */ PFNGLCLEARBUFFERIVPROC ClearBufferiv;
        /*  213 */ PFNGLCLEARBUFFERUIVPROC ClearBufferuiv;
        /*  214 */ PFNGLCOLORMASKIPROC ColorMaski;
        /*  215 */ PFNGLDELETEFRAMEBUFFERSPROC DeleteFramebuffers;
        /*  216 */ PFNGLDELETERENDERBUFFERSPROC DeleteRenderbuffers;
        /*  217 */ PFNGLDELETEVERTEXARRAYSPROC DeleteVertexArrays;
        /*  218 */ PFNGLDISABLEIPROC Disablei;
        /*  219 */ PFNGLENABLEIPROC Enablei;
        /*  220 */ PFNGLENDCONDITIONALRENDERPROC EndConditionalRender;
        /*  221 */ PFNGLENDTRANSFORMFEEDBACKPROC EndTransformFeedback;
        /*  222 */ PFNGLFLUSHMAPPEDBUFFERRANGEPROC FlushMappedBufferRange;
        /*  223 */ PFNGLFRAMEBUFFERRENDERBUFFERPROC FramebufferRenderbuffer;
        /*  224 */ PFNGLFRAMEBUFFERTEXTURE1DPROC FramebufferTexture1D;
        /*  225 */ PFNGLFRAMEBUFFERTEXTURE2DPROC FramebufferTexture2D;
        /*  226 */ PFNGLFRAMEBUFFERTEXTURE3DPROC FramebufferTexture3D;
        /*  227 */ PFNGLFRAMEBUFFERTEXTURELAYERPROC FramebufferTextureLayer;
        /*  228 */ PFNGLGENFRAMEBUFFERSPROC GenFramebuffers;
        /*  229 */ PFNGLGENRENDERBUFFERSPROC GenRenderbuffers;
        /*  230 */ PFNGLGENVERTEXARRAYSPROC GenVertexArrays;
        /*  231 */ PFNGLGENERATEMIPMAPPROC GenerateMipmap;
        /*  232 */ PFNGLGETBOOLEANI_VPROC GetBooleani_v;
        /*  233 */ PFNGLGETFRAGDATALOCATIONPROC GetFragDataLocation;
        /*  234 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetFramebufferAttachmentParameteriv;
        /*  235 */ PFNGLGETRENDERBUFFERPARAMETERIVPROC GetRenderbufferParameteriv;
        /*  236 */ PFNGLGETSTRINGIPROC GetStringi;
        /*  237 */ PFNGLGETTEXPARAMETERIIVPROC GetTexParameterIiv;
        /*  238 */ PFNGLGETTEXPARAMETERIUIVPROC GetTexParameterIuiv;
        /*  239 */ PFNGLGETTRANSFORMFEEDBACKVARYINGPROC GetTransformFeedbackVarying;
        /*  240 */ PFNGLGETUNIFORMUIVPROC GetUniformuiv;
        /*  241 */ PFNGLGETVERTEXATTRIBIIVPROC GetVertexAttribIiv;
        /*  242 */ PFNGLGETVERTEXATTRIBIUIVPROC GetVertexAttribIuiv;
        /*  243 */ PFNGLISENABLEDIPROC IsEnabledi;
        /*  244 */ PFNGLISFRAMEBUFFERPROC IsFramebuffer;
        /*  245 */ PFNGLISRENDERBUFFERPROC IsRenderbuffer;
        /*  246 */ PFNGLISVERTEXARRAYPROC IsVertexArray;
        /*  247 */ PFNGLMAPBUFFERRANGEPROC MapBufferRange;
        /*  248 */ PFNGLRENDERBUFFERSTORAGEPROC RenderbufferStorage;
        /*  249 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEPROC RenderbufferStorageMultisample;
        /*  250 */ PFNGLTEXPARAMETERIIVPROC TexParameterIiv;
        /*  251 */ PFNGLTEXPARAMETERIUIVPROC TexParameterIuiv;
        /*  252 */ PFNGLTRANSFORMFEEDBACKVARYINGSPROC TransformFeedbackVaryings;
        /*  253 */ PFNGLUNIFORM1UIPROC Uniform1ui;
        /*  254 */ PFNGLUNIFORM1UIVPROC Uniform1uiv;
        /*  255 */ PFNGLUNIFORM2UIPROC Uniform2ui;
        /*  256 */ PFNGLUNIFORM2UIVPROC Uniform2uiv;
        /*  257 */ PFNGLUNIFORM3UIPROC Uniform3ui;
        /*  258 */ PFNGLUNIFORM3UIVPROC Uniform3uiv;
        /*  259 */ PFNGLUNIFORM4UIPROC Uniform4ui;
        /*  260 */ PFNGLUNIFORM4UIVPROC Uniform4uiv;
        /*  261 */ PFNGLVERTEXATTRIBI1IPROC VertexAttribI1i;
        /*  262 */ PFNGLVERTEXATTRIBI1IVPROC VertexAttribI1iv;
        /*  263 */ PFNGLVERTEXATTRIBI1UIPROC VertexAttribI1ui;
        /*  264 */ PFNGLVERTEXATTRIBI1UIVPROC VertexAttribI1uiv;
        /*  265 */ PFNGLVERTEXATTRIBI2IPROC VertexAttribI2i;
        /*  266 */ PFNGLVERTEXATTRIBI2IVPROC VertexAttribI2iv;
        /*  267 */ PFNGLVERTEXATTRIBI2UIPROC VertexAttribI2ui;
        /*  268 */ PFNGLVERTEXATTRIBI2UIVPROC VertexAttribI2uiv;
        /*  269 */ PFNGLVERTEXATTRIBI3IPROC VertexAttribI3i;
        /*  270 */ PFNGLVERTEXATTRIBI3IVPROC VertexAttribI3iv;
        /*  271 */ PFNGLVERTEXATTRIBI3UIPROC VertexAttribI3ui;
        /*  272 */ PFNGLVERTEXATTRIBI3UIVPROC VertexAttribI3uiv;
        /*  273 */ PFNGLVERTEXATTRIBI4BVPROC VertexAttribI4bv;
        /*  274 */ PFNGLVERTEXATTRIBI4IPROC VertexAttribI4i;
        /*  275 */ PFNGLVERTEXATTRIBI4IVPROC VertexAttribI4iv;
        /*  276 */ PFNGLVERTEXATTRIBI4SVPROC VertexAttribI4sv;
        /*  277 */ PFNGLVERTEXATTRIBI4UBVPROC VertexAttribI4ubv;
        /*  278 */ PFNGLVERTEXATTRIBI4UIPROC VertexAttribI4ui;
        /*  279 */ PFNGLVERTEXATTRIBI4UIVPROC VertexAttribI4uiv;
        /*  280 */ PFNGLVERTEXATTRIBI4USVPROC VertexAttribI4usv;
        /*  281 */ PFNGLVERTEXATTRIBIPOINTERPROC VertexAttribIPointer;
        /*  282 */ PFNGLBINDBUFFERBASEPROC BindBufferBase;
        /*  283 */ PFNGLBINDBUFFERRANGEPROC BindBufferRange;
        /*  284 */ PFNGLGETINTEGERI_VPROC GetIntegeri_v;
        /*  285 */ PFNGLCOPYBUFFERSUBDATAPROC CopyBufferSubData;
        /*  286 */ PFNGLDRAWARRAYSINSTANCEDPROC DrawArraysInstanced;
        /*  287 */ PFNGLDRAWELEMENTSINSTANCEDPROC DrawElementsInstanced;
        /*  288 */ PFNGLGETACTIVEUNIFORMBLOCKNAMEPROC GetActiveUniformBlockName;
        /*  289 */ PFNGLGETACTIVEUNIFORMBLOCKIVPROC GetActiveUniformBlockiv;
        /*  290 */ PFNGLGETACTIVEUNIFORMNAMEPROC GetActiveUniformName;
        /*  291 */ PFNGLGETACTIVEUNIFORMSIVPROC GetActiveUniformsiv;
        /*  292 */ PFNGLGETUNIFORMBLOCKINDEXPROC GetUniformBlockIndex;
        /*  293 */ PFNGLGETUNIFORMINDICESPROC GetUniformIndices;
        /*  294 */ PFNGLPRIMITIVERESTARTINDEXPROC PrimitiveRestartIndex;
        /*  295 */ PFNGLTEXBUFFERPROC TexBuffer;
        /*  296 */ PFNGLUNIFORMBLOCKBINDINGPROC UniformBlockBinding;
        /*  297 */ PFNGLCLIENTWAITSYNCPROC ClientWaitSync;
        /*  298 */ PFNGLDELETESYNCPROC DeleteSync;
        /*  299 */ PFNGLDRAWELEMENTSBASEVERTEXPROC DrawElementsBaseVertex;
        /*  300 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXPROC DrawElementsInstancedBaseVertex;
        /*  301 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXPROC DrawRangeElementsBaseVertex;
        /*  302 */ PFNGLFENCESYNCPROC FenceSync;
        /*  303 */ PFNGLFRAMEBUFFERTEXTUREPROC FramebufferTexture;
        /*  304 */ PFNGLGETBUFFERPARAMETERI64VPROC GetBufferParameteri64v;
        /*  305 */ PFNGLGETINTEGER64I_VPROC GetInteger64i_v;
        /*  306 */ PFNGLGETINTEGER64VPROC GetInteger64v;
        /*  307 */ PFNGLGETMULTISAMPLEFVPROC GetMultisamplefv;
        /*  308 */ PFNGLGETSYNCIVPROC GetSynciv;
        /*  309 */ PFNGLISSYNCPROC IsSync;
        /*  310 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXPROC MultiDrawElementsBaseVertex;
        /*  311 */ PFNGLPROVOKINGVERTEXPROC ProvokingVertex;
        /*  312 */ PFNGLSAMPLEMASKIPROC SampleMaski;
        /*  313 */ PFNGLTEXIMAGE2DMULTISAMPLEPROC TexImage2DMultisample;
        /*  314 */ PFNGLTEXIMAGE3DMULTISAMPLEPROC TexImage3DMultisample;
        /*  315 */ PFNGLWAITSYNCPROC WaitSync;
        /*  316 */ PFNGLBINDFRAGDATALOCATIONINDEXEDPROC BindFragDataLocationIndexed;
        /*  317 */ PFNGLBINDSAMPLERPROC BindSampler;
        /*  318 */ PFNGLDELETESAMPLERSPROC DeleteSamplers;
        /*  319 */ PFNGLGENSAMPLERSPROC GenSamplers;
        /*  320 */ PFNGLGETFRAGDATAINDEXPROC GetFragDataIndex;
        /*  321 */ PFNGLGETQUERYOBJECTI64VPROC GetQueryObjecti64v;
        /*  322 */ PFNGLGETQUERYOBJECTUI64VPROC GetQueryObjectui64v;
        /*  323 */ PFNGLGETSAMPLERPARAMETERIIVPROC GetSamplerParameterIiv;
        /*  324 */ PFNGLGETSAMPLERPARAMETERIUIVPROC GetSamplerParameterIuiv;
        /*  325 */ PFNGLGETSAMPLERPARAMETERFVPROC GetSamplerParameterfv;
        /*  326 */ PFNGLGETSAMPLERPARAMETERIVPROC GetSamplerParameteriv;
        /*  327 */ PFNGLISSAMPLERPROC IsSampler;
        /*  328 */ PFNGLQUERYCOUNTERPROC QueryCounter;
        /*  329 */ PFNGLSAMPLERPARAMETERIIVPROC SamplerParameterIiv;
        /*  330 */ PFNGLSAMPLERPARAMETERIUIVPROC SamplerParameterIuiv;
        /*  331 */ PFNGLSAMPLERPARAMETERFPROC SamplerParameterf;
        /*  332 */ PFNGLSAMPLERPARAMETERFVPROC SamplerParameterfv;
        /*  333 */ PFNGLSAMPLERPARAMETERIPROC SamplerParameteri;
        /*  334 */ PFNGLSAMPLERPARAMETERIVPROC SamplerParameteriv;
        /*  335 */ PFNGLVERTEXATTRIBDIVISORPROC VertexAttribDivisor;
        /*  336 */ PFNGLVERTEXATTRIBP1UIPROC VertexAttribP1ui;
        /*  337 */ PFNGLVERTEXATTRIBP1UIVPROC VertexAttribP1uiv;
        /*  338 */ PFNGLVERTEXATTRIBP2UIPROC VertexAttribP2ui;
        /*  339 */ PFNGLVERTEXATTRIBP2UIVPROC VertexAttribP2uiv;
        /*  340 */ PFNGLVERTEXATTRIBP3UIPROC VertexAttribP3ui;
        /*  341 */ PFNGLVERTEXATTRIBP3UIVPROC VertexAttribP3uiv;
        /*  342 */ PFNGLVERTEXATTRIBP4UIPROC VertexAttribP4ui;
        /*  343 */ PFNGLVERTEXATTRIBP4UIVPROC VertexAttribP4uiv;
        };
    };

    /* Built-in loader library handle. Set by gloamVulkanInitialize*Context /
     * gloamLoaderLoad*Context when it opens the platform library. If the
     * caller pre-populates this field, the open is skipped and ownership is
     * NOT taken (gloam will not close it). Present on all context types so
     * user code can use a single field name regardless of API.
     */
    void *gloam_loader_handle;

    /* Non-zero if gloam opened the library handle itself and is responsible
     * for closing it in gloamVulkanFinalize / gloamLoaderUnload.
     */
    uint8_t gloam_loader_owns_handle;
} GloamGLContext;

/* Global context instance — a value, not a pointer, so the compiler knows
 * its address is fixed and does not re-load it on every access.
 */
extern GloamGLContext gloam_gl_context;

/* ---- Feature presence macros --------------------------------------------
