#ifndef GLOAM_VK_H
#define GLOAM_VK_H


/* ---- Platform detection ------------------------------------------------ */
#ifndef GLOAM_PLATFORM_DETECTED_
#define GLOAM_PLATFORM_DETECTED_
#if defined(__CYGWIN__) || defined(_WIN32)
#  define GLOAM_PLATFORM_WINDOWS 1
#endif
#if defined(__linux)
#  define GLOAM_PLATFORM_LINUX 1
#endif
#endif /* GLOAM_PLATFORM_DETECTED_ */

#ifndef GLOAM_HAS_ENUM_BASE_TYPE
#if defined(__cplusplus) || (defined(__STDC_VERSION__) && __STDC_VERSION__ >= 202311L)
#  define GLOAM_HAS_ENUM_BASE_TYPE 1
#else
#  define GLOAM_HAS_ENUM_BASE_TYPE 0
#endif
#endif

#ifndef GLOAM_FORCE_INLINE
#if defined(_MSC_VER)
#  define GLOAM_FORCE_INLINE static __forceinline
#elif defined(__GNUC__) || defined(__clang__)
#  define GLOAM_FORCE_INLINE static inline __attribute__((always_inline))
#else
#  define GLOAM_FORCE_INLINE static inline
#endif
#endif

#ifndef VK_NO_PROTOTYPES
#define VK_NO_PROTOTYPES
#endif

#ifndef VULKAN_H_
#include <vulkan/vk_platform.h>
#include <vulkan/vulkan_core.h>
#endif

#if !defined(VULKAN_H_)

#ifdef VK_USE_PLATFORM_ANDROID_KHR
#include <vulkan/vulkan_android.h>
#endif

#ifdef VK_USE_PLATFORM_FUCHSIA
#include <zircon/types.h>
#include <vulkan/vulkan_fuchsia.h>
#endif

#ifdef VK_USE_PLATFORM_IOS_MVK
#include <vulkan/vulkan_ios.h>
#endif

#ifdef VK_USE_PLATFORM_MACOS_MVK
#include <vulkan/vulkan_macos.h>
#endif

#ifdef VK_USE_PLATFORM_METAL_EXT
#include <vulkan/vulkan_metal.h>
#endif

#ifdef VK_USE_PLATFORM_VI_NN
#include <vulkan/vulkan_vi.h>
#endif

#ifdef VK_USE_PLATFORM_WAYLAND_KHR
#include <vulkan/vulkan_wayland.h>
#endif

#ifdef VK_USE_PLATFORM_WIN32_KHR
typedef unsigned long DWORD;
typedef const wchar_t* LPCWSTR;
typedef void* HANDLE;
typedef struct HINSTANCE__* HINSTANCE;
typedef struct HWND__* HWND;
typedef struct HMONITOR__* HMONITOR;
typedef struct _SECURITY_ATTRIBUTES SECURITY_ATTRIBUTES;
#include <vulkan/vulkan_win32.h>
#endif

#ifdef VK_USE_PLATFORM_XCB_KHR
#include <xcb/xcb.h>
#include <vulkan/vulkan_xcb.h>
#endif

#ifdef VK_USE_PLATFORM_XLIB_KHR
typedef struct _XDisplay Display;
typedef unsigned long Window;
typedef unsigned long VisualID;
#include <vulkan/vulkan_xlib.h>
#endif

#ifdef VK_USE_PLATFORM_DIRECTFB_EXT
#include <directfb.h>
#include <vulkan/vulkan_directfb.h>
#endif

#ifdef VK_USE_PLATFORM_XLIB_XRANDR_EXT
typedef struct _XDisplay Display;
typedef unsigned long RROutput;
#include <vulkan/vulkan_xlib_xrandr.h>
#endif

#ifdef VK_USE_PLATFORM_GGP
#include <ggp_c/vulkan_types.h>
#include <vulkan/vulkan_ggp.h>
#endif

#ifdef VK_USE_PLATFORM_SCREEN_QNX
#include <screen/screen.h>
#include <vulkan/vulkan_screen.h>
#endif

#ifdef VK_USE_PLATFORM_SCI
#include <nvscisync.h>
#include <nvscibuf.h>
#include <vulkan/vulkan_sci.h>
#endif

#ifdef VK_ENABLE_BETA_EXTENSIONS
#include <vulkan/vulkan_beta.h>
#endif

#ifdef VK_USE_PLATFORM_OHOS
#include <vulkan/vulkan_ohos.h>
#endif

#endif /* !defined(VULKAN_H_) */
#ifdef __cplusplus
extern "C" {
#endif

/* ---- Context struct ------------------------------------------------------
 * Three anonymous unions give both indexed (array) and named (struct member)
 * access to the same memory, at zero runtime cost.
 *
 * featArray / extArray: unsigned char flags, one per feature / extension.
 * pfnArray: function pointer slots, one per command.
 *
 * Anonymous structs inside the unions are a C11 / GCC extension; they are
 * universally supported on our target compilers.
 */
typedef struct GloamVulkanContext {
    union {
        unsigned char featArray[4];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        };
    };

    union {
        void *pfnArray[215];
        struct {
        /*    0 */ PFN_vkAllocateCommandBuffers AllocateCommandBuffers;
        /*    1 */ PFN_vkAllocateDescriptorSets AllocateDescriptorSets;
        /*    2 */ PFN_vkAllocateMemory AllocateMemory;
        /*    3 */ PFN_vkBeginCommandBuffer BeginCommandBuffer;
        /*    4 */ PFN_vkBindBufferMemory BindBufferMemory;
        /*    5 */ PFN_vkBindImageMemory BindImageMemory;
        /*    6 */ PFN_vkCmdBeginQuery CmdBeginQuery;
        /*    7 */ PFN_vkCmdBeginRenderPass CmdBeginRenderPass;
        /*    8 */ PFN_vkCmdBindDescriptorSets CmdBindDescriptorSets;
        /*    9 */ PFN_vkCmdBindIndexBuffer CmdBindIndexBuffer;
        /*   10 */ PFN_vkCmdBindPipeline CmdBindPipeline;
        /*   11 */ PFN_vkCmdBindVertexBuffers CmdBindVertexBuffers;
        /*   12 */ PFN_vkCmdBlitImage CmdBlitImage;
        /*   13 */ PFN_vkCmdClearAttachments CmdClearAttachments;
        /*   14 */ PFN_vkCmdClearColorImage CmdClearColorImage;
        /*   15 */ PFN_vkCmdClearDepthStencilImage CmdClearDepthStencilImage;
        /*   16 */ PFN_vkCmdCopyBuffer CmdCopyBuffer;
        /*   17 */ PFN_vkCmdCopyBufferToImage CmdCopyBufferToImage;
        /*   18 */ PFN_vkCmdCopyImage CmdCopyImage;
        /*   19 */ PFN_vkCmdCopyImageToBuffer CmdCopyImageToBuffer;
        /*   20 */ PFN_vkCmdCopyQueryPoolResults CmdCopyQueryPoolResults;
        /*   21 */ PFN_vkCmdDispatch CmdDispatch;
        /*   22 */ PFN_vkCmdDispatchIndirect CmdDispatchIndirect;
        /*   23 */ PFN_vkCmdDraw CmdDraw;
        /*   24 */ PFN_vkCmdDrawIndexed CmdDrawIndexed;
        /*   25 */ PFN_vkCmdDrawIndexedIndirect CmdDrawIndexedIndirect;
        /*   26 */ PFN_vkCmdDrawIndirect CmdDrawIndirect;
        /*   27 */ PFN_vkCmdEndQuery CmdEndQuery;
        /*   28 */ PFN_vkCmdEndRenderPass CmdEndRenderPass;
        /*   29 */ PFN_vkCmdExecuteCommands CmdExecuteCommands;
        /*   30 */ PFN_vkCmdFillBuffer CmdFillBuffer;
        /*   31 */ PFN_vkCmdNextSubpass CmdNextSubpass;
        /*   32 */ PFN_vkCmdPipelineBarrier CmdPipelineBarrier;
        /*   33 */ PFN_vkCmdPushConstants CmdPushConstants;
        /*   34 */ PFN_vkCmdResetEvent CmdResetEvent;
        /*   35 */ PFN_vkCmdResetQueryPool CmdResetQueryPool;
        /*   36 */ PFN_vkCmdResolveImage CmdResolveImage;
        /*   37 */ PFN_vkCmdSetBlendConstants CmdSetBlendConstants;
        /*   38 */ PFN_vkCmdSetDepthBias CmdSetDepthBias;
        /*   39 */ PFN_vkCmdSetDepthBounds CmdSetDepthBounds;
        /*   40 */ PFN_vkCmdSetEvent CmdSetEvent;
        /*   41 */ PFN_vkCmdSetLineWidth CmdSetLineWidth;
        /*   42 */ PFN_vkCmdSetScissor CmdSetScissor;
        /*   43 */ PFN_vkCmdSetStencilCompareMask CmdSetStencilCompareMask;
        /*   44 */ PFN_vkCmdSetStencilReference CmdSetStencilReference;
        /*   45 */ PFN_vkCmdSetStencilWriteMask CmdSetStencilWriteMask;
        /*   46 */ PFN_vkCmdSetViewport CmdSetViewport;
        /*   47 */ PFN_vkCmdUpdateBuffer CmdUpdateBuffer;
        /*   48 */ PFN_vkCmdWaitEvents CmdWaitEvents;
        /*   49 */ PFN_vkCmdWriteTimestamp CmdWriteTimestamp;
        /*   50 */ PFN_vkCreateBuffer CreateBuffer;
        /*   51 */ PFN_vkCreateBufferView CreateBufferView;
        /*   52 */ PFN_vkCreateCommandPool CreateCommandPool;
        /*   53 */ PFN_vkCreateComputePipelines CreateComputePipelines;
        /*   54 */ PFN_vkCreateDescriptorPool CreateDescriptorPool;
        /*   55 */ PFN_vkCreateDescriptorSetLayout CreateDescriptorSetLayout;
        /*   56 */ PFN_vkCreateDevice CreateDevice;
        /*   57 */ PFN_vkCreateEvent CreateEvent;
        /*   58 */ PFN_vkCreateFence CreateFence;
        /*   59 */ PFN_vkCreateFramebuffer CreateFramebuffer;
        /*   60 */ PFN_vkCreateGraphicsPipelines CreateGraphicsPipelines;
        /*   61 */ PFN_vkCreateImage CreateImage;
        /*   62 */ PFN_vkCreateImageView CreateImageView;
        /*   63 */ PFN_vkCreateInstance CreateInstance;
        /*   64 */ PFN_vkCreatePipelineCache CreatePipelineCache;
        /*   65 */ PFN_vkCreatePipelineLayout CreatePipelineLayout;
        /*   66 */ PFN_vkCreateQueryPool CreateQueryPool;
        /*   67 */ PFN_vkCreateRenderPass CreateRenderPass;
        /*   68 */ PFN_vkCreateSampler CreateSampler;
        /*   69 */ PFN_vkCreateSemaphore CreateSemaphore;
        /*   70 */ PFN_vkCreateShaderModule CreateShaderModule;
        /*   71 */ PFN_vkDestroyBuffer DestroyBuffer;
        /*   72 */ PFN_vkDestroyBufferView DestroyBufferView;
        /*   73 */ PFN_vkDestroyCommandPool DestroyCommandPool;
        /*   74 */ PFN_vkDestroyDescriptorPool DestroyDescriptorPool;
        /*   75 */ PFN_vkDestroyDescriptorSetLayout DestroyDescriptorSetLayout;
        /*   76 */ PFN_vkDestroyDevice DestroyDevice;
        /*   77 */ PFN_vkDestroyEvent DestroyEvent;
        /*   78 */ PFN_vkDestroyFence DestroyFence;
        /*   79 */ PFN_vkDestroyFramebuffer DestroyFramebuffer;
        /*   80 */ PFN_vkDestroyImage DestroyImage;
        /*   81 */ PFN_vkDestroyImageView DestroyImageView;
        /*   82 */ PFN_vkDestroyInstance DestroyInstance;
        /*   83 */ PFN_vkDestroyPipeline DestroyPipeline;
        /*   84 */ PFN_vkDestroyPipelineCache DestroyPipelineCache;
        /*   85 */ PFN_vkDestroyPipelineLayout DestroyPipelineLayout;
        /*   86 */ PFN_vkDestroyQueryPool DestroyQueryPool;
        /*   87 */ PFN_vkDestroyRenderPass DestroyRenderPass;
        /*   88 */ PFN_vkDestroySampler DestroySampler;
        /*   89 */ PFN_vkDestroySemaphore DestroySemaphore;
        /*   90 */ PFN_vkDestroyShaderModule DestroyShaderModule;
        /*   91 */ PFN_vkDeviceWaitIdle DeviceWaitIdle;
        /*   92 */ PFN_vkEndCommandBuffer EndCommandBuffer;
        /*   93 */ PFN_vkEnumerateDeviceExtensionProperties EnumerateDeviceExtensionProperties;
        /*   94 */ PFN_vkEnumerateDeviceLayerProperties EnumerateDeviceLayerProperties;
        /*   95 */ PFN_vkEnumerateInstanceExtensionProperties EnumerateInstanceExtensionProperties;
        /*   96 */ PFN_vkEnumerateInstanceLayerProperties EnumerateInstanceLayerProperties;
        /*   97 */ PFN_vkEnumeratePhysicalDevices EnumeratePhysicalDevices;
        /*   98 */ PFN_vkFlushMappedMemoryRanges FlushMappedMemoryRanges;
        /*   99 */ PFN_vkFreeCommandBuffers FreeCommandBuffers;
        /*  100 */ PFN_vkFreeDescriptorSets FreeDescriptorSets;
        /*  101 */ PFN_vkFreeMemory FreeMemory;
        /*  102 */ PFN_vkGetBufferMemoryRequirements GetBufferMemoryRequirements;
        /*  103 */ PFN_vkGetDeviceMemoryCommitment GetDeviceMemoryCommitment;
        /*  104 */ PFN_vkGetDeviceProcAddr GetDeviceProcAddr;
        /*  105 */ PFN_vkGetDeviceQueue GetDeviceQueue;
        /*  106 */ PFN_vkGetEventStatus GetEventStatus;
        /*  107 */ PFN_vkGetFenceStatus GetFenceStatus;
        /*  108 */ PFN_vkGetImageMemoryRequirements GetImageMemoryRequirements;
        /*  109 */ PFN_vkGetImageSparseMemoryRequirements GetImageSparseMemoryRequirements;
        /*  110 */ PFN_vkGetImageSubresourceLayout GetImageSubresourceLayout;
        /*  111 */ PFN_vkGetInstanceProcAddr GetInstanceProcAddr;
        /*  112 */ PFN_vkGetPhysicalDeviceFeatures GetPhysicalDeviceFeatures;
        /*  113 */ PFN_vkGetPhysicalDeviceFormatProperties GetPhysicalDeviceFormatProperties;
        /*  114 */ PFN_vkGetPhysicalDeviceImageFormatProperties GetPhysicalDeviceImageFormatProperties;
        /*  115 */ PFN_vkGetPhysicalDeviceMemoryProperties GetPhysicalDeviceMemoryProperties;
        /*  116 */ PFN_vkGetPhysicalDeviceProperties GetPhysicalDeviceProperties;
        /*  117 */ PFN_vkGetPhysicalDeviceQueueFamilyProperties GetPhysicalDeviceQueueFamilyProperties;
        /*  118 */ PFN_vkGetPhysicalDeviceSparseImageFormatProperties GetPhysicalDeviceSparseImageFormatProperties;
        /*  119 */ PFN_vkGetPipelineCacheData GetPipelineCacheData;
        /*  120 */ PFN_vkGetQueryPoolResults GetQueryPoolResults;
        /*  121 */ PFN_vkGetRenderAreaGranularity GetRenderAreaGranularity;
        /*  122 */ PFN_vkInvalidateMappedMemoryRanges InvalidateMappedMemoryRanges;
        /*  123 */ PFN_vkMapMemory MapMemory;
        /*  124 */ PFN_vkMergePipelineCaches MergePipelineCaches;
        /*  125 */ PFN_vkQueueBindSparse QueueBindSparse;
        /*  126 */ PFN_vkQueueSubmit QueueSubmit;
        /*  127 */ PFN_vkQueueWaitIdle QueueWaitIdle;
        /*  128 */ PFN_vkResetCommandBuffer ResetCommandBuffer;
        /*  129 */ PFN_vkResetCommandPool ResetCommandPool;
        /*  130 */ PFN_vkResetDescriptorPool ResetDescriptorPool;
        /*  131 */ PFN_vkResetEvent ResetEvent;
        /*  132 */ PFN_vkResetFences ResetFences;
        /*  133 */ PFN_vkSetEvent SetEvent;
        /*  134 */ PFN_vkUnmapMemory UnmapMemory;
        /*  135 */ PFN_vkUpdateDescriptorSets UpdateDescriptorSets;
        /*  136 */ PFN_vkWaitForFences WaitForFences;
        /*  137 */ PFN_vkBindBufferMemory2 BindBufferMemory2;
        /*  138 */ PFN_vkBindImageMemory2 BindImageMemory2;
        /*  139 */ PFN_vkCmdDispatchBase CmdDispatchBase;
        /*  140 */ PFN_vkCmdSetDeviceMask CmdSetDeviceMask;
        /*  141 */ PFN_vkCreateDescriptorUpdateTemplate CreateDescriptorUpdateTemplate;
        /*  142 */ PFN_vkCreateSamplerYcbcrConversion CreateSamplerYcbcrConversion;
        /*  143 */ PFN_vkDestroyDescriptorUpdateTemplate DestroyDescriptorUpdateTemplate;
        /*  144 */ PFN_vkDestroySamplerYcbcrConversion DestroySamplerYcbcrConversion;
        /*  145 */ PFN_vkEnumerateInstanceVersion EnumerateInstanceVersion;
        /*  146 */ PFN_vkEnumeratePhysicalDeviceGroups EnumeratePhysicalDeviceGroups;
        /*  147 */ PFN_vkGetBufferMemoryRequirements2 GetBufferMemoryRequirements2;
        /*  148 */ PFN_vkGetDescriptorSetLayoutSupport GetDescriptorSetLayoutSupport;
        /*  149 */ PFN_vkGetDeviceGroupPeerMemoryFeatures GetDeviceGroupPeerMemoryFeatures;
        /*  150 */ PFN_vkGetDeviceQueue2 GetDeviceQueue2;
        /*  151 */ PFN_vkGetImageMemoryRequirements2 GetImageMemoryRequirements2;
        /*  152 */ PFN_vkGetImageSparseMemoryRequirements2 GetImageSparseMemoryRequirements2;
        /*  153 */ PFN_vkGetPhysicalDeviceExternalBufferProperties GetPhysicalDeviceExternalBufferProperties;
        /*  154 */ PFN_vkGetPhysicalDeviceExternalFenceProperties GetPhysicalDeviceExternalFenceProperties;
        /*  155 */ PFN_vkGetPhysicalDeviceExternalSemaphoreProperties GetPhysicalDeviceExternalSemaphoreProperties;
        /*  156 */ PFN_vkGetPhysicalDeviceFeatures2 GetPhysicalDeviceFeatures2;
        /*  157 */ PFN_vkGetPhysicalDeviceFormatProperties2 GetPhysicalDeviceFormatProperties2;
        /*  158 */ PFN_vkGetPhysicalDeviceImageFormatProperties2 GetPhysicalDeviceImageFormatProperties2;
        /*  159 */ PFN_vkGetPhysicalDeviceMemoryProperties2 GetPhysicalDeviceMemoryProperties2;
        /*  160 */ PFN_vkGetPhysicalDeviceProperties2 GetPhysicalDeviceProperties2;
        /*  161 */ PFN_vkGetPhysicalDeviceQueueFamilyProperties2 GetPhysicalDeviceQueueFamilyProperties2;
        /*  162 */ PFN_vkGetPhysicalDeviceSparseImageFormatProperties2 GetPhysicalDeviceSparseImageFormatProperties2;
        /*  163 */ PFN_vkTrimCommandPool TrimCommandPool;
        /*  164 */ PFN_vkUpdateDescriptorSetWithTemplate UpdateDescriptorSetWithTemplate;
        /*  165 */ PFN_vkCmdBeginRenderPass2 CmdBeginRenderPass2;
        /*  166 */ PFN_vkCmdDrawIndexedIndirectCount CmdDrawIndexedIndirectCount;
        /*  167 */ PFN_vkCmdDrawIndirectCount CmdDrawIndirectCount;
        /*  168 */ PFN_vkCmdEndRenderPass2 CmdEndRenderPass2;
        /*  169 */ PFN_vkCmdNextSubpass2 CmdNextSubpass2;
        /*  170 */ PFN_vkCreateRenderPass2 CreateRenderPass2;
        /*  171 */ PFN_vkGetBufferDeviceAddress GetBufferDeviceAddress;
        /*  172 */ PFN_vkGetBufferOpaqueCaptureAddress GetBufferOpaqueCaptureAddress;
        /*  173 */ PFN_vkGetDeviceMemoryOpaqueCaptureAddress GetDeviceMemoryOpaqueCaptureAddress;
        /*  174 */ PFN_vkGetSemaphoreCounterValue GetSemaphoreCounterValue;
        /*  175 */ PFN_vkResetQueryPool ResetQueryPool;
        /*  176 */ PFN_vkSignalSemaphore SignalSemaphore;
        /*  177 */ PFN_vkWaitSemaphores WaitSemaphores;
        /*  178 */ PFN_vkCmdBeginRendering CmdBeginRendering;
        /*  179 */ PFN_vkCmdBindVertexBuffers2 CmdBindVertexBuffers2;
        /*  180 */ PFN_vkCmdBlitImage2 CmdBlitImage2;
        /*  181 */ PFN_vkCmdCopyBuffer2 CmdCopyBuffer2;
        /*  182 */ PFN_vkCmdCopyBufferToImage2 CmdCopyBufferToImage2;
        /*  183 */ PFN_vkCmdCopyImage2 CmdCopyImage2;
        /*  184 */ PFN_vkCmdCopyImageToBuffer2 CmdCopyImageToBuffer2;
        /*  185 */ PFN_vkCmdEndRendering CmdEndRendering;
        /*  186 */ PFN_vkCmdPipelineBarrier2 CmdPipelineBarrier2;
        /*  187 */ PFN_vkCmdResetEvent2 CmdResetEvent2;
        /*  188 */ PFN_vkCmdResolveImage2 CmdResolveImage2;
        /*  189 */ PFN_vkCmdSetCullMode CmdSetCullMode;
        /*  190 */ PFN_vkCmdSetDepthBiasEnable CmdSetDepthBiasEnable;
        /*  191 */ PFN_vkCmdSetDepthBoundsTestEnable CmdSetDepthBoundsTestEnable;
        /*  192 */ PFN_vkCmdSetDepthCompareOp CmdSetDepthCompareOp;
        /*  193 */ PFN_vkCmdSetDepthTestEnable CmdSetDepthTestEnable;
        /*  194 */ PFN_vkCmdSetDepthWriteEnable CmdSetDepthWriteEnable;
        /*  195 */ PFN_vkCmdSetEvent2 CmdSetEvent2;
        /*  196 */ PFN_vkCmdSetFrontFace CmdSetFrontFace;
        /*  197 */ PFN_vkCmdSetPrimitiveRestartEnable CmdSetPrimitiveRestartEnable;
        /*  198 */ PFN_vkCmdSetPrimitiveTopology CmdSetPrimitiveTopology;
        /*  199 */ PFN_vkCmdSetRasterizerDiscardEnable CmdSetRasterizerDiscardEnable;
        /*  200 */ PFN_vkCmdSetScissorWithCount CmdSetScissorWithCount;
        /*  201 */ PFN_vkCmdSetStencilOp CmdSetStencilOp;
        /*  202 */ PFN_vkCmdSetStencilTestEnable CmdSetStencilTestEnable;
        /*  203 */ PFN_vkCmdSetViewportWithCount CmdSetViewportWithCount;
        /*  204 */ PFN_vkCmdWaitEvents2 CmdWaitEvents2;
        /*  205 */ PFN_vkCmdWriteTimestamp2 CmdWriteTimestamp2;
        /*  206 */ PFN_vkCreatePrivateDataSlot CreatePrivateDataSlot;
        /*  207 */ PFN_vkDestroyPrivateDataSlot DestroyPrivateDataSlot;
        /*  208 */ PFN_vkGetDeviceBufferMemoryRequirements GetDeviceBufferMemoryRequirements;
        /*  209 */ PFN_vkGetDeviceImageMemoryRequirements GetDeviceImageMemoryRequirements;
        /*  210 */ PFN_vkGetDeviceImageSparseMemoryRequirements GetDeviceImageSparseMemoryRequirements;
        /*  211 */ PFN_vkGetPhysicalDeviceToolProperties GetPhysicalDeviceToolProperties;
        /*  212 */ PFN_vkGetPrivateData GetPrivateData;
        /*  213 */ PFN_vkQueueSubmit2 QueueSubmit2;
        /*  214 */ PFN_vkSetPrivateData SetPrivateData;
        };
    };

    /* Built-in loader library handle. Set by gloamVulkanInitialize*Context /
     * gloamLoaderLoad*Context when it opens the platform library. If the
     * caller pre-populates this field, the open is skipped and ownership is
     * NOT taken (gloam will not close it). Present on all context types so
     * user code can use a single field name regardless of API.
     */
    void *gloam_loader_handle;

    /* Non-zero if gloam opened the library handle itself and is responsible
     * for closing it in gloamVulkanFinalize / gloamLoaderUnload.
     */
    uint8_t gloam_loader_owns_handle;

    /* The last VkInstance this context loaded entry points from */
    VkInstance vk_loaded_instance;
    /* The last VkDevice this context loaded entry points from */
    VkDevice vk_loaded_device;
    /* Vulkan discovery-path metadata — used by gloamLoaderLoadVulkanContext to make
