#ifndef GLOAM_GL_H
#define GLOAM_GL_H

#ifdef __clang__
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#endif
#ifdef __gl_h_
  #error OpenGL (gl.h) header already included (API: gl), remove previous include!
#endif
#define __gl_h_ 1
#ifdef __glext_h_
  #error OpenGL (glext.h) header already included (API: gl), remove previous include!
#endif
#define __glext_h_ 1
#ifdef __gl2_h_
  #error OpenGL ES 2 (gl2.h) header already included (API: gles2), remove previous include!
#endif
#define __gl2_h_ 1
#ifdef __gles2_gl2_h_
  #error OpenGL ES 2 header already included (API: gles2), remove previous include!
#endif
#define __gles2_gl2_h_ 1
#ifdef __gl3_h_
  #error OpenGL ES 3 (gl3.h) header already included (API: gles2), remove previous include!
#endif
#define __gl3_h_ 1
#ifdef __gles2_gl3_h_
  #error OpenGL ES 3 header already included (API: gles2), remove previous include!
#endif
#define __gles2_gl3_h_ 1
#ifdef __clang__
#pragma clang diagnostic pop
#endif

/* ---- Platform detection ------------------------------------------------ */
#ifndef GLOAM_PLATFORM_DETECTED_
#define GLOAM_PLATFORM_DETECTED_
#if defined(__CYGWIN__) || defined(_WIN32)
#  define GLOAM_PLATFORM_WINDOWS 1
#endif
#if defined(__linux)
#  define GLOAM_PLATFORM_LINUX 1
#endif
#endif /* GLOAM_PLATFORM_DETECTED_ */

#ifndef GLOAM_HAS_ENUM_BASE_TYPE
#if defined(__cplusplus) || (defined(__STDC_VERSION__) && __STDC_VERSION__ >= 202311L)
#  define GLOAM_HAS_ENUM_BASE_TYPE 1
#else

typedef void (APIENTRYP PFNGLDEBUGMESSAGECALLBACKPROC)(GLDEBUGPROC callback, const void * userParam);
typedef void (APIENTRYP PFNGLDEBUGMESSAGECALLBACKKHRPROC)(GLDEBUGPROCKHR callback, const void * userParam);
typedef void (APIENTRYP PFNGLDEBUGMESSAGECONTROLPROC)(GLenum source, GLenum type, GLenum severity, GLsizei count, const GLuint * ids, GLboolean enabled);
typedef void (APIENTRYP PFNGLDEBUGMESSAGECONTROLKHRPROC)(GLenum source, GLenum type, GLenum severity, GLsizei count, const GLuint * ids, GLboolean enabled);
typedef void (APIENTRYP PFNGLDEBUGMESSAGEINSERTPROC)(GLenum source, GLenum type, GLuint id, GLenum severity, GLsizei length, const GLchar * buf);
typedef void (APIENTRYP PFNGLDEBUGMESSAGEINSERTKHRPROC)(GLenum source, GLenum type, GLuint id, GLenum severity, GLsizei length, const GLchar * buf);
typedef GLuint (APIENTRYP PFNGLGETDEBUGMESSAGELOGPROC)(GLuint count, GLsizei bufSize, GLenum * sources, GLenum * types, GLuint * ids, GLenum * severities, GLsizei * lengths, GLchar * messageLog);
typedef GLuint (APIENTRYP PFNGLGETDEBUGMESSAGELOGKHRPROC)(GLuint count, GLsizei bufSize, GLenum * sources, GLenum * types, GLuint * ids, GLenum * severities, GLsizei * lengths, GLchar * messageLog);
typedef void (APIENTRYP PFNGLGETOBJECTLABELPROC)(GLenum identifier, GLuint name, GLsizei bufSize, GLsizei * length, GLchar * label);
typedef void (APIENTRYP PFNGLGETOBJECTLABELKHRPROC)(GLenum identifier, GLuint name, GLsizei bufSize, GLsizei * length, GLchar * label);
typedef void (APIENTRYP PFNGLGETOBJECTPTRLABELPROC)(const void * ptr, GLsizei bufSize, GLsizei * length, GLchar * label);
typedef void (APIENTRYP PFNGLGETOBJECTPTRLABELKHRPROC)(const void * ptr, GLsizei bufSize, GLsizei * length, GLchar * label);
typedef void (APIENTRYP PFNGLGETPOINTERVKHRPROC)(GLenum pname, void ** params);
typedef void (APIENTRYP PFNGLOBJECTLABELPROC)(GLenum identifier, GLuint name, GLsizei length, const GLchar * label);
typedef void (APIENTRYP PFNGLOBJECTLABELKHRPROC)(GLenum identifier, GLuint name, GLsizei length, const GLchar * label);
typedef void (APIENTRYP PFNGLOBJECTPTRLABELPROC)(const void * ptr, GLsizei length, const GLchar * label);
typedef void (APIENTRYP PFNGLOBJECTPTRLABELKHRPROC)(const void * ptr, GLsizei length, const GLchar * label);
typedef void (APIENTRYP PFNGLPOPDEBUGGROUPPROC)(void);
typedef void (APIENTRYP PFNGLPOPDEBUGGROUPKHRPROC)(void);
typedef void (APIENTRYP PFNGLPUSHDEBUGGROUPPROC)(GLenum source, GLuint id, GLsizei length, const GLchar * message);
typedef void (APIENTRYP PFNGLPUSHDEBUGGROUPKHRPROC)(GLenum source, GLuint id, GLsizei length, const GLchar * message);


/* ---- Context struct ------------------------------------------------------
 * Three anonymous unions give both indexed (array) and named (struct member)
 * access to the same memory, at zero runtime cost.
 *
 * featArray / extArray: unsigned char flags, one per feature / extension.
 * pfnArray: function pointer slots, one per command.
 *
 * Anonymous structs inside the unions are a C11 / GCC extension; they are
 * universally supported on our target compilers.
 */
typedef struct GloamGLContext {
    union {
        unsigned char featArray[14];
        struct {
        /*    0 */ unsigned char VERSION_1_0;
        /*    1 */ unsigned char VERSION_1_1;
        /*    2 */ unsigned char VERSION_1_2;
        /*    3 */ unsigned char VERSION_1_3;
        /*    4 */ unsigned char VERSION_1_4;
        /*    5 */ unsigned char VERSION_1_5;
        /*    6 */ unsigned char VERSION_2_0;
        /*    7 */ unsigned char VERSION_2_1;
        /*    8 */ unsigned char VERSION_3_0;
        /*    9 */ unsigned char VERSION_3_1;
        /*   10 */ unsigned char VERSION_3_2;
        /*   11 */ unsigned char VERSION_3_3;
        /*   12 */ unsigned char ES_VERSION_2_0;
        /*   13 */ unsigned char ES_VERSION_3_0;
        };
    };

    union {
        unsigned char extArray[1];
        struct {
        /*    0 */ unsigned char KHR_debug;
        };
    };

    union {
        void *pfnArray[385];
        struct {
        /*    0 */ PFNGLCLEARDEPTHPROC ClearDepth;
        /*    1 */ PFNGLDEPTHRANGEPROC DepthRange;
        /*    2 */ PFNGLDRAWBUFFERPROC DrawBuffer;
        /*    3 */ PFNGLGETDOUBLEVPROC GetDoublev;
        /*    4 */ PFNGLGETTEXIMAGEPROC GetTexImage;
        /*    5 */ PFNGLGETTEXLEVELPARAMETERFVPROC GetTexLevelParameterfv;
        /*    6 */ PFNGLGETTEXLEVELPARAMETERIVPROC GetTexLevelParameteriv;
        /*    7 */ PFNGLLOGICOPPROC LogicOp;
        /*    8 */ PFNGLPIXELSTOREFPROC PixelStoref;
        /*    9 */ PFNGLPOINTSIZEPROC PointSize;
        /*   10 */ PFNGLPOLYGONMODEPROC PolygonMode;
        /*   11 */ PFNGLTEXIMAGE1DPROC TexImage1D;
        /*   12 */ PFNGLBLENDFUNCPROC BlendFunc;
        /*   13 */ PFNGLCLEARPROC Clear;
        /*   14 */ PFNGLCLEARCOLORPROC ClearColor;
        /*   15 */ PFNGLCLEARSTENCILPROC ClearStencil;
        /*   16 */ PFNGLCOLORMASKPROC ColorMask;
        /*   17 */ PFNGLCULLFACEPROC CullFace;
        /*   18 */ PFNGLDEPTHFUNCPROC DepthFunc;
        /*   19 */ PFNGLDEPTHMASKPROC DepthMask;
        /*   20 */ PFNGLDISABLEPROC Disable;
        /*   21 */ PFNGLENABLEPROC Enable;
        /*   22 */ PFNGLFINISHPROC Finish;
        /*   23 */ PFNGLFLUSHPROC Flush;
        /*   24 */ PFNGLFRONTFACEPROC FrontFace;
        /*   25 */ PFNGLGETBOOLEANVPROC GetBooleanv;
        /*   26 */ PFNGLGETERRORPROC GetError;
        /*   27 */ PFNGLGETFLOATVPROC GetFloatv;
        /*   28 */ PFNGLGETINTEGERVPROC GetIntegerv;
        /*   29 */ PFNGLGETSTRINGPROC GetString;
        /*   30 */ PFNGLGETTEXPARAMETERFVPROC GetTexParameterfv;
        /*   31 */ PFNGLGETTEXPARAMETERIVPROC GetTexParameteriv;
        /*   32 */ PFNGLHINTPROC Hint;
        /*   33 */ PFNGLISENABLEDPROC IsEnabled;
        /*   34 */ PFNGLLINEWIDTHPROC LineWidth;
        /*   35 */ PFNGLPIXELSTOREIPROC PixelStorei;
        /*   36 */ PFNGLREADPIXELSPROC ReadPixels;
        /*   37 */ PFNGLSCISSORPROC Scissor;
        /*   38 */ PFNGLSTENCILFUNCPROC StencilFunc;
        /*   39 */ PFNGLSTENCILMASKPROC StencilMask;
        /*   40 */ PFNGLSTENCILOPPROC StencilOp;
        /*   41 */ PFNGLTEXIMAGE2DPROC TexImage2D;
        /*   42 */ PFNGLTEXPARAMETERFPROC TexParameterf;
        /*   43 */ PFNGLTEXPARAMETERFVPROC TexParameterfv;
        /*   44 */ PFNGLTEXPARAMETERIPROC TexParameteri;
        /*   45 */ PFNGLTEXPARAMETERIVPROC TexParameteriv;
        /*   46 */ PFNGLVIEWPORTPROC Viewport;
        /*   47 */ PFNGLREADBUFFERPROC ReadBuffer;
        /*   48 */ PFNGLCOPYTEXIMAGE1DPROC CopyTexImage1D;
        /*   49 */ PFNGLCOPYTEXSUBIMAGE1DPROC CopyTexSubImage1D;
        /*   50 */ PFNGLTEXSUBIMAGE1DPROC TexSubImage1D;
        /*   51 */ PFNGLBINDTEXTUREPROC BindTexture;
        /*   52 */ PFNGLCOPYTEXIMAGE2DPROC CopyTexImage2D;
        /*   53 */ PFNGLCOPYTEXSUBIMAGE2DPROC CopyTexSubImage2D;
        /*   54 */ PFNGLDELETETEXTURESPROC DeleteTextures;
        /*   55 */ PFNGLDRAWARRAYSPROC DrawArrays;
        /*   56 */ PFNGLDRAWELEMENTSPROC DrawElements;
        /*   57 */ PFNGLGENTEXTURESPROC GenTextures;
        /*   58 */ PFNGLISTEXTUREPROC IsTexture;
        /*   59 */ PFNGLPOLYGONOFFSETPROC PolygonOffset;
        /*   60 */ PFNGLTEXSUBIMAGE2DPROC TexSubImage2D;
        /*   61 */ PFNGLCOPYTEXSUBIMAGE3DPROC CopyTexSubImage3D;
        /*   62 */ PFNGLDRAWRANGEELEMENTSPROC DrawRangeElements;
        /*   63 */ PFNGLTEXIMAGE3DPROC TexImage3D;
        /*   64 */ PFNGLTEXSUBIMAGE3DPROC TexSubImage3D;
        /*   65 */ PFNGLCOMPRESSEDTEXIMAGE1DPROC CompressedTexImage1D;
        /*   66 */ PFNGLCOMPRESSEDTEXSUBIMAGE1DPROC CompressedTexSubImage1D;
        /*   67 */ PFNGLGETCOMPRESSEDTEXIMAGEPROC GetCompressedTexImage;
        /*   68 */ PFNGLACTIVETEXTUREPROC ActiveTexture;
        /*   69 */ PFNGLCOMPRESSEDTEXIMAGE2DPROC CompressedTexImage2D;
        /*   70 */ PFNGLCOMPRESSEDTEXSUBIMAGE2DPROC CompressedTexSubImage2D;
        /*   71 */ PFNGLSAMPLECOVERAGEPROC SampleCoverage;
        /*   72 */ PFNGLCOMPRESSEDTEXIMAGE3DPROC CompressedTexImage3D;
        /*   73 */ PFNGLCOMPRESSEDTEXSUBIMAGE3DPROC CompressedTexSubImage3D;
        /*   74 */ PFNGLMULTIDRAWARRAYSPROC MultiDrawArrays;
        /*   75 */ PFNGLMULTIDRAWELEMENTSPROC MultiDrawElements;
        /*   76 */ PFNGLPOINTPARAMETERFPROC PointParameterf;
        /*   77 */ PFNGLPOINTPARAMETERFVPROC PointParameterfv;
        /*   78 */ PFNGLPOINTPARAMETERIPROC PointParameteri;
        /*   79 */ PFNGLPOINTPARAMETERIVPROC PointParameteriv;
        /*   80 */ PFNGLBLENDCOLORPROC BlendColor;
        /*   81 */ PFNGLBLENDEQUATIONPROC BlendEquation;
        /*   82 */ PFNGLBLENDFUNCSEPARATEPROC BlendFuncSeparate;
        /*   83 */ PFNGLGETBUFFERSUBDATAPROC GetBufferSubData;
        /*   84 */ PFNGLGETQUERYOBJECTIVPROC GetQueryObjectiv;
        /*   85 */ PFNGLMAPBUFFERPROC MapBuffer;
        /*   86 */ PFNGLBINDBUFFERPROC BindBuffer;
        /*   87 */ PFNGLBUFFERDATAPROC BufferData;
        /*   88 */ PFNGLBUFFERSUBDATAPROC BufferSubData;
        /*   89 */ PFNGLDELETEBUFFERSPROC DeleteBuffers;
        /*   90 */ PFNGLGENBUFFERSPROC GenBuffers;
        /*   91 */ PFNGLGETBUFFERPARAMETERIVPROC GetBufferParameteriv;
        /*   92 */ PFNGLISBUFFERPROC IsBuffer;
        /*   93 */ PFNGLBEGINQUERYPROC BeginQuery;
        /*   94 */ PFNGLDELETEQUERIESPROC DeleteQueries;
        /*   95 */ PFNGLENDQUERYPROC EndQuery;
        /*   96 */ PFNGLGENQUERIESPROC GenQueries;
        /*   97 */ PFNGLGETBUFFERPOINTERVPROC GetBufferPointerv;
        /*   98 */ PFNGLGETQUERYOBJECTUIVPROC GetQueryObjectuiv;
        /*   99 */ PFNGLGETQUERYIVPROC GetQueryiv;
        /*  100 */ PFNGLISQUERYPROC IsQuery;
        /*  101 */ PFNGLUNMAPBUFFERPROC UnmapBuffer;
        /*  102 */ PFNGLGETVERTEXATTRIBDVPROC GetVertexAttribdv;
        /*  103 */ PFNGLVERTEXATTRIB1DPROC VertexAttrib1d;
        /*  104 */ PFNGLVERTEXATTRIB1DVPROC VertexAttrib1dv;
        /*  105 */ PFNGLVERTEXATTRIB1SPROC VertexAttrib1s;
        /*  106 */ PFNGLVERTEXATTRIB1SVPROC VertexAttrib1sv;
        /*  107 */ PFNGLVERTEXATTRIB2DPROC VertexAttrib2d;
        /*  108 */ PFNGLVERTEXATTRIB2DVPROC VertexAttrib2dv;
        /*  109 */ PFNGLVERTEXATTRIB2SPROC VertexAttrib2s;
        /*  110 */ PFNGLVERTEXATTRIB2SVPROC VertexAttrib2sv;
        /*  111 */ PFNGLVERTEXATTRIB3DPROC VertexAttrib3d;
        /*  112 */ PFNGLVERTEXATTRIB3DVPROC VertexAttrib3dv;
        /*  113 */ PFNGLVERTEXATTRIB3SPROC VertexAttrib3s;
        /*  114 */ PFNGLVERTEXATTRIB3SVPROC VertexAttrib3sv;
        /*  115 */ PFNGLVERTEXATTRIB4NBVPROC VertexAttrib4Nbv;
        /*  116 */ PFNGLVERTEXATTRIB4NIVPROC VertexAttrib4Niv;
        /*  117 */ PFNGLVERTEXATTRIB4NSVPROC VertexAttrib4Nsv;
        /*  118 */ PFNGLVERTEXATTRIB4NUBPROC VertexAttrib4Nub;
        /*  119 */ PFNGLVERTEXATTRIB4NUBVPROC VertexAttrib4Nubv;
        /*  120 */ PFNGLVERTEXATTRIB4NUIVPROC VertexAttrib4Nuiv;
        /*  121 */ PFNGLVERTEXATTRIB4NUSVPROC VertexAttrib4Nusv;
        /*  122 */ PFNGLVERTEXATTRIB4BVPROC VertexAttrib4bv;
        /*  123 */ PFNGLVERTEXATTRIB4DPROC VertexAttrib4d;
        /*  124 */ PFNGLVERTEXATTRIB4DVPROC VertexAttrib4dv;
        /*  125 */ PFNGLVERTEXATTRIB4IVPROC VertexAttrib4iv;
        /*  126 */ PFNGLVERTEXATTRIB4SPROC VertexAttrib4s;
        /*  127 */ PFNGLVERTEXATTRIB4SVPROC VertexAttrib4sv;
        /*  128 */ PFNGLVERTEXATTRIB4UBVPROC VertexAttrib4ubv;
        /*  129 */ PFNGLVERTEXATTRIB4UIVPROC VertexAttrib4uiv;
        /*  130 */ PFNGLVERTEXATTRIB4USVPROC VertexAttrib4usv;
        /*  131 */ PFNGLATTACHSHADERPROC AttachShader;
        /*  132 */ PFNGLBINDATTRIBLOCATIONPROC BindAttribLocation;
        /*  133 */ PFNGLBLENDEQUATIONSEPARATEPROC BlendEquationSeparate;
        /*  134 */ PFNGLCOMPILESHADERPROC CompileShader;
        /*  135 */ PFNGLCREATEPROGRAMPROC CreateProgram;
        /*  136 */ PFNGLCREATESHADERPROC CreateShader;
        /*  137 */ PFNGLDELETEPROGRAMPROC DeleteProgram;
        /*  138 */ PFNGLDELETESHADERPROC DeleteShader;
        /*  139 */ PFNGLDETACHSHADERPROC DetachShader;
        /*  140 */ PFNGLDISABLEVERTEXATTRIBARRAYPROC DisableVertexAttribArray;
        /*  141 */ PFNGLENABLEVERTEXATTRIBARRAYPROC EnableVertexAttribArray;
        /*  142 */ PFNGLGETACTIVEATTRIBPROC GetActiveAttrib;
        /*  143 */ PFNGLGETACTIVEUNIFORMPROC GetActiveUniform;
        /*  144 */ PFNGLGETATTACHEDSHADERSPROC GetAttachedShaders;
        /*  145 */ PFNGLGETATTRIBLOCATIONPROC GetAttribLocation;
        /*  146 */ PFNGLGETPROGRAMINFOLOGPROC GetProgramInfoLog;
        /*  147 */ PFNGLGETPROGRAMIVPROC GetProgramiv;
        /*  148 */ PFNGLGETSHADERINFOLOGPROC GetShaderInfoLog;
        /*  149 */ PFNGLGETSHADERSOURCEPROC GetShaderSource;
        /*  150 */ PFNGLGETSHADERIVPROC GetShaderiv;
        /*  151 */ PFNGLGETUNIFORMLOCATIONPROC GetUniformLocation;
        /*  152 */ PFNGLGETUNIFORMFVPROC GetUniformfv;
        /*  153 */ PFNGLGETUNIFORMIVPROC GetUniformiv;
        /*  154 */ PFNGLGETVERTEXATTRIBPOINTERVPROC GetVertexAttribPointerv;
        /*  155 */ PFNGLGETVERTEXATTRIBFVPROC GetVertexAttribfv;
        /*  156 */ PFNGLGETVERTEXATTRIBIVPROC GetVertexAttribiv;
        /*  157 */ PFNGLISPROGRAMPROC IsProgram;
        /*  158 */ PFNGLISSHADERPROC IsShader;
        /*  159 */ PFNGLLINKPROGRAMPROC LinkProgram;
        /*  160 */ PFNGLSHADERSOURCEPROC ShaderSource;
        /*  161 */ PFNGLSTENCILFUNCSEPARATEPROC StencilFuncSeparate;
        /*  162 */ PFNGLSTENCILMASKSEPARATEPROC StencilMaskSeparate;
        /*  163 */ PFNGLSTENCILOPSEPARATEPROC StencilOpSeparate;
        /*  164 */ PFNGLUNIFORM1FPROC Uniform1f;
        /*  165 */ PFNGLUNIFORM1FVPROC Uniform1fv;
        /*  166 */ PFNGLUNIFORM1IPROC Uniform1i;
        /*  167 */ PFNGLUNIFORM1IVPROC Uniform1iv;
        /*  168 */ PFNGLUNIFORM2FPROC Uniform2f;
        /*  169 */ PFNGLUNIFORM2FVPROC Uniform2fv;
        /*  170 */ PFNGLUNIFORM2IPROC Uniform2i;
        /*  171 */ PFNGLUNIFORM2IVPROC Uniform2iv;
        /*  172 */ PFNGLUNIFORM3FPROC Uniform3f;
        /*  173 */ PFNGLUNIFORM3FVPROC Uniform3fv;
        /*  174 */ PFNGLUNIFORM3IPROC Uniform3i;
        /*  175 */ PFNGLUNIFORM3IVPROC Uniform3iv;
        /*  176 */ PFNGLUNIFORM4FPROC Uniform4f;
        /*  177 */ PFNGLUNIFORM4FVPROC Uniform4fv;
        /*  178 */ PFNGLUNIFORM4IPROC Uniform4i;
        /*  179 */ PFNGLUNIFORM4IVPROC Uniform4iv;
        /*  180 */ PFNGLUNIFORMMATRIX2FVPROC UniformMatrix2fv;
        /*  181 */ PFNGLUNIFORMMATRIX3FVPROC UniformMatrix3fv;
        /*  182 */ PFNGLUNIFORMMATRIX4FVPROC UniformMatrix4fv;
        /*  183 */ PFNGLUSEPROGRAMPROC UseProgram;
        /*  184 */ PFNGLVALIDATEPROGRAMPROC ValidateProgram;
        /*  185 */ PFNGLVERTEXATTRIB1FPROC VertexAttrib1f;
        /*  186 */ PFNGLVERTEXATTRIB1FVPROC VertexAttrib1fv;
        /*  187 */ PFNGLVERTEXATTRIB2FPROC VertexAttrib2f;
        /*  188 */ PFNGLVERTEXATTRIB2FVPROC VertexAttrib2fv;
        /*  189 */ PFNGLVERTEXATTRIB3FPROC VertexAttrib3f;
        /*  190 */ PFNGLVERTEXATTRIB3FVPROC VertexAttrib3fv;
        /*  191 */ PFNGLVERTEXATTRIB4FPROC VertexAttrib4f;
        /*  192 */ PFNGLVERTEXATTRIB4FVPROC VertexAttrib4fv;
        /*  193 */ PFNGLVERTEXATTRIBPOINTERPROC VertexAttribPointer;
        /*  194 */ PFNGLDRAWBUFFERSPROC DrawBuffers;
        /*  195 */ PFNGLUNIFORMMATRIX2X3FVPROC UniformMatrix2x3fv;
        /*  196 */ PFNGLUNIFORMMATRIX2X4FVPROC UniformMatrix2x4fv;
        /*  197 */ PFNGLUNIFORMMATRIX3X2FVPROC UniformMatrix3x2fv;
        /*  198 */ PFNGLUNIFORMMATRIX3X4FVPROC UniformMatrix3x4fv;
        /*  199 */ PFNGLUNIFORMMATRIX4X2FVPROC UniformMatrix4x2fv;
        /*  200 */ PFNGLUNIFORMMATRIX4X3FVPROC UniformMatrix4x3fv;
        /*  201 */ PFNGLBEGINCONDITIONALRENDERPROC BeginConditionalRender;
        /*  202 */ PFNGLBINDFRAGDATALOCATIONPROC BindFragDataLocation;
        /*  203 */ PFNGLCLAMPCOLORPROC ClampColor;
        /*  204 */ PFNGLCOLORMASKIPROC ColorMaski;
        /*  205 */ PFNGLDISABLEIPROC Disablei;
        /*  206 */ PFNGLENABLEIPROC Enablei;
        /*  207 */ PFNGLENDCONDITIONALRENDERPROC EndConditionalRender;
        /*  208 */ PFNGLFRAMEBUFFERTEXTURE1DPROC FramebufferTexture1D;
        /*  209 */ PFNGLFRAMEBUFFERTEXTURE3DPROC FramebufferTexture3D;
        /*  210 */ PFNGLGETBOOLEANI_VPROC GetBooleani_v;
        /*  211 */ PFNGLGETTEXPARAMETERIIVPROC GetTexParameterIiv;
        /*  212 */ PFNGLGETTEXPARAMETERIUIVPROC GetTexParameterIuiv;
        /*  213 */ PFNGLISENABLEDIPROC IsEnabledi;
        /*  214 */ PFNGLTEXPARAMETERIIVPROC TexParameterIiv;
        /*  215 */ PFNGLTEXPARAMETERIUIVPROC TexParameterIuiv;
        /*  216 */ PFNGLVERTEXATTRIBI1IPROC VertexAttribI1i;
        /*  217 */ PFNGLVERTEXATTRIBI1IVPROC VertexAttribI1iv;
        /*  218 */ PFNGLVERTEXATTRIBI1UIPROC VertexAttribI1ui;
        /*  219 */ PFNGLVERTEXATTRIBI1UIVPROC VertexAttribI1uiv;
        /*  220 */ PFNGLVERTEXATTRIBI2IPROC VertexAttribI2i;
        /*  221 */ PFNGLVERTEXATTRIBI2IVPROC VertexAttribI2iv;
        /*  222 */ PFNGLVERTEXATTRIBI2UIPROC VertexAttribI2ui;
        /*  223 */ PFNGLVERTEXATTRIBI2UIVPROC VertexAttribI2uiv;
        /*  224 */ PFNGLVERTEXATTRIBI3IPROC VertexAttribI3i;
        /*  225 */ PFNGLVERTEXATTRIBI3IVPROC VertexAttribI3iv;
        /*  226 */ PFNGLVERTEXATTRIBI3UIPROC VertexAttribI3ui;
        /*  227 */ PFNGLVERTEXATTRIBI3UIVPROC VertexAttribI3uiv;
        /*  228 */ PFNGLVERTEXATTRIBI4BVPROC VertexAttribI4bv;
        /*  229 */ PFNGLVERTEXATTRIBI4SVPROC VertexAttribI4sv;
        /*  230 */ PFNGLVERTEXATTRIBI4UBVPROC VertexAttribI4ubv;
        /*  231 */ PFNGLVERTEXATTRIBI4USVPROC VertexAttribI4usv;
        /*  232 */ PFNGLBINDBUFFERBASEPROC BindBufferBase;
        /*  233 */ PFNGLBINDBUFFERRANGEPROC BindBufferRange;
        /*  234 */ PFNGLGETINTEGERI_VPROC GetIntegeri_v;
        /*  235 */ PFNGLBINDFRAMEBUFFERPROC BindFramebuffer;
        /*  236 */ PFNGLBINDRENDERBUFFERPROC BindRenderbuffer;
        /*  237 */ PFNGLCHECKFRAMEBUFFERSTATUSPROC CheckFramebufferStatus;
        /*  238 */ PFNGLDELETEFRAMEBUFFERSPROC DeleteFramebuffers;
        /*  239 */ PFNGLDELETERENDERBUFFERSPROC DeleteRenderbuffers;
        /*  240 */ PFNGLFRAMEBUFFERRENDERBUFFERPROC FramebufferRenderbuffer;
        /*  241 */ PFNGLFRAMEBUFFERTEXTURE2DPROC FramebufferTexture2D;
        /*  242 */ PFNGLGENFRAMEBUFFERSPROC GenFramebuffers;
        /*  243 */ PFNGLGENRENDERBUFFERSPROC GenRenderbuffers;
        /*  244 */ PFNGLGENERATEMIPMAPPROC GenerateMipmap;
        /*  245 */ PFNGLGETFRAMEBUFFERATTACHMENTPARAMETERIVPROC GetFramebufferAttachmentParameteriv;
        /*  246 */ PFNGLGETRENDERBUFFERPARAMETERIVPROC GetRenderbufferParameteriv;
        /*  247 */ PFNGLISFRAMEBUFFERPROC IsFramebuffer;
        /*  248 */ PFNGLISRENDERBUFFERPROC IsRenderbuffer;
        /*  249 */ PFNGLRENDERBUFFERSTORAGEPROC RenderbufferStorage;
        /*  250 */ PFNGLBEGINTRANSFORMFEEDBACKPROC BeginTransformFeedback;
        /*  251 */ PFNGLBINDVERTEXARRAYPROC BindVertexArray;
        /*  252 */ PFNGLBLITFRAMEBUFFERPROC BlitFramebuffer;
        /*  253 */ PFNGLCLEARBUFFERFIPROC ClearBufferfi;
        /*  254 */ PFNGLCLEARBUFFERFVPROC ClearBufferfv;
        /*  255 */ PFNGLCLEARBUFFERIVPROC ClearBufferiv;
        /*  256 */ PFNGLCLEARBUFFERUIVPROC ClearBufferuiv;
        /*  257 */ PFNGLDELETEVERTEXARRAYSPROC DeleteVertexArrays;
        /*  258 */ PFNGLENDTRANSFORMFEEDBACKPROC EndTransformFeedback;
        /*  259 */ PFNGLFLUSHMAPPEDBUFFERRANGEPROC FlushMappedBufferRange;
        /*  260 */ PFNGLFRAMEBUFFERTEXTURELAYERPROC FramebufferTextureLayer;
        /*  261 */ PFNGLGENVERTEXARRAYSPROC GenVertexArrays;
        /*  262 */ PFNGLGETFRAGDATALOCATIONPROC GetFragDataLocation;
        /*  263 */ PFNGLGETSTRINGIPROC GetStringi;
        /*  264 */ PFNGLGETTRANSFORMFEEDBACKVARYINGPROC GetTransformFeedbackVarying;
        /*  265 */ PFNGLGETUNIFORMUIVPROC GetUniformuiv;
        /*  266 */ PFNGLGETVERTEXATTRIBIIVPROC GetVertexAttribIiv;
        /*  267 */ PFNGLGETVERTEXATTRIBIUIVPROC GetVertexAttribIuiv;
        /*  268 */ PFNGLISVERTEXARRAYPROC IsVertexArray;
        /*  269 */ PFNGLMAPBUFFERRANGEPROC MapBufferRange;
        /*  270 */ PFNGLRENDERBUFFERSTORAGEMULTISAMPLEPROC RenderbufferStorageMultisample;
        /*  271 */ PFNGLTRANSFORMFEEDBACKVARYINGSPROC TransformFeedbackVaryings;
        /*  272 */ PFNGLUNIFORM1UIPROC Uniform1ui;
        /*  273 */ PFNGLUNIFORM1UIVPROC Uniform1uiv;
        /*  274 */ PFNGLUNIFORM2UIPROC Uniform2ui;
        /*  275 */ PFNGLUNIFORM2UIVPROC Uniform2uiv;
        /*  276 */ PFNGLUNIFORM3UIPROC Uniform3ui;
        /*  277 */ PFNGLUNIFORM3UIVPROC Uniform3uiv;
        /*  278 */ PFNGLUNIFORM4UIPROC Uniform4ui;
        /*  279 */ PFNGLUNIFORM4UIVPROC Uniform4uiv;
        /*  280 */ PFNGLVERTEXATTRIBI4IPROC VertexAttribI4i;
        /*  281 */ PFNGLVERTEXATTRIBI4IVPROC VertexAttribI4iv;
        /*  282 */ PFNGLVERTEXATTRIBI4UIPROC VertexAttribI4ui;
        /*  283 */ PFNGLVERTEXATTRIBI4UIVPROC VertexAttribI4uiv;
        /*  284 */ PFNGLVERTEXATTRIBIPOINTERPROC VertexAttribIPointer;
        /*  285 */ PFNGLGETACTIVEUNIFORMNAMEPROC GetActiveUniformName;
        /*  286 */ PFNGLPRIMITIVERESTARTINDEXPROC PrimitiveRestartIndex;
        /*  287 */ PFNGLTEXBUFFERPROC TexBuffer;
        /*  288 */ PFNGLCOPYBUFFERSUBDATAPROC CopyBufferSubData;
        /*  289 */ PFNGLDRAWARRAYSINSTANCEDPROC DrawArraysInstanced;
        /*  290 */ PFNGLDRAWELEMENTSINSTANCEDPROC DrawElementsInstanced;
        /*  291 */ PFNGLGETACTIVEUNIFORMBLOCKNAMEPROC GetActiveUniformBlockName;
        /*  292 */ PFNGLGETACTIVEUNIFORMBLOCKIVPROC GetActiveUniformBlockiv;
        /*  293 */ PFNGLGETACTIVEUNIFORMSIVPROC GetActiveUniformsiv;
        /*  294 */ PFNGLGETUNIFORMBLOCKINDEXPROC GetUniformBlockIndex;
        /*  295 */ PFNGLGETUNIFORMINDICESPROC GetUniformIndices;
        /*  296 */ PFNGLUNIFORMBLOCKBINDINGPROC UniformBlockBinding;
        /*  297 */ PFNGLDRAWELEMENTSBASEVERTEXPROC DrawElementsBaseVertex;
        /*  298 */ PFNGLDRAWELEMENTSINSTANCEDBASEVERTEXPROC DrawElementsInstancedBaseVertex;
        /*  299 */ PFNGLDRAWRANGEELEMENTSBASEVERTEXPROC DrawRangeElementsBaseVertex;
        /*  300 */ PFNGLFRAMEBUFFERTEXTUREPROC FramebufferTexture;
        /*  301 */ PFNGLGETMULTISAMPLEFVPROC GetMultisamplefv;
        /*  302 */ PFNGLMULTIDRAWELEMENTSBASEVERTEXPROC MultiDrawElementsBaseVertex;
        /*  303 */ PFNGLPROVOKINGVERTEXPROC ProvokingVertex;
        /*  304 */ PFNGLSAMPLEMASKIPROC SampleMaski;
        /*  305 */ PFNGLTEXIMAGE2DMULTISAMPLEPROC TexImage2DMultisample;
        /*  306 */ PFNGLTEXIMAGE3DMULTISAMPLEPROC TexImage3DMultisample;
        /*  307 */ PFNGLCLIENTWAITSYNCPROC ClientWaitSync;
        /*  308 */ PFNGLDELETESYNCPROC DeleteSync;
        /*  309 */ PFNGLFENCESYNCPROC FenceSync;
        /*  310 */ PFNGLGETBUFFERPARAMETERI64VPROC GetBufferParameteri64v;
        /*  311 */ PFNGLGETINTEGER64I_VPROC GetInteger64i_v;
        /*  312 */ PFNGLGETINTEGER64VPROC GetInteger64v;
        /*  313 */ PFNGLGETSYNCIVPROC GetSynciv;
        /*  314 */ PFNGLISSYNCPROC IsSync;
        /*  315 */ PFNGLWAITSYNCPROC WaitSync;
        /*  316 */ PFNGLBINDFRAGDATALOCATIONINDEXEDPROC BindFragDataLocationIndexed;
        /*  317 */ PFNGLGETFRAGDATAINDEXPROC GetFragDataIndex;
        /*  318 */ PFNGLGETQUERYOBJECTI64VPROC GetQueryObjecti64v;
        /*  319 */ PFNGLGETQUERYOBJECTUI64VPROC GetQueryObjectui64v;
        /*  320 */ PFNGLGETSAMPLERPARAMETERIIVPROC GetSamplerParameterIiv;
        /*  321 */ PFNGLGETSAMPLERPARAMETERIUIVPROC GetSamplerParameterIuiv;
        /*  322 */ PFNGLQUERYCOUNTERPROC QueryCounter;
        /*  323 */ PFNGLSAMPLERPARAMETERIIVPROC SamplerParameterIiv;
        /*  324 */ PFNGLSAMPLERPARAMETERIUIVPROC SamplerParameterIuiv;
        /*  325 */ PFNGLVERTEXATTRIBP1UIPROC VertexAttribP1ui;
        /*  326 */ PFNGLVERTEXATTRIBP1UIVPROC VertexAttribP1uiv;
        /*  327 */ PFNGLVERTEXATTRIBP2UIPROC VertexAttribP2ui;
        /*  328 */ PFNGLVERTEXATTRIBP2UIVPROC VertexAttribP2uiv;
        /*  329 */ PFNGLVERTEXATTRIBP3UIPROC VertexAttribP3ui;
        /*  330 */ PFNGLVERTEXATTRIBP3UIVPROC VertexAttribP3uiv;
        /*  331 */ PFNGLVERTEXATTRIBP4UIPROC VertexAttribP4ui;
        /*  332 */ PFNGLVERTEXATTRIBP4UIVPROC VertexAttribP4uiv;
        /*  333 */ PFNGLBINDSAMPLERPROC BindSampler;
        /*  334 */ PFNGLDELETESAMPLERSPROC DeleteSamplers;
        /*  335 */ PFNGLGENSAMPLERSPROC GenSamplers;
        /*  336 */ PFNGLGETSAMPLERPARAMETERFVPROC GetSamplerParameterfv;
        /*  337 */ PFNGLGETSAMPLERPARAMETERIVPROC GetSamplerParameteriv;
        /*  338 */ PFNGLISSAMPLERPROC IsSampler;
        /*  339 */ PFNGLSAMPLERPARAMETERFPROC SamplerParameterf;
        /*  340 */ PFNGLSAMPLERPARAMETERFVPROC SamplerParameterfv;
        /*  341 */ PFNGLSAMPLERPARAMETERIPROC SamplerParameteri;
        /*  342 */ PFNGLSAMPLERPARAMETERIVPROC SamplerParameteriv;
        /*  343 */ PFNGLVERTEXATTRIBDIVISORPROC VertexAttribDivisor;
        /*  344 */ PFNGLCLEARDEPTHFPROC ClearDepthf;
        /*  345 */ PFNGLDEPTHRANGEFPROC DepthRangef;
        /*  346 */ PFNGLGETSHADERPRECISIONFORMATPROC GetShaderPrecisionFormat;
        /*  347 */ PFNGLRELEASESHADERCOMPILERPROC ReleaseShaderCompiler;
        /*  348 */ PFNGLSHADERBINARYPROC ShaderBinary;
        /*  349 */ PFNGLBINDTRANSFORMFEEDBACKPROC BindTransformFeedback;
        /*  350 */ PFNGLDELETETRANSFORMFEEDBACKSPROC DeleteTransformFeedbacks;
        /*  351 */ PFNGLGENTRANSFORMFEEDBACKSPROC GenTransformFeedbacks;
        /*  352 */ PFNGLGETINTERNALFORMATIVPROC GetInternalformativ;
        /*  353 */ PFNGLGETPROGRAMBINARYPROC GetProgramBinary;
        /*  354 */ PFNGLINVALIDATEFRAMEBUFFERPROC InvalidateFramebuffer;
        /*  355 */ PFNGLINVALIDATESUBFRAMEBUFFERPROC InvalidateSubFramebuffer;
        /*  356 */ PFNGLISTRANSFORMFEEDBACKPROC IsTransformFeedback;
        /*  357 */ PFNGLPAUSETRANSFORMFEEDBACKPROC PauseTransformFeedback;
        /*  358 */ PFNGLPROGRAMBINARYPROC ProgramBinary;
        /*  359 */ PFNGLPROGRAMPARAMETERIPROC ProgramParameteri;
        /*  360 */ PFNGLRESUMETRANSFORMFEEDBACKPROC ResumeTransformFeedback;
        /*  361 */ PFNGLTEXSTORAGE2DPROC TexStorage2D;
        /*  362 */ PFNGLTEXSTORAGE3DPROC TexStorage3D;
        /*  363 */ PFNGLGETPOINTERVPROC GetPointerv;
        /*  364 */ PFNGLDEBUGMESSAGECALLBACKPROC DebugMessageCallback;
        /*  365 */ PFNGLDEBUGMESSAGECALLBACKKHRPROC DebugMessageCallbackKHR;
        /*  366 */ PFNGLDEBUGMESSAGECONTROLPROC DebugMessageControl;
        /*  367 */ PFNGLDEBUGMESSAGECONTROLKHRPROC DebugMessageControlKHR;
        /*  368 */ PFNGLDEBUGMESSAGEINSERTPROC DebugMessageInsert;
        /*  369 */ PFNGLDEBUGMESSAGEINSERTKHRPROC DebugMessageInsertKHR;
        /*  370 */ PFNGLGETDEBUGMESSAGELOGPROC GetDebugMessageLog;
        /*  371 */ PFNGLGETDEBUGMESSAGELOGKHRPROC GetDebugMessageLogKHR;
        /*  372 */ PFNGLGETOBJECTLABELPROC GetObjectLabel;
        /*  373 */ PFNGLGETOBJECTLABELKHRPROC GetObjectLabelKHR;
        /*  374 */ PFNGLGETOBJECTPTRLABELPROC GetObjectPtrLabel;
        /*  375 */ PFNGLGETOBJECTPTRLABELKHRPROC GetObjectPtrLabelKHR;
        /*  376 */ PFNGLGETPOINTERVKHRPROC GetPointervKHR;
        /*  377 */ PFNGLOBJECTLABELPROC ObjectLabel;
        /*  378 */ PFNGLOBJECTLABELKHRPROC ObjectLabelKHR;
        /*  379 */ PFNGLOBJECTPTRLABELPROC ObjectPtrLabel;
        /*  380 */ PFNGLOBJECTPTRLABELKHRPROC ObjectPtrLabelKHR;
        /*  381 */ PFNGLPOPDEBUGGROUPPROC PopDebugGroup;
        /*  382 */ PFNGLPOPDEBUGGROUPKHRPROC PopDebugGroupKHR;
        /*  383 */ PFNGLPUSHDEBUGGROUPPROC PushDebugGroup;
        /*  384 */ PFNGLPUSHDEBUGGROUPKHRPROC PushDebugGroupKHR;
        };
    };

    /* Built-in loader library handle. Set by gloamVulkanInitialize*Context /
     * gloamLoaderLoad*Context when it opens the platform library. If the
     * caller pre-populates this field, the open is skipped and ownership is
     * NOT taken (gloam will not close it). Present on all context types so
     * user code can use a single field name regardless of API.
     */
    void *gloam_loader_handle;

    /* Non-zero if gloam opened the library handle itself and is responsible
     * for closing it in gloamVulkanFinalize / gloamLoaderUnload.
     */
    uint8_t gloam_loader_owns_handle;
} GloamGLContext;

/* Global context instance — a value, not a pointer, so the compiler knows
 * its address is fixed and does not re-load it on every access.
 */
extern GloamGLContext gloam_gl_context;

/* ---- Feature presence macros --------------------------------------------
